{
  "intents": [
    {
      "intent": "admissions_process",
      "examples": [
        "What is the admission process for AVCOE?",
        "How can I apply for a B.Tech program?",
        "Is there a management quota for admissions?",
        "When does the admission process begin?",
        "Are online applications accepted?",
        "What documents are required for admission?",
        "What is the last date to apply?",
        "How do I check my admission status?",
        "Is there a direct admission option available?",
        "Can international students apply to AVCOE?",
        "What are the different programs offered at AVCOE?",
        "How do I register for the entrance exam?",
        "Are there any admission fees for AVCOE?",
        "What is the procedure for lateral entry admissions?",
        "Can I apply for admission offline?",
        "Is there a helpline number for admission-related queries?",
        "Are there any quotas for reserved categories?",
        "What are the eligibility criteria for postgraduate programs?",
        "How many seats are available for each program?",
        "Can I apply for multiple courses at AVCOE?",
        "What is the refund policy for admission fees?",
        "When will the merit list be released?",
        "How can I download the admission brochure?",
        "Are there any deadlines for document submission?",
        "What is the selection process for international students?",
        "Does AVCOE conduct interviews for admissions?",
        "Can I submit scanned copies of my documents for verification?",
        "Are application fees refundable in case of withdrawal?",
        "Do I need to provide a migration certificate for admission?",
        "Is it mandatory to visit the college for document verification?",
        "What is the minimum age requirement for admission to AVCOE?",
        "Is there any relaxation in eligibility criteria for reserved categories?",
        "Can I get admission if I didn’t appear for any entrance exams?",
        "How can I update my contact details in the application form?",
        "Is there any provision for fee waivers for economically weaker sections?",
        "What are the important dates for the admission cycle?",
        "Are transfer students allowed to join AVCOE?",
        "What are the steps to secure admission under the NRI quota?",
        "Does AVCOE provide financial aid for students?",
        "Can I apply without having my 12th-grade results yet?",
        "What is the process for admission to the M.Tech program?",
        "Are admissions open for diploma-to-degree transitions?",
        "Can I take a gap year and still apply for admission?",
        "How can I request a change in the program I’ve applied for?",
        "Is there a waiting list for admissions at AVCOE?",
        "What is the procedure for re-admission after withdrawal?",
        "Do I need to appear for a separate counseling session?",
        "Can I book a seat in advance for the next academic year?",
        "Are there any mock tests available for the entrance exam?",
        "Is the admission process the same for lateral entry students?",
        "Does AVCOE offer any bridge courses for students with different backgrounds?",
        "Can I apply through an agent or consultant?",
        "What happens if I miss the admission deadline?",
        "Are there any demo classes available before admission?",
        "What are the medical examination requirements for admission?",
        "How do I apply for admission under the sports quota?",
        "Does AVCOE offer guidance for education loans?",
        "Can I bring my guardian for the admission counseling?",
        "What are the language requirements for international students?",
        "Are students with disabilities eligible for special provisions during admission?",
        "Is there a preference for students from Maharashtra in admissions?",
        "Can I submit multiple applications for different programs?",
        "How do I resolve technical issues during the online application?",
        "Are there any special scholarships for female students?",
        "Is there a separate admission portal for postgraduate programs?",
        "Can I apply for multiple quotas simultaneously?",
        "What is the penalty for withdrawing admission after enrollment?",
        "Is a study gap of more than 2 years acceptable?",
        "Are there any extracurricular achievements that can boost my chances?",
        "Can I reapply if my application was rejected earlier?",
        "Are admissions conducted in phases?",
        "What are the benefits of early application at AVCOE?",
        "How do I reset my password on the admissions portal?",
        "What is the procedure for verifying submitted documents?",
        "Does AVCOE offer walk-in admissions?",
        "Can I defer my admission to the next academic year?",
        "Are there any penalties for missing the entrance exam?",
        "What is the counseling fee, and is it refundable?",
        "How do I upload documents during the online application?",
        "Can I apply for admission if my entrance exam score is below the cutoff?",
        "Are there any prerequisites for attending the counseling session?",
        "Is Aadhaar mandatory for admission?",
        "Can I bring a friend to the campus tour?",
        "What is the process for applying to the Ph.D. program?",
        "Does AVCOE accept admission applications year-round?",
        "How will I be informed about admission updates?",
        "Can I choose my preferred department during admission?",
        "Are there any discounts on admission fees for siblings studying at AVCOE?",
        "Does AVCOE provide any relocation assistance for students from other states?",
        "What is the dress code for admission counseling sessions?",
        "Can I get admission if I don’t meet the age criteria?",
        "Are there evening or part-time courses available?",
        "Does AVCOE conduct any pre-admission workshops?",
        "How do I get my application reviewed if it is put on hold?",
        "Are there any specific entrance exams for postgraduate programs?",
        "Can I apply directly to the second year of the B.Tech program?",
        "Is there a mock counseling process before the actual session?",
        "How do I apply if I don’t have internet access?",
        "Are entrance exam scores from previous years accepted?",
        "What are the guidelines for international students regarding visas?",
        "Can I contact current students for admission advice?",
        "Does AVCOE have tie-ups with any coaching centers for admissions?",
        "How do I apply if I am currently studying abroad?",
        "What happens if my submitted documents are incomplete?",
        "Does AVCOE offer dual-degree programs?",
        "How many students are typically admitted each year?",
        "What are the benefits of securing admission through the management quota?",
        "Are there any trial classes for interested applicants?",
        "How are scholarships awarded during the admission process?",
        "Can I get admission without attending the counseling session?",
        "What are the language proficiency requirements for international students?",
        "Are part-time jobs allowed while pursuing a program?",
        "Does AVCOE offer hybrid learning options?",
        "How do I update my profile on the admissions portal?",
        "What are the rules for transferring credits from another university?",
        "Can I change my program preference after submitting my application?",
        "Are admission decisions made on a rolling basis?",
        "What is the expected timeline for admission confirmation?",
        "Can I attend an online counseling session instead of visiting the campus?",
        "Are parents allowed to attend the counseling process with students?"
      ],
      "responses": [
"The admission process involves filling out the application form online, submitting the required documents, appearing for counseling, and paying the fees to secure your seat.",
        "To apply for the B.Tech program, visit our official admissions portal and complete the online application. Ensure to submit the necessary documents and pay the application fee.",
        "Yes, there is a management quota for admissions. However, the seats are limited, and applicants must fulfill specific eligibility criteria.",
        "The admission process usually begins in the month of May. You can check the exact dates on our website once they are announced.",
        "Yes, online applications are accepted. You can fill out and submit your application through our admissions portal.",
        "Required documents include your 12th-grade mark sheet, entrance exam scorecard, identity proof (Aadhaar card), passport-sized photographs, and any additional documents specified in the brochure.",
        "The last date to apply for admission is usually in the month of June. Please visit the official website for the exact date and updates.",
        "You can check your admission status by logging into the admissions portal using your application ID and password.",
        "Yes, there is a direct admission option available under the management quota for certain programs. Please contact the admissions office for more details.",
        "Yes, international students can apply for admission to AVCOE. The process involves submitting specific documents like the passport, student visa, and others as per the guidelines.",
        "AVCOE offers various undergraduate and postgraduate programs, including B.Tech, M.Tech, MBA, and Ph.D. in different fields of study.",
        "To register for the entrance exam, visit the admissions portal, fill out the application form, and pay the exam fee. You will then receive your admit card.",
        "Yes, there are admission fees for AVCOE. The exact amount varies depending on the course, and you can find the fee details in the admission brochure.",
        "The lateral entry admission process allows students with a diploma or equivalent qualification to join the second year of the B.Tech program. Specific eligibility criteria apply.",
        "Yes, you can apply for admission offline by visiting the admissions office, obtaining the application form, filling it out, and submitting the required documents in person.",
        "For admission-related queries, you can contact our helpline number, which is available on the admissions portal. Our support team will assist you.",
        "Yes, there are quotas for reserved categories such as SC/ST, OBC, and others. Specific eligibility criteria apply for these categories.",
        "The eligibility criteria for postgraduate programs vary depending on the course. Generally, a relevant undergraduate degree with a minimum percentage is required.",
        "The number of seats available for each program is limited. You can check the exact seat availability on the official website under each program's details.",
        "Yes, you can apply for multiple courses at AVCOE. However, you must fill out separate application forms for each course.",
        "The refund policy for admission fees is mentioned in the admission brochure. Generally, a partial refund may be available if you withdraw before a certain deadline.",
        "The merit list is typically released after the counseling process. You can check it on the admissions portal once it's available.",
        "To download the admission brochure, visit the official admissions portal and find the download link for the brochure. It is available in PDF format.",
        "Yes, there are deadlines for document submission. Please check the admission portal for the latest updates on document submission deadlines.",
        "The selection process for international students includes document verification, entrance exam (if applicable), and counseling. Detailed guidelines are available on the admissions portal.",
        "No, interviews are not conducted for admissions. Admissions are based on entrance exam scores, merit, and counseling sessions.",
        "Yes, scanned copies of your documents can be submitted for verification during the online application process.",
        "Application fees are generally non-refundable. However, you can refer to the admission brochure for specific cases where refunds may apply.",
        "Yes, a migration certificate may be required for students coming from universities or boards other than those recognized by AVCOE.",
        "Yes, it is mandatory to visit the college for document verification after receiving your admission offer. This is to verify your original documents.",
        "The minimum age requirement for admission to AVCOE varies based on the program. Typically, students must be at least 17 years old for undergraduate programs.",
        "Yes, relaxation in eligibility criteria may be provided for reserved category students. Please refer to the official brochure for detailed information.",
        "No, you must appear for the relevant entrance exam to be eligible for admission unless you're applying under the management quota or for certain specific programs.",
        "To update your contact details, you can log into the admission portal, navigate to your profile, and modify the required fields.",
        "Yes, AVCOE offers fee waivers for economically weaker sections under certain conditions. Please check the admission brochure for eligibility and process details.",
        "The important dates for the admission cycle are announced every year on the admissions portal. Be sure to check the portal for updates on deadlines and events.",
        "Yes, transfer students may be allowed to join AVCOE, subject to specific eligibility criteria and seat availability. You will need to submit the required documents and follow the transfer procedure.",
        "The NRI quota admission process involves submitting a separate application and providing relevant documents like the NRI status, passport, and other academic records.",
        "Yes, AVCOE provides financial aid options in the form of scholarships and educational loans. Please refer to the admission brochure for more details.",
        "Yes, you can apply even if your 12th-grade results are not yet declared, provided you fulfill the minimum eligibility criteria based on your previous academic records.",
        "The process for admission to the M.Tech program is similar to that of undergraduate programs but may also require specific entrance exams like GATE, depending on the course.",
        "Yes, admissions for diploma-to-degree transitions are available under lateral entry provisions. Eligibility criteria apply based on your diploma program.",
        "Yes, you can take a gap year and still apply for admission, as long as you fulfill the eligibility requirements.",
        "To request a change in the program you've applied for, please contact the admissions office before the admission process begins.",
        "Yes, there is a waiting list for admissions if some students do not confirm their seats by the deadline. You may be offered a seat if one becomes available.",
        "The procedure for re-admission after withdrawal depends on the specific circumstances and program. You may need to reapply and meet the eligibility requirements.",
        "Yes, you need to attend the counseling session to finalize your admission. You will be allotted a seat based on your performance in the entrance exam and counseling.",
        "Seats cannot be booked in advance. Admission is based on the merit list and the completion of the application process.",
        "Yes, there are mock tests available for the entrance exam. You can access them through the admissions portal to practice and prepare for the exam.",
        "Yes, the admission process is the same for lateral entry students. You will need to meet the eligibility criteria and follow the process specified for lateral entry admissions.",
        "Yes, AVCOE offers bridge courses for students with different academic backgrounds to help them catch up with the program requirements.",
        "Yes, you can apply through an agent or consultant. However, please ensure that the agent is authorized by AVCOE.",
        "If you miss the admission deadline, you may not be able to apply for that academic year. However, you can apply the following year or for the next available session.",
        "Yes, demo classes are available for interested applicants before admission. Please check the admissions portal for details on scheduling.",
        "Medical examination requirements may vary depending on the program. Please refer to the admission brochure for specific medical fitness guidelines.",
        "To apply for admission under the sports quota, you need to provide relevant sports certificates and follow the process specified for sports quota admissions.",
        "Yes, AVCOE offers guidance for education loans in collaboration with various banks. You can inquire about this during the admission process.",
        "Yes, you can bring your guardian to the admission counseling session. However, only the student will be considered for seat allocation.",
        "The language requirements for international students include proficiency in English. Proof of language proficiency may be required based on your country of origin.",
        "Yes, students with disabilities are eligible for special provisions during admission, including relaxation in eligibility criteria and additional support during exams.",
        "Yes, there is a preference for students from Maharashtra in admissions for certain programs. This is as per the state government guidelines.",
        "Yes, you can submit multiple applications for different programs. However, you will need to pay the application fee separately for each program.",
        "To resolve technical issues during the online application, you can contact the technical support team via the helpdesk number or email provided on the admissions portal.",
        "Yes, there are scholarships specifically for female students. The details can be found in the admission brochure or on the scholarships page of the website.",
        "Yes, there is a separate admission portal for postgraduate programs. Please visit the portal to apply for M.Tech, MBA, or other postgraduate courses.",
        "Yes, you can apply for multiple quotas simultaneously, provided you meet the eligibility criteria for each quota.",
        "The penalty for withdrawing admission after enrollment typically involves the forfeiture of a portion of the admission fees. Check the refund policy for more details.",
        "A study gap of more than 2 years may be acceptable if you can provide a valid explanation and meet the eligibility criteria.",
        "Yes, extracurricular achievements may help boost your chances of admission, particularly if you apply under the sports quota or for specific merit-based scholarships.",
        "Yes, you can reapply if your application was rejected earlier, provided you meet the updated eligibility criteria.",
        "Yes, admissions are conducted in phases, and each phase has specific deadlines. You can apply in any of the phases as long as you're eligible.",
        "Applying early for admission gives you a better chance of securing a seat, as seats may be limited. You can also avail of certain early application benefits.",
        "If you forget your password on the admissions portal, you can reset it using the 'Forgot Password' option and follow the instructions sent to your registered email.",
        "The procedure for verifying submitted documents involves reviewing them during the counseling session, where you will need to present the original copies for verification.",
        "AVCOE does not offer walk-in admissions. All admissions must go through the online application process and counseling.",
        "Yes, you can defer your admission to the next academic year in some cases. Please contact the admissions office for specific guidelines.",
        "Missing the entrance exam may disqualify you from the admission process. However, you can apply for subsequent years.",
        "The counseling fee varies depending on the program. You can refer to the official website for more information on counseling fees and whether they are refundable.",
        "During the online application, you can upload your documents directly to the portal. Ensure that they meet the required file format and size specifications.",
        "If your entrance exam score is below the cutoff, you may not be eligible for admission. However, you can apply for management quota seats if available.",
        "Yes, you must fulfill the prerequisites for attending the counseling session. The exact requirements will be listed on the admissions portal.",
        "Aadhaar is not mandatory for admission, but it is highly recommended for identity verification during the application process.",
        "Yes, you can bring a friend to the campus tour. However, only the applicant will be allowed to attend the counseling session.",
        "The process for applying to the Ph.D. program involves submitting a research proposal and relevant academic documents. You may also be required to attend an interview.",
        "AVCOE does not accept year-round admission applications. Applications are accepted only during the official admission cycle.",
        "You will be informed about admission updates via email and through notifications on the admissions portal.",
        "Yes, you can express your preferred department during the admission process, although the final allocation depends on seat availability and merit.",
        "There are no discounts specifically for siblings studying at AVCOE, but some scholarships may be available. Check the scholarships section for more details.",
        "AVCOE does not provide relocation assistance for students from other states, but you can find accommodation options nearby.",
        "The dress code for admission counseling sessions is formal or semi-formal attire. Please dress appropriately for the session.",
        "You may still get admission, but you will need to meet the eligibility criteria based on the program you're applying for.",
        "AVCOE does not currently offer evening or part-time courses. All programs are full-time.",
        "Yes, AVCOE conducts pre-admission workshops to help you prepare for the entrance exams and familiarize yourself with the campus.",
        "If your application is put on hold, you can contact the admissions office to inquire about the status and resolve any issues with your application.",
        "Yes, there are specific entrance exams for postgraduate programs like M.Tech and MBA. Check the program details for more information.",
        "Yes, you can apply directly to the second year of the B.Tech program if you're eligible under the lateral entry provisions.",
        "There is no mock counseling process. However, you can refer to previous years' counseling sessions for guidance.",
        "If you don’t have internet access, you can apply for admission through the offline process by visiting the admissions office.",
        "AVCOE only accepts valid entrance exam scores from the current year for admission. Scores from previous years are not considered.",
        "International students must follow specific visa guidelines, which can be found on the admissions portal under the 'International Students' section.",
        "Yes, you can contact current students for admission advice. They can share their experiences and provide insights into the admission process.",
        "AVCOE does not have official tie-ups with coaching centers for admissions. However, you may find various coaching options for entrance exam preparation.",
        "Yes, if you are currently studying abroad, you can apply for admission by submitting the required academic records and following the regular application process.",
        "If your documents are incomplete, your application will be rejected. You must submit all required documents before the deadline.",
        "No, AVCOE does not offer dual-degree programs. You can apply for a single-degree program of your choice.",
        "The number of students admitted each year varies by program. You can check the specific seat availability on the official website.",
        "Securing admission through the management quota offers benefits like guaranteed seat availability, but it is subject to specific eligibility criteria and fees.",
        "Trial classes are not available during the admission process. However, you can inquire about demo sessions through the admissions office.",
        "Scholarships during the admission process are awarded based on merit, sports achievements, and special quotas. Detailed information is available in the scholarship section.",
        "You must attend the counseling session in person to finalize your admission. Admission is not granted without attending counseling.",
        "International students must meet specific language proficiency requirements in English. Details are available on the admissions portal.",
        "Yes, part-time jobs are allowed while pursuing a program, subject to university policies and local regulations.",
        "AVCOE currently does not offer hybrid learning options. All courses are conducted on-campus."
      ],
	 
	 "intent":"course_details",
	 "examples": [
        "What undergraduate engineering programs are offered at AVCOE?",
        "Can you provide details about the Computer Engineering course?",
        "What specializations are available in the Mechanical Engineering program?",
        "Tell me about the Artificial Intelligence and Data Science course.",
        "Is there a course in Automation and Robotics at AVCOE?",
        "What is the curriculum for the Electronics and Computer Engineering program?",
        "Does AVCOE offer a course in Information Technology?",
        "What are the subjects covered in the Electrical Engineering course?",
        "Can you provide information about the MBA program at AVCOE?",
        "What is the duration of the Production Engineering course?",
        "Are there any postgraduate courses in Engineering at AVCOE?",
        "What are the eligibility criteria for the Civil Engineering program?",
        "Does the Mechanical Engineering course include practical training?",
        "What is the fee structure for the Computer Engineering program?",
        "Are there any industry collaborations in the Electronics and Computer Engineering course?",
        "What are the career prospects after completing the Information Technology course?",
        "Can you provide details about the hostel facilities for students?",
        "Is there a provision for online learning in the MBA program?",
        "What is the intake capacity for the Electrical Engineering course?",
        "Are there any scholarships available for the Production Engineering program?",
		"What are the key subjects in the Civil Engineering program?",
        "Can you explain the course structure of Computer Engineering?",
        "How is the syllabus structured for Mechanical Engineering?",
        "Tell me more about the Artificial Intelligence program offered at AVCOE.",
        "What is the duration of the Electrical Engineering course?",
        "Are there internship opportunities in the Information Technology program?",
        "Can I pursue a career in Data Science after completing the Artificial Intelligence course?",
        "What electives are available in the MBA program?",
        "What is the admission procedure for the Electronics and Computer Engineering course?",
        "Are there any research opportunities in the Production Engineering program?",
        "Can I choose a specialization within the Mechanical Engineering course?",
        "What subjects are included in the first year of the Civil Engineering program?",
        "How do I know if I'm eligible for the Information Technology course?",
        "Is there a scope for higher studies after completing the MBA program?",
        "Can you provide a detailed curriculum of the Electrical Engineering course?",
        "Does the Artificial Intelligence course include real-world project work?",
        "What are the industry tie-ups in the Mechanical Engineering program?",
        "Is there any practical training included in the Electronics and Computer Engineering course?",
        "Are there placement opportunities for graduates of the Civil Engineering program?",
        "Can I pursue an M.Tech after completing the Computer Engineering course?",
        "Is there a provision for student exchange programs in the Mechanical Engineering course?",
        "How are projects integrated into the Artificial Intelligence course?",
        "What is the structure of the MBA program’s semester system?",
        "Can you provide an overview of the subjects covered in the Production Engineering course?",
        "Does AVCOE offer summer internships for Computer Engineering students?",
        "What are the career prospects after completing the Data Science and AI course?",
        "How competitive is the admission process for the Electronics and Computer Engineering course?",
        "Can I switch programs after the first year of the Mechanical Engineering course?",
        "What is the total number of seats available for the Civil Engineering course?",
        "Is the Information Technology course available in part-time mode?",
        "What international exposure is provided to students in the MBA program?",
        "How do the practical sessions work in the Electrical Engineering course?",
        "Does AVCOE provide any study material for the Artificial Intelligence program?",
        "How do I apply for the Electronics and Computer Engineering course?",
        "Is there any specific industry training provided in the Production Engineering program?",
        "Are there any options for elective subjects in the Mechanical Engineering course?",
        "What’s the procedure to get a degree in the Civil Engineering program?",
        "Can I take the Artificial Intelligence course online?",
        "What is the scope for interdisciplinary learning in the Information Technology program?",
        "Are there any professional certifications included in the MBA course?",
        "Does AVCOE offer any support for students to get internships in the Electrical Engineering course?",
        "Is there a specific focus on software development in the Computer Engineering course?",
        "How does AVCOE support students in placement after the Production Engineering course?",
        "What are the key highlights of the Mechanical Engineering program at AVCOE?",
        "Does the Electrical Engineering course involve practical exposure to renewable energy systems?",
        "Can I pursue a second course after completing the MBA program?",
        "How does the curriculum of the Artificial Intelligence program evolve over time?",
        "Are there any specializations offered within the Civil Engineering program?",
        "What career guidance is provided to students in the Electronics and Computer Engineering course?",
        "Is there a chance to study abroad for students in the Computer Engineering program?",
        "What is the format of the final year project in the Mechanical Engineering course?",
        "How is the placement assistance for students completing the Electrical Engineering program?",
        "Can I pursue a career in automation after completing the Production Engineering program?",
        "How do I prepare for the entrance exam for the Artificial Intelligence course?",
        "What types of workshops and seminars are organized for MBA students?",
        "Does the Electrical Engineering program include a focus on robotics?",
        "Can I apply for an internship before completing the Computer Engineering course?",
        "How much industry interaction is there in the Production Engineering program?",
        "Is there a chance to work on live projects during the Civil Engineering course?",
        "How is the balance between theory and practice in the Artificial Intelligence course?",
        "What type of practical exposure can I expect in the MBA program?",
        "Does the Computer Engineering program offer support for startup initiatives?",
		"What are the core subjects of the Computer Engineering course?",
        "Does the Mechanical Engineering program cover automation and robotics?",
        "Can I learn about data analytics in the Artificial Intelligence course?",
        "How is the course content of the MBA program structured?",
        "Does the Electrical Engineering program have any electives for renewable energy?",
        "What types of projects are included in the Civil Engineering course?",
        "Are there any special programs for female students in the Mechanical Engineering course?",
        "What is the level of difficulty in the Computer Engineering program?",
        "Is the AI course more focused on theoretical or practical learning?",
        "How can I choose my specialization in the Electrical Engineering program?",
        "Is there a focus on cloud computing in the Information Technology course?",
        "What are the lab facilities available for students in the Civil Engineering course?",
        "Does the MBA program offer any global business perspective?",
        "Can I pursue an internship abroad during the Artificial Intelligence course?",
        "What career paths are available after completing the Computer Engineering course?",
        "Does the Mechanical Engineering course include 3D modeling and CAD design?",
        "Are there any workshops conducted for the Electronics and Computer Engineering course?",
        "How do industry collaborations work in the MBA program?",
        "Can I pursue a career in cybersecurity after completing the Information Technology course?",
        "What practical experiences are integrated into the Electrical Engineering course?",
        "Is there a project-based learning approach in the Civil Engineering course?",
        "What is the final year project like in the Computer Engineering program?",
        "Does the MBA program cover entrepreneurship and startup management?",
        "How many credits are required to complete the Artificial Intelligence program?",
        "What are the best features of the Mechanical Engineering program at AVCOE?",
        "What subjects are taught in the first year of the MBA program?",
        "Is there an option to switch to another course in the middle of the program?",
        "Can I take up a dual degree with another engineering program?",
        "How do I prepare for the entrance exam for the Civil Engineering course?",
        "Does the Information Technology course offer specializations in AI or machine learning?",
        "How much time is dedicated to practical sessions in the Electrical Engineering program?",
        "What are the top industries hiring graduates of the Artificial Intelligence course?",
        "Are there any exchange programs for the Mechanical Engineering course?",
        "Does the Civil Engineering program include real-world site visits?",
        "How is research integrated into the MBA program?",
        "What are the industry-oriented electives offered in the Electronics and Computer Engineering program?",
        "Are there career services available for the Computer Engineering students?",
        "How does AVCOE help in networking opportunities for MBA students?",
        "Does the AI program prepare students for professional certifications?",
        "What software tools are used in the Mechanical Engineering labs?",
        "Can I take the Electrical Engineering course online?",
        "What type of certifications do I get in the Data Science program?",
        "Is there a focus on project management in the Civil Engineering course?",
        "Can I develop mobile applications in the Information Technology course?",
        "How much emphasis is given to coding skills in the Computer Engineering course?",
        "Is the Mechanical Engineering course aligned with industry standards?",
        "How do the AI course professors support students with research projects?",
        "Are there group projects in the MBA program?",
        "Is there a capstone project in the Civil Engineering course?",
        "Does AVCOE offer any exchange opportunities with international universities for the AI course?",
		"How do I choose the electives in the Computer Engineering course?",
        "Can I opt for a part-time study program in the MBA course?",
        "What practical skills will I acquire in the Civil Engineering program?",
        "What is the teaching methodology for the Artificial Intelligence course?",
        "How many semesters are there in the Electrical Engineering program?",
        "Can I take up an online version of the MBA course?",
        "Are there any specializations offered in the Mechanical Engineering course?",
        "What type of internship opportunities are available in the AI program?",
        "How is the final project structured in the Civil Engineering course?",
        "What research opportunities are there for students in the MBA program?",
        "What are the prerequisites for enrolling in the Computer Engineering program?",
        "What is the duration of the Artificial Intelligence course?",
        "Does the Electrical Engineering program include any industry visits?",
        "What are the unique features of the Information Technology course?",
        "How is AI integrated into the Computer Engineering course?",
        "Are there any global business modules in the MBA program?",
        "Is there a focus on sustainability in the Mechanical Engineering course?",
        "What are the career prospects after completing the Civil Engineering course?",
        "Can I do a part-time job during the MBA course?",
        "Does the Artificial Intelligence program include deep learning concepts?",
        "What kind of assignments can I expect in the Electrical Engineering course?",
        "What are the job roles I can pursue after completing the Information Technology course?",
        "How are student projects handled in the Mechanical Engineering program?",
        "Does the Civil Engineering course include software like AutoCAD and STAAD Pro?",
        "What technical skills will I develop during the AI program?",
        "What research areas are available in the Computer Engineering course?",
        "Are there any collaboration opportunities with tech companies in the MBA program?",
        "How is hands-on learning incorporated into the Mechanical Engineering program?",
        "What subjects are taught in the first semester of the Civil Engineering program?",
        "Does the Information Technology course offer a data science track?",
        "How do I apply for the Artificial Intelligence course at AVCOE?",
        "What are the grading criteria for the Computer Engineering program?",
        "How is the MBA program different from the BBA program?",
        "Can I study abroad during the Mechanical Engineering course?",
        "Does the Civil Engineering program cover construction law and ethics?",
        "How much emphasis is placed on coding in the Information Technology course?",
        "What is the assessment process like for the Artificial Intelligence program?",
        "Can I pursue a master's degree after completing the Computer Engineering course?",
        "What extracurricular activities are available for students in the MBA program?",
        "Are there any industry certifications available for the Mechanical Engineering program?",
        "Does the Civil Engineering course include sustainability and green building practices?",
        "Can I work on live industry projects in the Artificial Intelligence course?",
        "What type of career services are available for the Information Technology students?",
        "How do the assignments in the Computer Engineering program help with practical skills?",
        "Can I take up a certificate course along with the MBA program?",
        "How is the Mechanical Engineering course aligned with modern industry requirements?",
        "What kind of final year project do I have to work on in the Civil Engineering program?",
		"Can I choose a combination of subjects in the Computer Engineering course?",
        "What are the lab requirements for the Mechanical Engineering program?",
        "Are there any opportunities for international internships in the MBA program?",
        "What programming languages are covered in the Information Technology course?",
        "Does the Civil Engineering course include any sustainable building practices?",
        "How does the Artificial Intelligence program prepare students for the job market?",
        "Are there any certifications offered in the Mechanical Engineering program?",
        "Does the MBA program offer specialization in Finance?",
        "What is the curriculum structure of the Electrical Engineering program?",
        "Can I transfer credits from another university into the Civil Engineering program?",
        "How are students assessed in the Artificial Intelligence course?",
        "Does the Computer Engineering program focus on cloud computing?",
        "How much importance is given to team-based projects in the MBA course?",
        "What is the scope of the Artificial Intelligence program in terms of research?",
        "How does the Mechanical Engineering course incorporate robotics into the curriculum?",
        "Are there any internship programs in the MBA program for international students?",
        "What subjects are covered in the first year of the Information Technology course?",
        "Does the Civil Engineering course focus on structural engineering?",
        "Is there a capstone project in the Computer Engineering program?",
        "What types of career counseling are provided to students in the MBA program?",
        "Are there any industrial tours included in the Mechanical Engineering program?",
        "What software tools are taught in the Civil Engineering program?",
        "How are practical skills developed in the Artificial Intelligence course?",
        "What are the job prospects after completing the MBA program?",
        "How does the Information Technology course help with industry certifications?",
        "What skills can I gain in the Electrical Engineering program?",
        "Are there options for a double major in the Mechanical Engineering course?",
        "What electives are offered in the Artificial Intelligence program?",
        "Can I do an internship during my course in the Civil Engineering program?",
        "What is the work-life balance like for students in the MBA program?",
        "Are there any special summer programs offered in the Information Technology course?",
        "What areas of Civil Engineering will be focused on in the final year?",
        "Can I take an advanced level of programming in the Computer Engineering program?",
        "What professional development opportunities are provided in the MBA program?",
        "Does the Artificial Intelligence course cover the use of AI in healthcare?",
        "What are the benefits of completing the MBA program for my career?",
        "Does the Mechanical Engineering program provide opportunities for student research?",
        "Are there online resources available for students in the Civil Engineering program?",
        "Can I choose elective subjects in the Electrical Engineering course?",
        "What kind of leadership training is provided in the MBA program?",
        "Does the Computer Engineering program include cloud-based projects?",
        "Are there job fairs and recruitment drives for students in the Mechanical Engineering program?",
        "Can I pursue higher studies after completing the Information Technology course?",
        "How are industry connections incorporated into the Artificial Intelligence program?",
        "Are there study materials available for the Electrical Engineering course?",
        "Does the Civil Engineering program offer a focus on transportation engineering?",
        "What is the faculty-to-student ratio in the MBA program?",
        "Does the MBA program include business case studies?",
        "What skills do students gain from the Artificial Intelligence course?",
        "Is there a research-focused track in the Mechanical Engineering program?",
        "Can I work on projects related to AI in healthcare in the Artificial Intelligence course?",
        "Are there student clubs related to the Information Technology course?",
        "How does the Electrical Engineering program focus on renewable energy?",
        "What are the future career opportunities after completing the Computer Engineering course?",
        "Are there industry collaborations in the Mechanical Engineering program?",
        "Can I pursue a dual degree in the MBA program?",
        "How does the Civil Engineering course incorporate environmental engineering?"
    ],
    "responses": [
        "AVCOE offers a variety of undergraduate engineering programs, including Civil Engineering, Computer Engineering, Electronics and Computer Engineering, Mechanical Engineering, Electrical Engineering, Production Engineering, Artificial Intelligence and Data Science, and Automation and Robotics.",
        "The Computer Engineering program at AVCOE focuses on subjects like programming, data structures, algorithms, and software engineering, preparing students for careers in software development and IT industries.",
        "The Mechanical Engineering program offers specializations in areas such as thermodynamics, fluid mechanics, and machine design, providing students with a comprehensive understanding of mechanical systems.",
        "The Artificial Intelligence and Data Science course covers topics like machine learning, data analysis, and neural networks, equipping students with skills to work in the rapidly evolving field of AI.",
        "Yes, AVCOE offers a course in Automation and Robotics, focusing on the design and development of automated systems and robotic technologies.",
        "The Electronics and Computer Engineering program includes subjects like circuit design, embedded systems, and digital electronics, blending principles of electronics and computer science.",
        "Yes, AVCOE offers a course in Information Technology, covering areas such as networking, database management, and cybersecurity.",
        "The Electrical Engineering course at AVCOE includes subjects like electrical circuits, power systems, and control systems, providing a solid foundation in electrical engineering principles.",
        "The MBA program at AVCOE is a two-year full-time course focusing on business management, leadership, and strategic decision-making, covering subjects such as marketing, finance, operations, and human resources.",
        "The Production Engineering course at AVCOE focuses on manufacturing processes, quality control, and supply chain management, preparing students for careers in production and operations management.",
        "Yes, AVCOE offers postgraduate courses in Engineering, including M.Tech programs in various specializations.",
        "The eligibility criteria for the Civil Engineering program include a minimum percentage in the qualifying examination and a valid score in the entrance test, as specified by the college.",
        "Yes, the Mechanical Engineering course includes practical training through workshops, industrial visits, and project work, providing hands-on experience.",
        "The fee structure for the Computer Engineering program varies; detailed information is available on the official AVCOE website under the admissions section.",
        "Yes, the Electronics and Computer Engineering course has industry collaborations that provide students with exposure to real-world applications and internships.",
        "Graduates of the Information Technology course have career prospects in software development, network administration, and IT consulting, among others.",
        "AVCOE provides hostel facilities with amenities such as Wi-Fi, mess services, and recreational areas, ensuring a comfortable stay for students.",
        "The MBA program offers online learning options, allowing students to access course materials and lectures remotely.",
        "The intake capacity for the Electrical Engineering course is specified in the admission brochure; please refer to the official AVCOE website for the most accurate information.",
        "Yes, there are scholarships available for the Production Engineering program based on academic performance and other criteria; details are available on the AVCOE admissions page.",
		 "The Civil Engineering program at AVCOE covers subjects like surveying, construction materials, structural analysis, and transportation engineering. It also includes practical training through projects and internships.",
        "The Computer Engineering program's curriculum includes subjects like data structures, algorithms, computer networks, and programming languages, preparing students for careers in software and hardware engineering.",
        "The Mechanical Engineering program includes subjects like mechanics of solids, thermodynamics, fluid mechanics, and material science. Students also get hands-on training through labs and projects.",
        "The Artificial Intelligence program at AVCOE includes subjects like machine learning, neural networks, natural language processing, and AI ethics, providing students with a solid foundation in AI and Data Science.",
        "The Electrical Engineering course has a duration of four years, with subjects like electrical circuits, power systems, and electrical machines. Students also undertake projects and internships during the program.",
        "Yes, the Information Technology program provides opportunities for internships in IT companies, allowing students to gain practical experience and industry exposure.",
        "After completing the Artificial Intelligence course, students can pursue careers in data science, machine learning, AI research, and related fields in both the public and private sectors.",
        "The MBA program offers electives in areas such as finance, marketing, operations, HR, and entrepreneurship, allowing students to specialize in their area of interest.",
        "The admission procedure for the Electronics and Computer Engineering course includes an entrance exam, followed by counseling based on merit.",
        "Yes, the Production Engineering program includes research opportunities in areas like manufacturing processes, automation, and quality control.",
        "Yes, students in the Mechanical Engineering program can choose a specialization in fields like automotive engineering, thermal engineering, and robotics.",
        "In the first year of the Civil Engineering program, students study core subjects like mathematics, physics, chemistry, and introductory engineering courses.",
        "Eligibility for the Information Technology course includes a minimum of 50% marks in 12th grade with a science background and a valid score in the entrance exam.",
        "Yes, graduates of the MBA program can pursue higher studies in management or related fields, including pursuing a Ph.D. in business administration.",
        "The Electrical Engineering course includes subjects like electrical circuits, control systems, and power electronics, with a focus on both theoretical and practical aspects.",
        "Yes, the Artificial Intelligence course includes practical project work that allows students to apply their knowledge in real-world AI applications.",
        "The Mechanical Engineering program has strong industry tie-ups that provide students with internships, industry visits, and exposure to real-world engineering challenges.",
        "Yes, the Electronics and Computer Engineering program involves practical sessions on electronics circuit design, embedded systems, and robotics.",
        "Yes, graduates of the Civil Engineering program have excellent placement opportunities in construction companies, infrastructure development, and project management firms.",
        "Yes, after completing the Computer Engineering course, you can apply for M.Tech programs in various specializations like AI, cybersecurity, and software engineering.",
        "Yes, the Mechanical Engineering program offers student exchange programs with partner universities, allowing students to study abroad for a semester or more.",
        "In the Artificial Intelligence course, students work on projects such as developing machine learning models, AI-based applications, and data analytics projects.",
        "The MBA program follows a semester system, with two semesters each year. Each semester includes a mix of core courses, electives, and project work.",
        "The Production Engineering course covers subjects like manufacturing processes, quality control, industrial engineering, and supply chain management, focusing on both practical and theoretical learning.",
        "Yes, AVCOE offers summer internships for Computer Engineering students to work in IT companies, gaining practical experience in their field.",
        "Graduates of the Data Science and AI course have excellent career prospects in industries like healthcare, finance, technology, and marketing, with roles like data scientist, AI researcher, and machine learning engineer.",
        "The Electronics and Computer Engineering program has a competitive admission process based on entrance exam scores, academic performance, and availability of seats.",
        "Yes, students can switch programs after the first year, subject to availability and meeting eligibility criteria for the new program.",
        "The Civil Engineering course has an intake capacity of 120 students per year. For specific details, please refer to the official website.",
        "The Information Technology course is available in full-time mode only. However, some subjects may be available online.",
        "The MBA program offers international exposure through tie-ups with universities abroad, student exchange programs, and internships with multinational companies.",
        "The Electrical Engineering course includes practical sessions on power systems, electrical machines, and control systems, ensuring that students get hands-on experience in the field.",
        "Yes, the Artificial Intelligence program offers study materials and resources such as textbooks, online content, and lab assignments.",
        "The Electronics and Computer Engineering course is available for direct application through the official AVCOE website. Detailed instructions for the application process are available online.",
        "The Production Engineering program includes industry-specific training, project work, and internships to ensure that students gain practical experience in manufacturing and operations.",
        "The Mechanical Engineering course offers elective subjects like automotive engineering, thermodynamics, and material science for students to specialize in areas of their interest.",
        "The Civil Engineering course requires students to complete a capstone project as part of the final year, which allows them to apply their learning to real-world scenarios.",
        "Yes, the Artificial Intelligence course is available online with recorded lectures and virtual sessions, providing flexible learning opportunities.",
        "The Information Technology program includes interdisciplinary learning, with subjects like networking, cloud computing, and data security, allowing students to work across multiple domains.",
        "Yes, the MBA program includes professional certifications in areas like project management, business analysis, and financial modeling.",
        "The Electrical Engineering program offers placement assistance through campus recruitment drives and industry partnerships to help students secure internships and full-time employment.",
		"The Computer Engineering course covers subjects like computer architecture, software engineering, algorithms, and programming languages. Students also get hands-on training through coding projects and internships.",
        "Yes, the Mechanical Engineering program includes courses on automation, robotics, and advanced manufacturing processes, giving students practical skills in the automation industry.",
        "The Artificial Intelligence course covers topics like machine learning, data analytics, and natural language processing. Students work on real-world AI projects and case studies.",
        "The MBA program covers subjects such as organizational behavior, marketing, operations, and finance. The curriculum includes both theoretical and practical aspects of management.",
        "Yes, the Electrical Engineering program offers electives on renewable energy sources, smart grid systems, and energy storage technologies.",
        "In the Civil Engineering course, students work on projects related to structural design, construction planning, and surveying. They gain hands-on experience through site visits and internships.",
        "Yes, AVCOE has programs to encourage female students in the Mechanical Engineering course, including mentorship programs and career guidance.",
        "The Computer Engineering program is comprehensive, covering both foundational and advanced topics. It is designed to challenge students with problem-solving and coding tasks.",
        "The AI course includes both theoretical and practical learning. Students get exposure to real-world AI applications and work on projects involving data analytics, neural networks, and machine learning.",
        "Students in the Electrical Engineering program can choose their specialization in areas like power systems, control systems, or renewable energy, based on their interests.",
        "Yes, the Information Technology program includes a focus on cloud computing, data security, and networking as part of the curriculum.",
        "The Civil Engineering course provides lab facilities for surveying, structural analysis, and materials testing, enabling students to gain practical experience in construction and design.",
        "The MBA program provides a global business perspective, with courses covering international business, global market trends, and cross-cultural management.",
        "Yes, students in the Artificial Intelligence course have the opportunity to apply for internships abroad and gain international work experience.",
        "Graduates of the Computer Engineering course can pursue careers in software development, networking, system analysis, and cybersecurity, among others.",
        "Yes, the Mechanical Engineering course includes training on 3D modeling, CAD design, and simulation software, preparing students for careers in product design and manufacturing.",
        "Yes, workshops on industry-relevant topics like embedded systems, IoT, and robotics are regularly conducted in the Electronics and Computer Engineering program.",
        "The MBA program has strong industry collaborations, allowing students to interact with top executives, participate in live projects, and attend business seminars.",
        "Yes, the Information Technology course includes specializations in cybersecurity, data science, cloud computing, and software engineering, preparing students for various tech roles.",
        "The Electrical Engineering program provides hands-on training in electrical circuits, control systems, and power generation, ensuring students develop practical skills.",
        "The Civil Engineering course includes a project-based learning approach, where students work on real-life construction projects to apply their knowledge in practical scenarios.",
        "The Computer Engineering program includes a final-year project where students work on cutting-edge technologies like AI, machine learning, or software development.",
        "Yes, the MBA program includes modules on entrepreneurship, innovation, and startup management, allowing students to gain insight into the world of business startups.",
        "The Artificial Intelligence program requires students to complete a set number of credits, including core subjects, electives, and practical project work to graduate.",
        "The Mechanical Engineering program is known for its hands-on approach, offering access to labs and industry projects. It prepares students for roles in automotive, aerospace, and industrial engineering.",
        "In the first year of the MBA program, students study foundational subjects such as economics, accounting, marketing, and business law, preparing them for advanced management topics.",
        "Switching courses in the middle of the program is possible but depends on meeting the eligibility criteria for the new program and the availability of seats.",
        "AVCOE does not currently offer dual degree programs. However, students can pursue higher studies after completing their course.",
        "To prepare for the Civil Engineering entrance exam, students should focus on subjects like mathematics, physics, and chemistry, along with solving previous years' question papers.",
        "The Information Technology course includes specializations in AI, machine learning, and data science, enabling students to develop expertise in these high-demand fields.",
        "The Electrical Engineering program includes 50% practical sessions, ensuring that students gain significant hands-on experience in various electrical engineering fields.",
        "Graduates of the Artificial Intelligence program are highly sought after by industries like finance, healthcare, e-commerce, and automotive, with roles in AI development and research.",
        "Yes, the Mechanical Engineering course offers exchange programs with partner universities, giving students the opportunity to study abroad and gain global exposure.",
        "Yes, the Civil Engineering program includes site visits to construction projects, enabling students to observe real-world construction processes and apply their learning.",
        "The MBA program integrates research with coursework, allowing students to engage in research projects that align with their areas of interest and career goals.",
        "Electives in the Electronics and Computer Engineering program include subjects like embedded systems, IoT, digital signal processing, and artificial intelligence.",
        "The Computer Engineering course has an active career services team that helps students secure internships and full-time placements through industry connections and job fairs.",
        "AVCOE supports MBA students with networking opportunities through alumni events, industry meetups, and business conferences.",
        "The Artificial Intelligence program prepares students for professional certifications in machine learning, deep learning, and AI development, providing them with recognized credentials.",
        "The Mechanical Engineering labs are equipped with software like AutoCAD, SolidWorks, and MATLAB for simulations, 3D modeling, and analysis of mechanical systems.",
        "The Electrical Engineering course is available in both full-time and online modes, with online resources, live sessions, and recorded lectures.",
        "Yes, the Data Science program offers certifications in machine learning, big data analytics, and data visualization, which can enhance career prospects.",
        "Yes, the Civil Engineering course includes a focus on project management, construction planning, and quality control, preparing students for leadership roles in construction projects.",
        "The Information Technology course includes hands-on training in mobile app development using frameworks like React Native and Flutter, enabling students to build cross-platform applications.",
        "Coding is an essential skill in the Computer Engineering program, and students are trained in languages like Java, C++, Python, and SQL to enhance their programming skills.",
        "Yes, the Mechanical Engineering course is aligned with industry standards and includes subjects like CAD, CAM, and industrial engineering that reflect current industry practices.",
        "The AI course professors actively support students with research projects by providing guidance on data sets, algorithm selection, and model evaluation techniques.",
        "The MBA program encourages collaborative work through group projects, case studies, and internships that promote teamwork and leadership skills.",
        "Yes, the Civil Engineering course includes a capstone project in the final year, where students work on an industry-related project to apply their learning in a practical scenario.",
        "AVCOE offers exchange programs with international universities, allowing students to gain exposure to global research and technology trends in the AI field.",
		"The Computer Engineering course allows students to choose electives based on their interests, such as artificial intelligence, software development, or network security, starting from the third semester.",
        "Yes, AVCOE offers a flexible MBA program that allows students to pursue part-time studies while managing professional commitments, with weekend or evening classes.",
        "The Civil Engineering program focuses on practical skills such as construction management, surveying, and structural design. Students also get exposure to project management tools and software.",
        "The Artificial Intelligence course follows a blend of lectures, practical labs, and industry collaborations. Professors emphasize problem-solving and project-based learning to ensure practical skills.",
        "The Electrical Engineering program spans eight semesters (four years) with a balance of theory and practical work, including lab sessions, industry visits, and internships.",
        "Yes, the MBA program offers an online mode for working professionals who want to enhance their management skills while continuing their careers.",
        "The Mechanical Engineering program offers specializations in areas like thermodynamics, robotics, mechatronics, and automation, depending on your interest area.",
        "Students in the Artificial Intelligence program get opportunities to work with industry partners for internships and research projects that enhance real-world skills in AI and machine learning.",
        "The final project in the Civil Engineering course involves working on a real-world construction problem, where students apply their theoretical knowledge and present practical solutions.",
        "The MBA program offers several research opportunities in fields like entrepreneurship, marketing, finance, and human resources, allowing students to work closely with faculty and industry professionals.",
        "To enroll in the Computer Engineering program, students must have a strong foundation in subjects like mathematics, physics, and computer science from their previous studies.",
        "The Artificial Intelligence course is a two-year program that includes foundational topics in AI, followed by specialized tracks in machine learning, deep learning, and data science.",
        "Yes, the Electrical Engineering program includes multiple site visits to power stations, factories, and industries, providing students with real-world insights into the electrical engineering field.",
        "The Information Technology course offers several features, including coding boot camps, industry projects, and specializations in fields like cybersecurity and cloud computing, all designed to enhance employability.",
        "AI is integrated into the Computer Engineering course through specialized subjects like machine learning, data science, and robotics. Students get hands-on training in AI technologies.",
        "Yes, the MBA program includes modules on global business strategies, international marketing, and cross-cultural management, helping students understand the dynamics of the global business environment.",
        "The Mechanical Engineering course integrates sustainability principles in subjects like sustainable energy, green manufacturing, and eco-friendly product design.",
        "After completing the Civil Engineering course, you can pursue careers in construction management, urban planning, infrastructure design, and environmental engineering, among others.",
        "Yes, MBA students have the flexibility to work part-time or engage in internships, allowing them to gain industry experience while completing their coursework.",
        "Yes, the Artificial Intelligence program includes deep learning as part of its curriculum, covering topics like neural networks, deep convolutional networks, and reinforcement learning.",
        "The Electrical Engineering course includes various assignments related to circuit design, power systems, control systems, and other practical aspects of electrical engineering.",
        "Graduates of the Information Technology course can work in roles like software development, data analytics, system administration, and IT consulting.",
        "The Mechanical Engineering program includes individual and group projects where students work on real-life engineering challenges, often in collaboration with industry partners.",
        "Yes, the Civil Engineering course includes software like AutoCAD for design, STAAD Pro for structural analysis, and Primavera for project management.",
        "Students in the AI program will develop technical skills in machine learning, data preprocessing, algorithm design, and deep learning, all essential for working in AI-related fields.",
        "The Computer Engineering course offers research opportunities in areas like computer networks, AI, software development, and data science, encouraging students to pursue innovative projects.",
        "The MBA program offers collaboration opportunities with tech companies through industry internships, guest lectures, and joint research projects, allowing students to build strong networks.",
        "Hands-on learning in the Mechanical Engineering program is integrated through lab sessions, industry projects, and real-world problem-solving assignments, ensuring students get practical experience.",
        "In the first semester of the Civil Engineering program, students are introduced to subjects like engineering mechanics, surveying, and construction materials, building a strong foundation for future semesters.",
        "Yes, the Information Technology course offers a track in data science, where students learn to analyze and interpret complex data using programming languages like Python and R.",
        "To apply for the Artificial Intelligence course, you need to meet the eligibility criteria based on your previous academic qualifications and entrance exam scores. The application process can be completed online through the official website.",
        "The Computer Engineering program uses a combination of assignments, exams, projects, and practical work. The grading is based on how well you understand the theory and apply it in practice.",
        "The MBA program focuses on higher-level strategic management, while the BBA program is a foundational course in business administration. The MBA program offers a deeper understanding of leadership and managerial decision-making.",
        "Yes, there are exchange programs with partner universities where you can study abroad for a semester or a year as part of the Mechanical Engineering course.",
        "The Civil Engineering course includes aspects of construction law, ethical practices in engineering, and project management, giving students an understanding of legal considerations in construction.",
        "The Information Technology course includes coding assignments in multiple programming languages, such as Python, Java, and C++, ensuring that students gain essential programming skills for their careers.",
        "The assessment process for the Artificial Intelligence program includes both theoretical exams and practical assessments. Students are also evaluated on their research projects and industry collaboration.",
        "Yes, the Computer Engineering course is a great foundation for pursuing a master's degree in computer science, AI, or software engineering at top universities.",
        "The MBA program offers various extracurricular activities such as business case competitions, networking events, entrepreneurship workshops, and more to enhance leadership and teamwork skills.",
        "The Mechanical Engineering program offers certifications in areas like 3D printing, CAD modeling, and robotics, which can help students stand out in the job market.",
        "Yes, the Civil Engineering course includes modules on sustainable construction practices, green buildings, and environmental impact assessments.",
        "In the Artificial Intelligence course, students work on live industry projects, where they apply their learning to real-world AI problems, often in collaboration with tech companies.",
        "The Information Technology course offers career services, including job placement assistance, resume building, interview preparation, and networking events with industry professionals.",
        "In the Computer Engineering program, assignments include coding projects, algorithm development, system design tasks, and simulations that help develop practical skills.",
        "Yes, you can pursue a certificate course in areas like data science, project management, or digital marketing alongside the MBA program.",
        "The Mechanical Engineering course aligns with modern industry standards through its focus on automation, robotics, smart manufacturing, and green technologies.",
        "The Civil Engineering course includes a comprehensive final year project that allows students to apply all the theoretical concepts and practical knowledge gained during the program.",
		"In the Computer Engineering program, you can choose electives from a range of subjects such as artificial intelligence, software engineering, or computer networks, allowing you to specialize in areas of interest.",
        "The Mechanical Engineering program requires students to complete hands-on work in well-equipped labs, including workshops, robotics labs, and simulation labs, to build practical skills.",
        "Yes, the MBA program offers opportunities for international internships in countries such as the USA, UK, and Germany, in collaboration with global industry partners.",
        "The Information Technology course covers multiple programming languages such as Python, Java, C++, and web technologies like HTML, CSS, JavaScript, and frameworks like React and Node.js.",
        "Yes, the Civil Engineering course integrates sustainable building practices and teaches students to design structures with a focus on energy efficiency, eco-friendly materials, and sustainability.",
        "The Artificial Intelligence program focuses on equipping students with a strong foundation in machine learning, deep learning, and data analytics, preparing them for careers in AI development, research, and application.",
        "Yes, the Mechanical Engineering program offers certifications in areas such as CAD design, robotics, and automation, which are valuable for students pursuing a career in the engineering field.",
        "The MBA program offers a specialization in Finance that covers topics like corporate finance, financial management, risk management, and investment analysis, among others.",
        "The Electrical Engineering program has a well-structured curriculum that spans theoretical concepts such as electrical circuits, control systems, and power systems, as well as practical lab work.",
        "Yes, you can transfer credits from another accredited university into the Civil Engineering program. The credit transfer process is subject to the approval of the academic board.",
        "Students in the Artificial Intelligence program are assessed through a combination of quizzes, exams, lab assignments, and research projects that demonstrate their proficiency in AI concepts and techniques.",
        "Yes, the Computer Engineering program includes a dedicated module on cloud computing, where students learn how to build, deploy, and manage applications in cloud environments like AWS and Azure.",
        "Team-based projects are integral to the MBA course, allowing students to work collaboratively on real-world business challenges, fostering leadership, teamwork, and problem-solving skills.",
        "The Artificial Intelligence program offers research opportunities in fields such as natural language processing, computer vision, and reinforcement learning, providing a strong foundation for advanced AI research.",
        "Robotics is integrated into the Mechanical Engineering course through projects and courses focused on automation, control systems, and robotics design, ensuring students gain hands-on experience.",
        "The MBA program offers international internship opportunities in countries like the USA, the UK, and Singapore, where students can gain valuable global business exposure.",
        "The Information Technology course covers subjects like programming fundamentals, web development, databases, data structures, algorithms, and cybersecurity in the first year to build a solid foundation.",
        "Yes, the Civil Engineering program includes subjects that focus on structural engineering, including topics like structural analysis, design, and construction management.",
        "Yes, the Computer Engineering program has a capstone project in the final year, where students work on real-world problems and solutions, often in collaboration with industry partners.",
        "The MBA program provides career counseling services to students, including resume building, mock interviews, and personalized job search strategies to help students land their ideal positions.",
        "The Mechanical Engineering program includes industrial tours to manufacturing facilities, automotive plants, and research labs to provide students with practical insights into the engineering industry.",
        "The Civil Engineering program covers a range of software tools such as AutoCAD for drafting, STAAD Pro for structural analysis, and Primavera for project scheduling.",
        "Practical skills in the Artificial Intelligence course are developed through hands-on projects, coding assignments, and research, where students apply AI algorithms to real-world challenges.",
        "After completing the MBA program, graduates can pursue careers in management, marketing, finance, operations, and human resources across a variety of industries.",
        "The Information Technology course provides students with resources to prepare for industry certifications like CompTIA, Cisco, and AWS, helping them gain valuable credentials.",
        "The Electrical Engineering program helps students develop skills in areas such as circuit design, power systems, microelectronics, and renewable energy, providing a broad foundation for a career in electrical engineering.",
        "No, the Mechanical Engineering program doesn't offer a double major. However, students can pursue a minor in a related field like robotics or automation to supplement their degree.",
        "In the Artificial Intelligence program, students can choose electives in areas like machine learning, deep learning, computer vision, and natural language processing, allowing them to specialize further.",
        "Yes, the Civil Engineering program allows students to undertake internships during the course, where they can gain valuable field experience and apply their theoretical knowledge.",
        "The work-life balance for MBA students is generally manageable, with a flexible schedule for classes, projects, and internships. Students can also balance part-time work alongside their studies.",
        "Yes, the Information Technology course offers summer programs and workshops on topics like web development, machine learning, and cybersecurity to give students a competitive edge.",
        "The Civil Engineering program focuses on structural engineering in the final year, where students apply their knowledge to design complex structures, conduct simulations, and work on large-scale projects.",
        "The Computer Engineering program offers advanced-level programming courses in languages like Java, C++, Python, and others, allowing students to deepen their coding skills and understanding of advanced concepts.",
        "The MBA program includes professional development activities such as leadership workshops, public speaking events, and networking with alumni and business leaders to enhance career growth.",
        "Yes, the Artificial Intelligence course covers AI applications in healthcare, including topics like AI in diagnostics, medical imaging, and personalized treatment plans.",
        "The MBA program provides excellent career prospects by equipping students with skills in management, leadership, and strategic thinking, making them highly sought-after by top employers.",
        "The Mechanical Engineering program offers students the opportunity to engage in student-led research projects, especially in areas like robotics, sustainable energy, and automation.",
        "Yes, the Civil Engineering program provides online resources such as lecture notes, study materials, and video tutorials to support student learning outside of the classroom.",
        "Yes, the Electrical Engineering program offers elective subjects in areas like renewable energy, smart grids, and electric vehicles, giving students a chance to specialize in the growing field of sustainable energy.",
        "The MBA program offers leadership training through courses in organizational behavior, strategic management, and team dynamics, ensuring that students are well-prepared for leadership roles in business.",
        "The Computer Engineering program includes cloud computing as part of its curriculum, with students gaining hands-on experience in deploying and managing cloud-based applications.",
        "The Mechanical Engineering program hosts annual job fairs and recruitment drives where students can meet with top employers from industries like automotive, manufacturing, and robotics.",
        "Yes, graduates of the Information Technology course are well-equipped to pursue higher studies in computer science, data science, or software engineering at reputed institutions.",
        "The Artificial Intelligence program incorporates industry collaborations, allowing students to work on live projects and connect with leading tech companies to explore career opportunities.",
        "Yes, the Electrical Engineering course provides students with access to study materials, textbooks, and online resources to support their learning in subjects like circuit theory and power systems.",
        "The Civil Engineering program includes a focus on transportation engineering in the later years, where students learn about transportation systems, traffic management, and infrastructure design.",
        "The MBA program has a faculty-to-student ratio of 1:15, ensuring that students receive personalized attention and mentorship from experienced professors and industry professionals.",
        "Yes, the MBA program includes a range of business case studies that help students develop critical thinking, problem-solving, and decision-making skills by analyzing real-world business situations.",
        "Students in the Artificial Intelligence course gain skills in machine learning, neural networks, data analysis, and AI programming languages like Python, which are crucial for AI-related careers.",
        "The Mechanical Engineering program offers a research track in areas such as material science, thermodynamics, and robotics, allowing students to contribute to cutting-edge research in engineering.",
        "Yes, the Artificial Intelligence course includes AI applications in healthcare, where students work on projects such as AI-based medical imaging, predictive healthcare systems, and personalized medicine.",
        "The Information Technology course offers student clubs such as the Coding Club and the Cybersecurity Club, where students can collaborate, participate in hackathons, and further enhance their skills.",
        "The Electrical Engineering program focuses on renewable energy in subjects like solar power, wind energy, and energy storage, preparing students for careers in the sustainable energy sector.",
        "After completing the Computer Engineering course, students can pursue careers in software development, AI, data analytics, cybersecurity, and systems engineering across various industries.",
        "The Mechanical Engineering program has collaborations with industry leaders in robotics and manufacturing, allowing students to gain hands-on experience in emerging fields like automation and 3D printing.",
        "Yes, the MBA program allows students to pursue a dual degree, combining business administration with another field such as marketing, finance, or technology management for a broader skill set.",
        "The Civil Engineering program incorporates environmental engineering through courses on water resource management, sustainable infrastructure, and environmental impact assessments in construction."
    ],
	
	"intent": "admission_details",
    "examples": [
        "What are the eligibility criteria for admission to the Computer Engineering program?",
        "How can I apply for admission to the MBA program?",
        "When does the admission process begin for the Civil Engineering course?",
        "What are the minimum marks required for admission to the Mechanical Engineering program?",
        "Do I need to appear for any entrance exams for the Information Technology course?",
        "Is there any age limit for admission to the Artificial Intelligence program?",
        "Can I apply for direct admission to the Electrical Engineering program?",
        "What documents are required for admission to the MBA course?",
        "How can I check the admission status for the Civil Engineering program?",
        "What is the procedure for applying to the MBA program?",
        "Are there any reservation quotas for admission to the Computer Engineering program?",
        "Can I apply for admission through JEE score for the Mechanical Engineering program?",
        "Is there an online application process for the Information Technology program?",
        "What is the last date to apply for admission to the Civil Engineering course?",
        "Are there any scholarships available for students applying to the MBA program?",
        "What is the selection process for the Artificial Intelligence course?",
        "How do I submit my application for the Electrical Engineering program?",
        "Is there an entrance exam for the MBA program?",
        "What is the admission fee for the Computer Engineering program?",
        "Can I change my course preference after applying for admission to the MBA program?",
        "Are there any specific subject requirements for admission to the Civil Engineering program?",
        "What is the cutoff score for admission to the Information Technology program?",
        "How many seats are available for the Mechanical Engineering program?",
        "Are there any financial aid options for students applying to the MBA program?",
        "How can I track the progress of my admission application?",
        "Are there any specific entrance exams for admission to the Electrical Engineering program?",
        "Do I need to provide a portfolio for the Artificial Intelligence program?",
        "What is the application fee for the Civil Engineering course?",
        "Is there any age relaxation for reserved category candidates in the MBA program?",
        "Can I apply for admission through management quota for the Information Technology course?",
        "When will the counseling process begin for the Mechanical Engineering program?",
        "Are there any hostel facilities available for MBA program students?",
        "How do I submit my application for the Computer Engineering program?",
        "Are there any special criteria for NRI students applying to the Civil Engineering program?",
        "Can I apply for admission if I have a diploma in a related field?",
        "What are the steps involved in the admission process for the Artificial Intelligence program?",
        "Is there any entrance exam for students applying to the MBA course?",
        "How can I get the admission brochure for the Information Technology course?",
        "What is the fee structure for the Mechanical Engineering program?",
        "How do I apply for a scholarship for the MBA program?",
        "What are the required documents for applying to the Electrical Engineering program?",
        "Is there a merit-based scholarship available for the Computer Engineering program?",
        "Can I apply for admission in the second year if I am transferring from another university?",
        "Are there any special preferences for female students in the MBA program?",
        "How can I apply for hostel accommodation for the Civil Engineering course?",
        "Do I need to appear for a personal interview for the Artificial Intelligence program?",
        "When is the last date to submit the admission application for the MBA program?",
        "Can I change my course preference after the application submission?",
        "Are there any provisions for lateral entry into the Information Technology program?",
        "Is there a separate entrance exam for the Electrical Engineering course?",
        "Can I apply for admission through the JEE Main score for the MBA program?",
        "Are there any special discounts for students applying to the Civil Engineering course?",
		"Can I apply for a master's program after completing my undergraduate degree?",
        "What is the eligibility for the Bachelor of Arts program?",
        "What is the admission process for a BTech course in the AVCOE College?",
        "What is the fee for a diploma program in Mechanical Engineering?",
        "Can I apply for admission if I have a backlog?",
        "Is there any online admission process for postgraduate courses?",
        "When does the last date to apply for engineering courses end?",
        "How can I get an admission brochure for the Information Technology program?",
        "Are there any special scholarships for students applying for an MBA program?",
        "Do I need a letter of recommendation for admission to the Computer Science program?",
        "What is the procedure for admission to the PhD program in Civil Engineering?",
        "How can I apply for the lateral entry in the Electrical Engineering course?",
        "What are the documents required for admission to the BTech course?",
        "Is there a discount in fees for early admission to the MBA program?",
        "What is the age requirement for admission to the undergraduate programs?",
        "Are there any reservations for students from rural areas in the admission process?",
        "What is the cut-off for the Bachelor of Business Administration course?",
        "Is it necessary to have a science background for the Computer Engineering program?",
        "Can I apply for a second chance if my first application gets rejected?",
        "Are there any entrance exams for the management programs?",
        "How can I check if my admission application has been shortlisted?",
        "What is the application procedure for students who completed their studies abroad?",
        "Are there any provisions for students who have completed their education through correspondence?",
        "How many rounds of counseling are there for the BTech admissions?",
        "Can I apply for an NRI quota for the BTech program?",
        "What documents are needed for international students applying to the MBA program?",
        "What is the minimum percentage required in 12th for admission to the MBA course?",
        "Can I apply for multiple courses at the same time?",
        "Do I need to submit an entrance exam score for the BTech program?",
        "Is there a limit on the number of attempts for entrance exams?",
        "How can I submit my application for the diploma program?",
        "What is the minimum age for applying to the undergraduate programs?",
        "What are the additional fees for hostel accommodation for the MBA course?",
        "Are there any seat reservations for sports achievers during admission?",
        "Is the admission process for BTech and MBA the same?",
        "What is the procedure for international students seeking admission to the Civil Engineering program?",
        "Can I submit my application late with a penalty fee?",
        "What is the difference between direct admission and merit-based admission for engineering courses?",
        "Is there a facility for online payment of admission fees?",
        "How can I apply for the MBA program if I have work experience?",
        "Are there any additional requirements for admission to the Artificial Intelligence course?",
        "What is the last date for submitting documents for admission to the undergraduate courses?",
        "Do I need to provide a medical certificate for admission?",
        "Can I apply for admission through the sports quota?",
        "Are there any discounts for students applying through the JEE exam scores?",
        "Can I change my preferences for course selection after admission?",
        "Do I have to appear for a personal interview for the MBA program?",
        "How is the admission decision made for students with foreign qualifications?",
        "Is there a relaxation in eligibility criteria for candidates from certain states?",
        "What is the refund policy if I decide to withdraw my admission?",
        "How can I get information about the hostel facilities for the MBA program?",
        "How many seats are available in the undergraduate courses?",
        "Is there a limit on the number of applications I can submit?",
        "How long does it take for admission results to be announced?",
        "Do I need to appear for a physical fitness test for the engineering programs?",
        "Are there any special provisions for economically weaker section students in the admission process?",
        "Can I submit my application for admission offline?",
        "What is the procedure for getting a migration certificate for admission?",
        "What is the process for applying for a transfer to another department after admission?",
        "What is the eligibility criteria for an MBA program for a non-commerce graduate?",
        "Is there a specific form to fill for applying for financial aid?",
        "How do I apply for a hostel if I have been admitted to the MBA course?",
        "Is there any separate entrance exam for admission to postgraduate programs?",
        "What are the advantages of applying through the management quota?",
        "Do I need to submit any physical copies of documents after applying online?",
        "Can I get a scholarship for pursuing the Civil Engineering program?",
        "Is the MBA admission process based on CAT, MAT, or any other exams?",
        "Are the admissions based purely on academic performance or is there a weightage for extracurricular activities as well?",
        "What is the duration of the MBA program?",
        "How can I get more information regarding the curriculum of the Computer Science course?",
        "What is the average salary for students who graduate from the Computer Engineering program?",
        "Can I take admission in the MBA program if I do not have a business background?",
        "Is the undergraduate engineering admission based only on merit or entrance exams as well?",
        "What is the minimum passing percentage required for admission to the MBA course?",
        "How are the seats allocated in the BTech programs?",
        "Can I submit the application for admission through the college's official app?",
        "What is the admission process for students coming from other states?",
        "Is there a dedicated helpline for the admission process?",
        "Can I apply for the MBA program if I have a gap in my education?",
        "What is the average cost of living for students admitted to the MBA program?",
        "What are the requirements for candidates applying under the management quota for the MBA course?",
        "How can I make corrections in my submitted admission application?",
        "Is it possible to apply for admission after the last date with late fee payment?",
        "What is the average age of students admitted to the BTech programs?",
		"What is the admission process for engineering at AVCOE?",
    "How can I apply for admission at AVCOE?",
    "Tell me the admission process for B.Tech at AVCOE.",
    "What are the steps for admission to AVCOE?",
    "How do I apply for a seat in AVCOE engineering courses?",
    "What is the process for admission to AVCOE for engineering programs?"
    ],
    "responses": [
        "The eligibility criteria for the Computer Engineering program include a minimum of 50% in 10+2 with subjects like Physics, Chemistry, and Mathematics. Additional entrance exam scores may be required.",
        "To apply for the MBA program, you need to visit the official college website, fill in the online application form, and submit necessary documents like your graduation mark sheets and entrance exam scorecards.",
        "The admission process for the Civil Engineering course generally begins in the month of May. Keep an eye on the official college website for the exact dates.",
        "The minimum marks required for admission to the Mechanical Engineering program is 60% in 10+2 with Physics, Chemistry, and Mathematics as the core subjects.",
        "Yes, for the Information Technology course, you need to appear for an entrance exam like JEE or an equivalent test recognized by the college for eligibility.",
        "There is no specific age limit for admission to the Artificial Intelligence program, but candidates must meet the academic and entrance exam requirements.",
        "You cannot apply for direct admission to the Electrical Engineering program. Admission is based on merit and entrance exam scores.",
        "The required documents for the MBA course include your graduation mark sheet, entrance exam scorecard, valid ID proof, passport-sized photographs, and caste certificate (if applicable).",
        "You can check your admission status by logging into the official portal using your application number and date of birth.",
        "The procedure for applying to the MBA program includes online registration, filling in personal and academic details, uploading documents, and paying the application fee.",
        "Yes, the Computer Engineering program reserves a certain percentage of seats for candidates from reserved categories such as SC, ST, and OBC, as per government norms.",
        "Yes, you can apply for the Mechanical Engineering program using your JEE score, subject to meeting the required cutoff marks set by the institution.",
        "Yes, the Information Technology program has an online application process. You can fill out the application form and submit required documents through the official website.",
        "The last date to apply for the Civil Engineering course is typically in June. It is advised to apply as early as possible to avoid missing the deadline.",
        "Yes, the MBA program offers merit-based scholarships and financial aid to eligible students. You can apply for these scholarships by filling out the relevant section in your application.",
        "The selection process for the Artificial Intelligence program includes evaluating your entrance exam score, academic performance, and a personal interview if required.",
        "To submit your application for the Electrical Engineering program, you must visit the college website, create an account, fill out the application form, and pay the application fee.",
        "Yes, the MBA program has an entrance exam. Candidates must clear the exam with a minimum score to be considered for the interview and counseling process.",
        "The admission fee for the Computer Engineering program varies each year. You can check the latest fee structure on the official website or contact the admissions office for more details.",
        "Once you submit your application for the MBA program, you cannot change your course preference. However, you can choose electives once admitted to the program.",
        "Yes, for the Civil Engineering program, you must have studied Physics, Chemistry, and Mathematics in your 10+2. Any other combination will not meet the eligibility criteria.",
        "The cutoff score for the Information Technology program varies each year, depending on factors like the number of applicants and the difficulty level of the entrance exam.",
        "There are typically 60 seats available in the Mechanical Engineering program, and this can be subject to change depending on the academic year.",
        "Yes, the MBA program offers various financial aid options, including merit-based scholarships, loan facilities, and assistance for students from economically disadvantaged backgrounds.",
        "You can track the progress of your admission application by logging into the official admissions portal using your credentials, where you can see the status of your application.",
        "The Electrical Engineering program requires you to appear for an entrance exam like JEE or a state-level exam to secure a place in the program.",
        "You do not need to provide a portfolio for the Artificial Intelligence program. However, relevant academic qualifications and a strong entrance exam score are essential.",
        "The application fee for the Civil Engineering course can be found on the official website. The fee varies depending on the category of the candidate.",
        "There is no age relaxation for reserved category candidates for the MBA program. However, there might be other exemptions based on government norms.",
        "Yes, you can apply for the Information Technology program through management quota. However, the selection process and eligibility criteria for this category may differ from the regular admission process.",
        "The counseling process for the Mechanical Engineering program typically begins a few weeks after the declaration of the entrance exam results. You will be informed via the official website.",
        "Yes, the MBA program offers hostel facilities for both male and female students, with separate hostels, mess facilities, and other amenities.",
        "To submit your application for the Computer Engineering program, visit the official website, fill out the online application form, and submit the required documents.",
        "Yes, NRI students applying for the Civil Engineering program need to meet the eligibility criteria, including valid documentation for their NRI status, as outlined by the admissions office.",
        "Yes, if you have a diploma in a related field, you can apply for lateral entry into the second year of the undergraduate programs, subject to eligibility criteria.",
        "The admission process for the Artificial Intelligence program includes filling out the online application, submitting required documents, and appearing for the entrance exam and interview.",
        "The MBA program does not have an entrance exam for some courses, but most candidates are required to appear for exams like CAT, MAT, or GMAT.",
        "You can get the admission brochure for the Information Technology course by visiting the official website and downloading it or requesting a physical copy from the admissions office.",
        "The fee structure for the Mechanical Engineering program can be obtained from the official website. It includes tuition fees, lab fees, and other charges.",
        "To apply for a scholarship for the MBA program, you need to fill out the scholarship application form available on the admissions portal and meet the eligibility criteria.",
        "The required documents for applying to the Electrical Engineering program include your 10th and 12th mark sheets, entrance exam scorecard, ID proof, and passport-sized photos.",
        "Yes, the Computer Engineering program offers merit-based scholarships for students with high academic performance or achievements in extracurricular activities.",
        "If you're transferring from another university, you can apply for lateral entry into the second year of the program, subject to meeting the college's eligibility criteria and available seat intake.",
        "Yes, the MBA program has provisions for female students under government policies, including reservations in certain seats and financial aid programs.",
        "You can apply for hostel accommodation for the Civil Engineering course through the official hostel application portal, which opens after admission confirmation.",
        "For the Artificial Intelligence program, there may be a personal interview as part of the selection process, depending on the admissions procedure.",
        "The last date for submitting the MBA program admission application is generally in the month of June, but exact dates will be announced on the official website.",
        "No, once your application is submitted, you cannot change your course preference. You must make your decision before applying.",
        "Yes, the Information Technology program allows lateral entry for students with a diploma in related fields, subject to eligibility and seat availability.",
        "The Electrical Engineering course has a separate entrance exam which needs to be cleared for admission, and further details can be found on the admissions page.",
        "Yes, you can apply for admission to the MBA program through your JEE Main score, if applicable, for certain institutions or categories.",
        "Yes, discounts may be available for students applying to the Civil Engineering course under certain schemes. Check the official website for more information.",
		 "Yes, you can apply for a master's program after completing your undergraduate degree. Make sure to meet the eligibility requirements for the specific program.",
        "The eligibility for the Bachelor of Arts program typically requires a minimum of 50% in 10+2 from any recognized board. Specific requirements may vary.",
        "The admission process for the BTech course involves filling out the online application form, appearing for an entrance exam like JEE or CET, and attending counseling.",
        "The fee for a diploma program in Mechanical Engineering is generally available on the official website or the admission brochure. It varies based on category and scholarships.",
        "Yes, you can apply even if you have a backlog, as long as you clear it before the start of the program.",
        "Postgraduate courses at AVCOE generally follow an online application process, where you need to submit required documents and entrance exam scores.",
        "The last date to apply for engineering courses is usually in June, but make sure to check the official website for precise deadlines.",
        "You can get the admission brochure for the Information Technology program by visiting the admissions section on the official website and downloading it.",
        "Yes, the MBA program offers special scholarships based on merit, family income, and other criteria. Visit the scholarship section on the official website for more details.",
        "No, you do not need a letter of recommendation for admission to the Computer Science program. However, some specific courses may require one.",
        "The procedure for PhD admission in Civil Engineering includes filling out an online form, submitting research proposals, and attending an interview based on the department's requirement.",
        "Lateral entry for Electrical Engineering students is possible through the official admission process. You need to fulfill the eligibility criteria and provide necessary documentation.",
        "Required documents include your 10th and 12th mark sheets, entrance exam scorecard, valid ID, and other personal documents as specified on the admissions portal.",
        "Discounts on fees for early admission may be offered under certain circumstances. Please check the official website for any announcements regarding this.",
        "Undergraduate programs generally do not have an age limit, but certain courses may have specific requirements. Check the admission guidelines for more details.",
        "There may be provisions for seat reservations for rural area students under specific policies, as per government guidelines. Check the admission policy for more details.",
        "The cut-off for the Bachelor of Business Administration program depends on various factors such as the number of applicants and entrance exam scores.",
        "No, you do not need a science background for the Computer Engineering program. However, having Mathematics in your 10+2 is a requirement.",
        "If your application is rejected, you can apply again during the next admission cycle by following the required steps.",
        "Yes, the MBA program requires candidates to appear for entrance exams like CAT, MAT, or GMAT, depending on the guidelines provided.",
        "You can check the status of your admission application by logging into the admission portal using your credentials, where you will find updates.",
        "Students who completed their studies abroad can apply by following the international student admission process outlined on the official website.",
        "Students who have completed their education through correspondence can apply, but they must meet the eligibility criteria specified for distance education students.",
        "BTech admissions generally have two rounds of counseling. The exact number can vary based on the number of seats available.",
        "Yes, you can apply for the NRI quota for the BTech program. Please visit the admissions page for more information on NRI-specific guidelines.",
        "The required documents for international students include proof of nationality, academic records, passport, visa, and other relevant certificates.",
        "The minimum percentage for admission to the MBA program is typically 50% in your undergraduate degree from a recognized institution.",
        "Yes, you can apply for multiple courses at the same time by submitting separate applications for each course.",
        "No, you do not need to submit entrance exam scores for the BTech program if you are applying through management quota, but you must meet the eligibility criteria.",
        "There is no limit to the number of attempts for entrance exams as long as you meet the eligibility criteria for each attempt.",
        "You can submit your application for the diploma program through the official website by following the application process outlined there.",
        "The minimum age for applying to undergraduate programs is typically 17 years, but please refer to the course-specific eligibility criteria for more details.",
        "The additional fees for hostel accommodation in the MBA program vary based on the type of room and amenities. Please refer to the hostel fee section on the website.",
        "Yes, there may be reservations for sports achievers as per government norms. Visit the admission guidelines for more specific information.",
        "Yes, the admission process for BTech and MBA programs is different. The BTech program primarily depends on entrance exam scores, while the MBA program requires entrance exam scores as well as academic records.",
        "International students seeking admission to the Civil Engineering program should follow the specific admission procedure for foreign students, including document verification and eligibility checks.",
        "You cannot submit your application late unless there is a provision for late submissions with penalty fees, which can be clarified on the official website.",
        "Direct admission is different from merit-based admission. In direct admission, you are admitted through management quota or specific criteria, while merit-based admission depends on entrance exam scores and academic performance.",
        "Yes, there is an online payment system available for admission fees. You can pay via credit card, debit card, or other online payment methods.",
        "To apply for the MBA program with work experience, simply mention your experience in the application form. It will be considered during the selection process.",
        "Yes, for the Artificial Intelligence course, you may be required to submit additional documents or appear for a personal interview, depending on the specific criteria.",
        "The last date for submitting documents for admission to undergraduate courses is usually within a week after the counseling process.",
        "No, a medical certificate is not required for general admission. However, some specific programs may require a medical certificate.",
        "Yes, you can apply for admission through the sports quota if you have recognized achievements in sports. Check the admission guidelines for more details.",
		"To apply for admission to engineering courses at AVCOE, you need to follow these steps: 1. Appear for either JEE Main or MHT CET entrance exams. 2. Register and apply through the Centralized Admission Process (CAP) by DTE Maharashtra. 3. Submit necessary documents such as mark sheets, entrance exam scorecards, caste certificates (if applicable), and domicile certificates for verification. 4. Based on merit and preferences, seats will be allotted. 5. Pay the required fees and complete the admission formalities.",
    "The admission process for engineering at AVCOE includes appearing for an entrance exam (JEE Main or MHT CET), applying through CAP, document verification, seat allotment, and final confirmation of admission through payment of fees.",
    "To get admission to AVCOE, you must first appear for JEE Main or MHT CET, then apply through the CAP system. After document verification, seats are allotted based on merit, and you can confirm your admission by paying the fees.",
    "The process involves registering for and appearing in the JEE Main or MHT CET entrance exam, then applying through DTE Maharashtra's Centralized Admission Process (CAP). After document verification, seats are allocated based on merit, and admission is confirmed after fee payment.",
    "AVCOE admission for engineering is based on your entrance exam score (JEE Main or MHT CET). You will apply through DTE Maharashtra's CAP portal, submit documents for verification, and then secure your seat by paying the fees."
    ],
	
	"intent": "eligibility_criteria",
  "examples": [
    "What is the eligibility for applying to the B.Tech Civil Engineering course at AVCOE?",
    "Can I get admission to the Electrical Engineering program with a score of 45% in 12th?",
    "What subjects do I need to have studied for admission to AVCOE's Artificial Intelligence branch?",
    "What is the eligibility for the Computer Science program at AVCOE if I have a Science background?",
    "What are the eligibility criteria for the Mechanical Engineering course at AVCOE?",
    "Can I apply for AVCOE’s Electronics Engineering program with a diploma in Electronics?",
    "What is the eligibility criteria for the IT program at AVCOE for students who studied Computer Science?",
    "Can I apply for Data Science at AVCOE if I did not study Computer Science in school?",
    "Is there an age limit for applying to AVCOE’s engineering programs?",
    "Can I apply for B.Tech Mechanical Engineering if I studied Biology in 12th grade?",
    "What are the minimum marks required for admission to Civil Engineering at AVCOE?",
    "Do I need to have studied Physics, Chemistry, and Mathematics in 12th for Electrical Engineering?",
    "What are the admission requirements for the Artificial Intelligence and Data Science program?",
    "Is it mandatory to have studied Computer Science in 12th to apply for the Computer Science program?",
    "What is the minimum percentage required for admission to Mechanical Engineering at AVCOE?",
    "Can I get direct admission to Electronics Engineering with a diploma?",
    "Is Computer Science in 12th a requirement for the IT program at AVCOE?",
    "Can I apply for Data Science if I studied Biology instead of Computer Science in 12th?",
    "Is there any age limit for applying to B.Tech courses at AVCOE?",
    "Can I apply for Mechanical Engineering if I have a Science background with Biology?", 
    "What are the specific subjects required for Civil Engineering?",
    "What are the minimum marks for reserved category candidates in Electrical Engineering?",
    "Are there any other subjects besides Physics, Mathematics, and Chemistry accepted for Artificial Intelligence?",
    "Can I apply for Computer Science with other Science subjects besides Computer Science?",
    "What is the minimum percentage for reserved categories in Mechanical Engineering?",
    "What are the lateral entry options available for Electronics Engineering?",
    "Is there any preference for students who studied Computer Science in 12th for the IT program?",
    "Are there any alternative subjects considered for Data Science admissions?",
    "Is there an age limit for applying to AVCOE’s engineering programs?",
    "Can I apply for Mechanical Engineering if I have a Science background with any other subjects besides Physics, Chemistry, and Mathematics?",
    "Can I apply for Civil Engineering with subjects other than Physics, Chemistry, and Mathematics?",
    "What are the specific relaxation rules for reserved category candidates in Electrical Engineering?",
    "Are there any specific combinations of subjects accepted for Artificial Intelligence besides the ones mentioned?",
    "Can I apply for Computer Science with subjects like Electronics or Biotechnology?",
    "Are there any specific rules for reserved categories in Mechanical Engineering admissions?",
    "What are the details of the lateral entry process for Electronics Engineering?",
    "Does having studied Computer Science in 12th give me any advantage in the IT program?",
    "What are the other subjects considered for Data Science admissions besides Chemistry, Computer Science, and IT?",
    "What is the maximum age limit for admission to undergraduate programs at AVCOE?",
    "Can I apply for Mechanical Engineering if I have a Science background with any other combination of subjects?",
    "What are the specific subjects required for Civil Engineering and their minimum marks?",
    "What are the specific relaxation rules for reserved category candidates in Electrical Engineering admissions?",
    "Are there any other subject combinations accepted for Artificial Intelligence besides the ones mentioned?",
    "Can I apply for Computer Science with subjects like Biology or Economics?",
    "Are there any specific rules for reserved categories in Mechanical Engineering admission procedures?",
    "What are the details of the lateral entry process for Electronics Engineering at AVCOE?",
    "Does having studied Computer Science in 12th provide any weightage in the selection process for the IT program?",
    "What are the other subjects considered for Data Science admissions besides Chemistry, Computer Science, and IT?",
    "Is there any age limit specified for admission to undergraduate programs at AVCOE?",
    "Can I apply for Mechanical Engineering if I have a Science background with subjects like Biology or Biotechnology?",
    "What are the specific subjects required for Civil Engineering and their minimum marks?",
    "What are the specific relaxation rules for reserved category candidates in Electrical Engineering admissions?",
    "Are there any other subject combinations accepted for Artificial Intelligence besides the ones mentioned?",
    "Can I apply for Computer Science with subjects like Biology or Economics?",
    "Are there any specific rules for reserved categories in Mechanical Engineering admission procedures?",
    "What are the details of the lateral entry process for Electronics Engineering at AVCOE?",
    "Does having studied Computer Science in 12th provide any weightage in the selection process for the IT program?",
    "What are the other subjects considered for Data Science admissions besides Chemistry, Computer Science, and IT?",
    "Is there any age limit specified for admission to undergraduate programs at AVCOE?",
    "Can I apply for Mechanical Engineering if I have a Science background with subjects like Biology or Biotechnology?",
    "What are the specific subjects required for Civil Engineering and their minimum marks?",
    "What are the specific relaxation rules for reserved category candidates in Electrical Engineering admissions?",
    "Are there any other subject combinations accepted for Artificial Intelligence besides the ones mentioned?",
    "Can I apply for Computer Science with subjects like Biology or Economics?",
    "Are there any specific rules for reserved categories in Mechanical Engineering admission procedures?",
    "What are the details of the lateral entry process for Electronics Engineering at AVCOE?",
    "Does having studied Computer Science in 12th provide any weightage in the selection process for the IT program?",
    "What are the other subjects considered for Data Science admissions besides Chemistry, Computer Science, and IT?",
    "Is there any age limit specified for admission to undergraduate programs at AVCOE?",
    "Can I apply for Mechanical Engineering if I have a Science background with subjects like Biology or Biotechnology?",
    "What are the specific subjects required for Civil Engineering and their minimum marks?",
    "What are the specific relaxation rules for reserved category candidates in Electrical Engineering admissions?",
    "Are there any other subject combinations accepted for Artificial Intelligence besides the ones mentioned?",
    "Can I apply for Computer Science with subjects like Biology or Economics?",
    "Are there any specific rules for reserved categories in Mechanical Engineering admission procedures?",
    "What are the details of the lateral entry process for Electronics Engineering at AVCOE?",
    "Does having studied Computer Science in 12th provide any weightage in the selection process for the IT program?",
    "What are the other subjects considered for Data Science admissions besides Chemistry, Computer Science, and IT?",
    "Is there any age limit specified for admission to undergraduate programs at AVCOE?",
    "Can I apply for Mechanical Engineering if I have a Science background with subjects like Biology or Biotechnology?",
    "What are the specific subjects required for Civil Engineering and their minimum marks?",
    "What are the specific relaxation rules for reserved category candidates in Electrical Engineering admissions?",
    "Are there any other subject combinations accepted for Artificial Intelligence besides the ones mentioned?",
    "Can I apply for Computer Science with subjects like Biology or Economics?",
    "Are there any specific rules for reserved categories in Mechanical Engineering admission procedures?",
    "What are the details of the lateral entry process for Electronics Engineering at AVCOE?",
    "Does having studied Computer Science in 12th provide any weightage in the selection process for the IT program?",
    "What are the other subjects considered for Data Science admissions besides Chemistry, Computer Science, and IT?",
    "Is there any age limit specified for admission to undergraduate programs at AVCOE?",
    "Can I apply for Mechanical Engineering if I have a Science background with subjects like Biology or Biotechnology?",
    "What are the specific subjects required for Civil Engineering and their minimum marks?",
    "What are the specific relaxation rules for reserved category candidates in Electrical Engineering admissions?",
    "Are there any other subject combinations accepted for Artificial Intelligence besides the ones mentioned?",
    "Can I apply for Computer Science with subjects like Biology or Economics?",
    "Are there any specific rules for reserved categories in Mechanical Engineering admission procedures?",
    "What are the details of the lateral entry process for Electronics Engineering at AVCOE?",
    "Does having studied Computer Science in 12th provide any weightage in the selection process for the IT program?",
    "What are the other subjects considered for Data Science admissions besides Chemistry, Computer Science, and IT?",
    "Is there any age limit specified for admission to undergraduate programs at AVCOE?",
    "Can I apply for Mechanical Engineering if I have a Science background with subjects like Biology or Biotechnology?",
    "What are the specific subjects required for Civil Engineering and their minimum marks?",
    "What are the specific relaxation rules for reserved category candidates in Electrical Engineering admissions?",
    "Are there any other subject combinations accepted for Artificial Intelligence besides the ones mentioned?",
    "Can I apply for Computer Science with subjects like Biology or Economics?",
    "Are there any specific rules for reserved categories in Mechanical Engineering admission procedures?"
  ],
  "responses": [
     "To be eligible for Civil Engineering at AVCOE, you need to have passed HSC with Physics, Mathematics, and one additional subject, such as Chemistry or Biology. A minimum of 50% aggregate marks is required (45% for reserved category students from Maharashtra). Additionally, the candidate should meet the age and domicile requirements as per the Maharashtra state norms. Candidates with a background in Commerce will not be eligible for this program.",
    "For admission to Electrical Engineering at AVCOE, you must have completed HSC with Physics, Mathematics, and one additional subject (such as Chemistry or another related subject). Candidates with a Commerce background or without Physics and Mathematics will not be eligible for this program. The minimum required aggregate marks are 50% for general category students and 45% for reserved category students from Maharashtra.",
    "To apply for B.Tech in Artificial Intelligence at AVCOE, you must have completed HSC with Physics, Mathematics, and an additional subject such as Chemistry, Computer Science, or Electronics. A minimum of 50% aggregate marks is required for eligibility. It is important to note that students from a non-technical background may find the curriculum challenging, so a strong foundation in mathematics and science is recommended.",
    "Chemistry is not a mandatory requirement for the Computer Science program at AVCOE, but you must have completed HSC with Physics and Mathematics. The minimum required aggregate marks are 50%. Students who have studied IT or Computer Science as an elective in school are preferred, though it is not a strict requirement.",
    "For Mechanical Engineering at AVCOE, you need to have completed HSC with Physics, Mathematics, and Chemistry or another subject like Engineering Graphics. The minimum required marks are 50% (45% for reserved category students from Maharashtra). The program is highly hands-on, and candidates are encouraged to have a strong understanding of physics and mathematics.",
    "Candidates with a diploma in Engineering can apply for lateral entry to the B.Tech Electronics course at AVCOE, provided they have scored at least 50% marks in their diploma. The lateral entry process allows diploma holders to directly enter the second year of the B.Tech program, but they must meet all other criteria, including the subject requirements and age limits.",
    "If you have studied Computer Science in 12th grade, you are eligible to apply for the Information Technology program at AVCOE, provided you meet the minimum aggregate marks requirement of 50%. Students who have completed their HSC with a specialization in Computer Science or Information Technology will have an advantage in the admission process.",
    "The B.Tech Data Science program at AVCOE requires you to have completed HSC with Physics, Mathematics, and an additional subject such as Computer Science, IT, or Electronics. You must have at least 50% aggregate marks in your qualifying examination. Candidates should also be comfortable with coding and problem-solving, as the course emphasizes algorithms and statistical methods.",
    "To be eligible for the Civil Engineering program at AVCOE, you must have passed HSC with Physics, Mathematics, and one of the following additional subjects: Chemistry, Biology, or another relevant subject such as Computer Science or Engineering Graphics. You must secure at least 50% aggregate marks in your qualifying examination. Reserved category candidates from Maharashtra can apply with 45% marks.",
    "For Electrical Engineering at AVCOE, candidates need to have passed HSC with Physics, Mathematics, and Chemistry or another related subject, with a minimum aggregate of 50% marks (45% for reserved categories). In addition, the candidate must meet the specific age criteria and must be a resident of Maharashtra or have valid domicile status in the state.",
    "If you have completed your HSC in a vocational stream with relevant subjects, such as electrical or mechanical engineering, you may be eligible to apply for Electrical Engineering at AVCOE. However, you will need to meet the minimum percentage criteria and the specific subject requirements for the branch.",
    "The eligibility for B.Tech in Artificial Intelligence at AVCOE requires a background in science with Physics, Mathematics, and an additional technical subject like Computer Science or Electronics. It is important for applicants to have at least 50% aggregate marks in their qualifying examination and to be comfortable with mathematics and algorithms.",
    "For students who wish to apply for Mechanical Engineering, the candidate must have completed HSC with a combination of Physics, Mathematics, and one additional technical subject like Chemistry, Engineering Graphics, or Design. The minimum eligibility criteria are 50% aggregate marks (45% for reserved category students).",
    "In the case of lateral entry to B.Tech in Electronics Engineering, candidates with a diploma in Electronics or a related engineering field are eligible. To apply for lateral entry, you must have a diploma with a minimum of 50% marks and meet the necessary age and subject requirements.",
    "Candidates interested in Information Technology at AVCOE must have completed HSC with Physics, Mathematics, and an additional technical subject such as Computer Science. The program emphasizes software development, algorithms, and IT infrastructure, so students are encouraged to have prior knowledge of computer programming.",
    "For Data Science, a minimum of 50% aggregate marks in HSC with Physics, Mathematics, and Computer Science, IT, or Electronics is required. The course involves a combination of mathematics, statistics, and programming, so applicants should have strong analytical and problem-solving skills.",
    "For applicants with a background in Science and an interest in Civil Engineering, they must have completed HSC with Physics, Mathematics, and Chemistry or another related subject. The minimum percentage required is 50%, and reserved category candidates can apply with 45% aggregate marks."
  ],
  
 "intent": "course_offerings",
  "examples": [
    "What engineering programs are available at AVCOE?",
    "What courses does AVCOE offer for B.Tech students?",
    "Does AVCOE offer a program in Artificial Intelligence?",
    "Can I pursue Mechanical Engineering at AVCOE?",
    "Is Data Science available as a B.Tech course at AVCOE?",
    "What undergraduate programs are offered at AVCOE?",
    "Does AVCOE offer Computer Science as a B.Tech course?",
    "Are there any postgraduate engineering courses available at AVCOE?",
    "What are the available engineering streams at AVCOE?",
    "Can I study Electrical Engineering at AVCOE?",
    "Do you offer a program in Civil Engineering?",
    "Is there a B.Tech program in Information Technology at AVCOE?",
    "Are there any courses in Artificial Intelligence and Data Science at AVCOE?",
    "What B.Tech courses are available for students interested in robotics?",
    "Do you offer any courses related to VLSI Design?",
    "Can I do a B.Tech in Computer Science at AVCOE?",
    "What engineering degrees are offered at AVCOE?",
    "Are there any specialized engineering programs in AVCOE?",
    "Can I study Structural Engineering at AVCOE?",
    "Does AVCOE offer an M.Tech program in Power Systems?",
    "Is Software Engineering included in Computer Science at AVCOE?",
    "Does AVCOE provide Data Science as a specialization?",
    "What B.Tech streams are offered for students interested in mechanical design?",
    "Can I apply for B.Tech in Artificial Intelligence at AVCOE?",
    "Is there a program in Electronics Engineering at AVCOE?",
    "What is the focus of the Civil Engineering course at AVCOE?",
    "Are there any online programs available at AVCOE?",
    "Is there an Electrical Engineering course available for B.Tech students?",
    "Does AVCOE offer a course in Biotechnology?",
    "What courses can I pursue in Information Technology at AVCOE?",
    "Can I do a B.Tech in Artificial Intelligence and Machine Learning?",
    "Is there a specific program for students interested in renewable energy?",
    "Does AVCOE have courses in Environmental Engineering?",
    "Can I apply for a B.Tech program in Robotics at AVCOE?",
    "Are there any advanced programs in AI and Machine Learning at AVCOE?",
    "Does AVCOE offer a program in Cybersecurity?",
    "Are there opportunities to pursue an M.Tech in VLSI Design?",
    "What courses are part of the B.Tech in Computer Science Engineering at AVCOE?",
    "Does AVCOE offer M.Tech courses in Structural Engineering?",
    "Can I get an M.Tech degree in Thermal Engineering at AVCOE?",
    "Is there a B.Tech program in Biomedical Engineering at AVCOE?",
    "Do you offer an M.Tech program in Data Science?",
    "Are there any programs related to Cloud Computing at AVCOE?",
    "Can I pursue a B.Tech in Cloud Engineering at AVCOE?",
    "What is the structure of the Mechanical Engineering program at AVCOE?",
    "What subjects are covered under the Electrical Engineering program at AVCOE?",
    "Does AVCOE have any programs related to Robotics Engineering?",
    "Are there any interdisciplinary courses offered at AVCOE?",
    "Does AVCOE offer a specialized course in Machine Learning?",
    "Is there a program for Electrical and Electronics Engineering at AVCOE?",
    "Do you offer courses related to Artificial Intelligence in Information Technology?",
    "Is there a B.Tech course for students interested in network engineering?",
    "Can I take a program in Embedded Systems at AVCOE?",
    "Does AVCOE offer courses in Nano-Technology Engineering?",
    "Are there any specialized programs in Automation Engineering?",
    "Is Data Science a part of the undergraduate courses offered at AVCOE?",
    "What is the structure of the Artificial Intelligence course at AVCOE?",
    "Can I pursue a B.Tech in Aerospace Engineering at AVCOE?",
    "Does AVCOE have programs in Civil Engineering with a focus on construction?",
    "Is there a program in Geotechnical Engineering at AVCOE?",
    "Can I study Renewable Energy Engineering at AVCOE?",
    "Does AVCOE offer a program in Industrial Engineering?",
    "Is there a B.Tech course on Smart Grids at AVCOE?",
    "Can I pursue a B.Tech in Mechatronics at AVCOE?",
    "Are there any available courses in Software Development at AVCOE?",
    "Does AVCOE offer courses on Smart Systems and Sensors?",
    "Is there a program focusing on Digital Electronics at AVCOE?",
    "Can I study Electrical Power Engineering at AVCOE?",
    "Is there a focus on Internet of Things (IoT) in the curriculum?",
    "Can I take an interdisciplinary course in the field of Autonomous Systems?",
    "Are there specialized programs available in Cyber-Physical Systems?",
    "Does AVCOE offer courses in Blockchain technology?",
    "Can I pursue a program in Software Engineering with a focus on mobile development?",
    "Are there any Master’s programs offered in Electronics and Communication?",
    "Is there a B.Tech program in Embedded Systems at AVCOE?",
    "Do you offer a degree program focused on Cloud Architecture?",
    "Are there any courses related to Data Analytics at AVCOE?",
    "Does AVCOE offer any programs in Automation and Control Engineering?",
    "Can I study Smart Manufacturing Engineering at AVCOE?",
    "Does AVCOE offer a program for students interested in Artificial Intelligence and Robotics?"
  ],
  "responses": [
    "AVCOE offers a wide range of engineering programs, including B.Tech courses in Civil Engineering, Electrical Engineering, Mechanical Engineering, Computer Science and Engineering, Information Technology, Artificial Intelligence, and Data Science.",
    "At AVCOE, you can pursue various B.Tech programs like Civil Engineering, Electrical Engineering, Mechanical Engineering, Computer Science Engineering, Information Technology, and emerging programs like Artificial Intelligence and Data Science.",
    "Yes, AVCOE offers a B.Tech program in Artificial Intelligence. The course focuses on the application of machine learning, data analysis, and artificial intelligence technologies.",
    "Yes, Mechanical Engineering is available as a B.Tech program at AVCOE. The course covers key topics in mechanics, thermodynamics, robotics, and material science.",
    "AVCOE offers a B.Tech program in Data Science, which includes courses on data analysis, machine learning, statistical computing, and big data technologies.",
    "The undergraduate engineering programs offered at AVCOE include Civil Engineering, Electrical Engineering, Mechanical Engineering, Computer Science Engineering, Information Technology, Artificial Intelligence, and Data Science.",
    "Yes, Computer Science Engineering is available as a B.Tech program at AVCOE. The program covers topics such as software engineering, programming languages, computer networks, and artificial intelligence.",
    "AVCOE offers postgraduate programs, including M.Tech courses in various disciplines like Structural Engineering, Power Systems, and VLSI Design.",
    "The available engineering streams at AVCOE include Civil Engineering, Electrical Engineering, Mechanical Engineering, Computer Science and Engineering, Information Technology, and specialized courses in Data Science and Artificial Intelligence.",
    "Yes, Electrical Engineering is one of the B.Tech programs offered at AVCOE. The course focuses on power systems, electrical circuits, control systems, and renewable energy technologies.",
    "Yes, Civil Engineering is available at AVCOE. The program covers aspects of construction, structural design, and environmental engineering.",
    "AVCOE offers a B.Tech program in Information Technology, which includes courses on software development, networking, databases, and web technologies.",
    "Yes, Artificial Intelligence and Data Science are available as part of the B.Tech courses offered at AVCOE.",
    "AVCOE offers programs that include Mechanical Design and Robotics under the Mechanical Engineering and Robotics Engineering streams.",
    "Yes, AVCOE provides programs in VLSI Design, focusing on the design and development of semiconductor technologies.",
    "Yes, Computer Science Engineering is available. The program includes subjects like data structures, algorithms, machine learning, and cybersecurity.",
    "AVCOE provides both undergraduate and postgraduate engineering degrees in several disciplines like Civil Engineering, Computer Science Engineering, and more.",
    "There are specialized programs in Artificial Intelligence, Data Science, and Robotics Engineering at AVCOE, catering to the latest trends in technology.",
    "Yes, Structural Engineering is available as part of the postgraduate M.Tech program at AVCOE.",
    "AVCOE offers M.Tech courses in Power Systems, VLSI Design, and more, providing advanced learning opportunities for engineering students.",
    "The B.Tech in Computer Science Engineering includes courses on software engineering, programming languages, and artificial intelligence technologies.",
    "AVCOE offers postgraduate M.Tech courses in Structural Engineering, Thermal Engineering, and VLSI Design, among others.",
    "Yes, there is an M.Tech program in Power Systems focusing on electrical engineering and power distribution networks.",
    "AVCOE does not offer Biomedical Engineering but provides several other engineering streams like Electrical and Mechanical Engineering.",
    "Yes, Data Science is offered as part of the B.Tech curriculum, focusing on machine learning, data analysis, and programming skills.",
    "AVCOE offers specialized programs in Cloud Computing, Data Analytics, and Software Development.",
    "There is a focus on IoT technologies as part of the Information Technology and Electrical Engineering programs.",
    "Embedded Systems are a key part of the Electronics Engineering program at AVCOE, covering hardware and software integration.",
    "Yes, AVCOE offers several programs related to Data Analytics, with a focus on data science and machine learning.",
    "Yes, Cloud Architecture is available as part of the Information Technology and Computer Science programs.",
    "Yes, AVCOE offers a program in Smart Manufacturing Engineering, focusing on automation and industrial technologies.",
    "Yes, there is a focus on Robotics in both Mechanical Engineering and a dedicated Robotics Engineering program at AVCOE."
  ],
  
  
  "intent": "admission_process",
  "examples": [
    "What is the admission process for B.Tech at AVCOE?",
    "How can I apply for a B.Tech program at AVCOE?",
    "Is there an entrance exam for AVCOE admissions?",
    "When is the admission process for the 2025 batch starting?",
    "What documents are required for admission to AVCOE?",
    "How do I apply for a postgraduate program at AVCOE?",
    "What are the eligibility criteria for admission to AVCOE?",
    "Can I apply directly for admission to AVCOE?",
    "Is there an online application process for AVCOE?",
    "What is the deadline for AVCOE B.Tech applications?",
    "Where can I find the admission form for AVCOE?",
    "What are the steps involved in the AVCOE admission process?",
    "Can I apply for admission at AVCOE after my 12th?",
    "What is the application fee for AVCOE admissions?",
    "How do I know if I am eligible for AVCOE admission?",
    "Is there a counseling process for AVCOE admissions?",
    "Can I apply for multiple programs at AVCOE?",
    "How are merit lists prepared for AVCOE admissions?",
    "What documents do I need to submit for admission to AVCOE?",
    "Do I need to give an entrance exam for admission to AVCOE?",
    "Is there a separate admission process for NRI students at AVCOE?",
    "How much time does it take to process AVCOE admission applications?",
    "What is the minimum percentile required for AVCOE admissions?",
    "What are the important dates for AVCOE admissions?",
    "Can I apply for a management quota seat at AVCOE?",
    "Is the AVCOE admission process online or offline?",
    "When should I expect to receive the admission confirmation from AVCOE?",
    "Can I apply for a scholarship during the admission process at AVCOE?",
    "Is there a special procedure for direct admission to AVCOE?",
    "Are there any age restrictions for applying to AVCOE engineering courses?",
    "Do I need to submit a physical copy of documents to AVCOE?",
    "What should I do if I missed the AVCOE admission deadline?",
    "What are the eligibility criteria for lateral entry into B.Tech at AVCOE?",
    "How can I apply for an open seat in AVCOE engineering courses?",
    "Does AVCOE offer seat reservations for certain categories?",
    "Can I apply for AVCOE engineering admission from outside Maharashtra?",
    "Can I get admission in AVCOE without a valid MHT-CET score?",
    "How long does it take to complete the AVCOE admission process?",
    "Can I change my course selection during the AVCOE admission process?",
    "How do I apply for hostel facilities during the AVCOE admission process?",
    "Do I need to pay the full fee during the AVCOE admission process?",
    "Is there a merit-based scholarship program at AVCOE?",
    "What is the procedure for submitting my documents for AVCOE admission?",
    "How can I track my AVCOE admission status?",
    "Can I apply for AVCOE admission with a JEE score?",
    "What is the last date for submitting my AVCOE application?",
    "What happens if I submit incomplete documents during the AVCOE admission process?",
    "How can I make corrections to my AVCOE application?",
    "Is there a fee refund policy if I cancel my admission at AVCOE?",
    "What is the admission process for AVCOE's M.Tech programs?",
    "Is there an interview process for admission to AVCOE?",
    "Can I apply for AVCOE admission after a gap year?",
    "How do I check the AVCOE application status after submission?",
    "Is it possible to apply for AVCOE admission through both MHT-CET and JEE Main?",
    "How do I know if I am selected for counseling at AVCOE?",
    "Do I need to submit original documents during the AVCOE admission process?",
    "How do I apply for AVCOE if I belong to a special category?",
    "Can I apply for AVCOE admissions through a spot round?",
    "What is the application process for lateral entry students at AVCOE?",
    "Does AVCOE have a direct admission process for diploma holders?",
    "Is the AVCOE admission process based on JEE scores for certain branches?",
    "What is the minimum eligibility for admission to AVCOE?",
    "Can I apply for an engineering seat in AVCOE without appearing for an entrance exam?",
    "How can I get admission to AVCOE through the management quota?",
    "What documents do I need to provide for AVCOE admission?",
    "What is the age limit for applying to AVCOE?"
  ],
  "responses": [
    "The admission process for B.Tech at AVCOE involves filling out an online application form and submitting relevant documents. You also need to appear for the Maharashtra CET (MHT-CET) or JEE Main exam as per the eligibility criteria.",
    "To apply for a B.Tech program at AVCOE, you must complete the online application form available on the official website. You will need to provide your HSC or equivalent marks and qualifying exam scores like MHT-CET or JEE Main.",
    "Yes, AVCOE conducts admissions based on the Maharashtra CET (MHT-CET) or JEE Main scores. Candidates must meet the eligibility requirements and complete the application process within the given timeline.",
    "The admission process for the 2025 batch typically starts in June, with the release of the online application form and information brochure. Please check the official website for exact dates and updates.",
    "Documents required for admission include your HSC or equivalent mark sheet, MHT-CET or JEE Main scorecard, caste certificate (if applicable), domicile certificate, passport-sized photographs, and other supporting documents.",
    "For postgraduate programs like M.Tech, you need to fill out an online application form, provide your relevant academic documents, and appear for the entrance exam if applicable. GATE scores are generally considered for M.Tech admissions.",
    "The eligibility criteria for B.Tech admission include passing HSC or equivalent with Physics, Mathematics, and one additional subject. A valid MHT-CET or JEE Main score is also required. For reserved category candidates, the minimum marks may vary.",
    "Yes, you can apply directly for admission to AVCOE through the CAP (Centralized Admission Process) if you have a valid MHT-CET or JEE Main score. Alternatively, you can apply via the management quota depending on seat availability.",
    "Yes, AVCOE has an online application process. You can visit the official website, fill in your details, upload necessary documents, and pay the application fee.",
    "The deadline for B.Tech applications at AVCOE typically falls in the month of July, but it's advised to check the official website for specific dates and the application timeline for the 2025 academic year.",
    "The admission form for AVCOE can be found on the official website, where you can also get detailed instructions about the application process and fee submission.",
    "The admission process involves online registration, filling out the application form, paying the application fee, and submitting necessary documents. Candidates are selected based on their exam scores and eligibility.",
    "Yes, you can apply for admission at AVCOE after completing your 12th grade. The application must be submitted before the deadlines mentioned on the official website.",
    "The application fee for AVCOE admissions varies based on the program and category. Please check the official website for specific fee details.",
    "To know if you are eligible for AVCOE admission, check the eligibility criteria on the official website or consult the admission brochure for detailed guidelines.",
    "Yes, AVCOE conducts counseling for eligible candidates after the results of MHT-CET or JEE Main are announced. Counseling involves seat allotment based on ranks and preferences.",
    "Yes, you can apply for multiple programs at AVCOE. However, each program may have its own eligibility criteria and admission process.",
    "Merit lists for AVCOE admissions are prepared based on the candidate's entrance exam scores, eligibility, and reservation category, following the CAP process for Maharashtra state students.",
    "Documents needed for AVCOE admission include your HSC or equivalent mark sheet, valid entrance exam scorecards, category certificates (if applicable), and address proof.",
    "Yes, you need to give an entrance exam (MHT-CET or JEE Main) for B.Tech admissions at AVCOE. The exam scores will play a vital role in the selection process.",
    "AVCOE does have a separate process for NRI students, which typically includes submitting additional documents like NRI status, passport copies, and other relevant certificates.",
    "It generally takes a few weeks to process AVCOE admission applications after submission. You can track the status on the official website.",
    "There is no specific percentile requirement for AVCOE admissions, but candidates must meet the minimum eligibility requirements and have a valid score in MHT-CET or JEE Main.",
    "Important dates for AVCOE admissions are available on the official website. It is recommended to check regularly for updates regarding the application process and deadlines.",
    "Yes, you can apply for a management quota seat at AVCOE depending on the availability of seats and fulfilling the eligibility requirements.",
    "AVCOE offers an online application process. You can fill the form, upload documents, and pay the application fee on the official website.",
    "You will receive an admission confirmation email or SMS once your application is processed and you are selected for the program. Confirmation also includes further instructions.",
    "Yes, you can apply for a scholarship through the admission process at AVCOE. The college provides scholarships based on merit and financial need.",
    "The AVCOE direct admission process is available for students who meet eligibility requirements but do not fall under regular counseling procedures. For more details, contact the admission office.",
    "There is no specific age restriction for applying to AVCOE. However, the applicant must fulfill the eligibility criteria and admission requirements.",
    "No, AVCOE does not require physical copies of documents during the initial application process. However, originals will be required during document verification.",
    "If you missed the AVCOE admission deadline, you may still be able to apply for the management quota or wait for further notification from the admission office.",
    "For lateral entry into B.Tech at AVCOE, you must have a diploma in the relevant field. You can apply for the second year of the B.Tech program after meeting the eligibility criteria.",
    "To apply for an open seat in AVCOE, you need to participate in the CAP process or apply directly through the management quota if available.",
    "Yes, AVCOE provides seat reservations for specific categories, such as SC, ST, OBC, and other reserved categories according to government policies.",
    "You can apply for AVCOE engineering admission from outside Maharashtra, but you need to meet the eligibility requirements and provide the necessary documents.",
    "You cannot apply for admission to AVCOE without a valid MHT-CET or JEE Main score. These exams are essential for the admission process.",
    "The admission process typically takes a few weeks, depending on the exam and counseling schedule. AVCOE will announce important dates on the official website.",
    "You cannot change your course selection once the application is submitted. However, you may apply for a different course if seats are available.",
    "If you want hostel facilities during the AVCOE admission process, you can apply for the same on the official website or during the counseling stage.",
    "You need to pay the required admission fee during the process to confirm your seat. The fee can be paid through online modes like net banking, credit/debit cards, or UPI.",
    "AVCOE offers merit-based scholarships, and students can apply for them through the admission process. The scholarship details are available on the official website.",
    "Documents for submission include your HSC mark sheet, entrance exam scorecard, caste certificate (if applicable), and other required forms as mentioned in the admission guidelines.",
    "You can track your AVCOE admission status through the application portal. You will receive updates on your admission status via email or SMS."
  ],
  
  "intent": "college_foundation",
  "examples": [
    "Who founded AVCOE?",
    "Who is the founder of Amrutvahini College of Engineering?",
    "Tell me about the founder of AVCOE.",
    "Who established Amrutvahini College of Engineering?",
    "When was AVCOE established?",
    "Where is AVCOE located?",
    "What is the history behind Amrutvahini College of Engineering?",
    "Where did AVCOE originate from?",
    "Who is the visionary behind AVCOE?",
    "What is the establishment year of AVCOE?"
  ],
  "responses": [
    "Amrutvahini College of Engineering (AVCOE) was established in 1983 under the leadership of Hon. Late Bhausaheb Thorat, a philanthropist and visionary committed to providing quality education to rural students.",
    "The founder of Amrutvahini College of Engineering (AVCOE) is Hon. Late Bhausaheb Thorat, who established the institution to empower students in rural Maharashtra with advanced technical education.",
    "AVCOE was founded in 1983 by Hon. Late Bhausaheb Thorat, who envisioned a world-class institution that would serve the educational needs of students in rural areas.",
    "Hon. Late Bhausaheb Thorat was the founder of Amrutvahini College of Engineering (AVCOE). His vision was to bring high-quality engineering education to rural Maharashtra.",
    "Amrutvahini College of Engineering (AVCOE) was established in the year 1983, with a mission to offer quality education in engineering disciplines.",
    "Amrutvahini College of Engineering is located in **Sangamner**, Maharashtra. The college is well-connected to the surrounding regions and offers various programs in engineering.",
    "The history of Amrutvahini College of Engineering dates back to 1983, when it was founded by Hon. Late Bhausaheb Thorat, who aimed to provide affordable and quality education in rural areas.",
    "Amrutvahini College of Engineering originated in Sangamner, Maharashtra, and was founded by Hon. Late Bhausaheb Thorat to promote rural education in the field of engineering.",
    "Hon. Late Bhausaheb Thorat, the visionary behind AVCOE, established the college with the aim of offering top-notch education in engineering to rural students.",
    "AVCOE was established in 1983 with the goal of imparting technical knowledge to the students of rural Maharashtra, and it is widely recognized for its contribution to engineering education."
  ],
  
  "intent": "college_location",
  "examples": [
    "Where is AVCOE located?",
    "What is the location of Amrutvahini College of Engineering?",
    "Tell me about the location of AVCOE.",
    "In which city is AVCOE situated?",
    "Where can I find Amrutvahini College of Engineering?",
    "How do I reach AVCOE?",
    "What is the address of AVCOE?",
    "Where is AVCOE located in Maharashtra?",
    "Which area is Amrutvahini College of Engineering located in?",
    "Is AVCOE located in Sangamner?"
  ],
  "responses": [
    "Amrutvahini College of Engineering (AVCOE) is located in **Sangamner**, Maharashtra, India.",
    "AVCOE is situated in Sangamner, a city in the Ahmednagar district of Maharashtra, India.",
    "The college is located in the town of Sangamner, which is in the Ahmednagar district of Maharashtra, India.",
    "Amrutvahini College of Engineering is based in Sangamner, Maharashtra. It is easily accessible from major cities in the region.",
    "You can find Amrutvahini College of Engineering in Sangamner, a well-known town in the Ahmednagar district of Maharashtra.",
    "AVCOE is located in Sangamner, which lies in the Ahmednagar district, Maharashtra, approximately 170 kilometers from Pune.",
    "The address of Amrutvahini College of Engineering is located in Sangamner, Maharashtra, in the Ahmednagar district of India.",
    "Yes, Amrutvahini College of Engineering is situated in Sangamner, Maharashtra. It is a key educational institution in the region.",
    "Amrutvahini College of Engineering is located in Sangamner, which is in the central part of Maharashtra, known for its educational institutions.",
    "Sangamner is the location of Amrutvahini College of Engineering, situated in Ahmednagar district of Maharashtra."
  ],
  
  "intent": "college_images",
  "examples": [
    "Can I see images of AVCOE?",
    "Where can I find photos of Amrutvahini College of Engineering?",
    "Show me pictures of AVCOE.",
    "Are there any images of AVCOE available online?",
    "Where can I view images of Amrutvahini College of Engineering?",
    "Can you provide pictures of the college campus?",
    "Where can I find the gallery of AVCOE?",
    "Can you show me the photos of AVCOE campus and facilities?",
    "Do you have images of AVCOE's infrastructure?",
    "How can I see images of Amrutvahini College of Engineering?"
  ],
  "responses": [
    "You can view images of AVCOE on their official website at [www.avcoe.org](http://www.avcoe.org), which features a gallery section showcasing the campus and infrastructure.",
    "The gallery of AVCOE images can be found on the official website of the college. You can explore various sections of the campus and its facilities.",
    "Photos of Amrutvahini College of Engineering are available on the official website and social media pages like Facebook and Instagram. Visit the gallery section to explore.",
    "For images of AVCOE, you can check out the official website or the AVCOE campus tour video available online for a detailed view of the infrastructure.",
    "You can find photos and videos of the AVCOE campus on the college’s official website and social media platforms like Instagram, showcasing its facilities and environment.",
    "Images and other media related to AVCOE can be accessed through the official website’s gallery or through the college’s promotional materials.",
    "Check out the official AVCOE website or their social media profiles for a collection of images representing the college campus, classrooms, and more.",
    "Visit the gallery section of the official website of AVCOE, where you will find various images of the campus, student life, and college events.",
    "For a closer look at AVCOE, including images and visuals of the campus, visit their official website gallery or their Instagram account for real-time photos.",
    "You can explore the AVCOE campus through various images available on the official website, which highlights the academic and recreational facilities."
  ],
  
  "intent": "all_events_activities_at_avcoe",
  "examples": [
    "What events are held at AVCOE throughout the year?",
    "Tell me about the cultural and technical events at AVCOE.",
    "What are the major events in AVCOE like Medha and others?",
    "Can you tell me about the sports events at AVCOE?",
    "What academic events are hosted at AVCOE?",
    "Is there any technical fest at AVCOE?",
    "What types of workshops are held at AVCOE?",
    "What kind of fests and events are organized by AVCOE?",
    "Can students participate in the various events at AVCOE?",
    "How can I register for events at AVCOE?",
    "What is the annual cultural festival at AVCOE?",
    "Does AVCOE conduct sports competitions every year?",
    "What are the main events during the Medha fest?",
    "How do I participate in Medha, AVCOE’s cultural fest?",
    "Are there any annual technical events at AVCOE?",
    "What are the upcoming events at AVCOE?",
    "Tell me more about the technical workshop series at AVCOE.",
    "What competitions happen during Medha at AVCOE?",
    "What kind of sports competitions take place at AVCOE?",
    "What are the workshops hosted by AVCOE for engineering students?",
    "Is there an orientation program at AVCOE for new students?",
    "What are the dates for Medha, the cultural fest at AVCOE?",
    "Does AVCOE organize hackathons or coding competitions?",
    "What is TechnoVision at AVCOE?",
    "What are the cultural events at AVCOE?",
    "How do I apply for the workshops at AVCOE?",
    "Tell me about the fests and cultural celebrations at AVCOE.",
    "Is there an annual technical fest at AVCOE for engineering students?",
    "What are the annual events like the AVCOE sports fest?",
    "Can students from all branches participate in AVCOE’s events?",
    "What are the different types of events that take place at AVCOE?",
    "Are there events for research students at AVCOE?",
    "What are the benefits of attending events at AVCOE?",
    "How can I find more details about upcoming events at AVCOE?",
    "Are there any inter-college events at AVCOE?",
    "Does AVCOE have any workshops related to programming and coding?",
    "Is there an annual career guidance event at AVCOE?",
    "Tell me more about the student engagement in AVCOE events.",
    "What events are planned by the AVCOE student council?",
    "Does AVCOE have any international-level competitions?",
    "What’s the schedule for sports events at AVCOE?",
    "How can I register for the annual fest at AVCOE?",
    "What is the Medha event about in AVCOE?",
    "What events are part of the Medha cultural fest at AVCOE?",
    "Are there events at AVCOE for students interested in music?",
    "How does AVCOE promote innovation through events?",
    "Can I be a volunteer at AVCOE events?",
    "What is the purpose of Medha in AVCOE?",
    "How does Medha at AVCOE contribute to the cultural growth of students?",
    "Can faculty participate in AVCOE’s events?",
    "What are the performances during Medha at AVCOE?",
    "Is there a fashion show during Medha at AVCOE?",
    "What other technical events are hosted at AVCOE?",
    "Can I attend workshops at AVCOE as an outsider?",
    "What is the AVCOE sports fest about?",
    "Are there any leadership seminars at AVCOE?",
    "What is the role of the AVCOE student council in organizing events?",
    "What are the prizes and awards for events at AVCOE?",
    "How does AVCOE celebrate its annual events?",
    "What type of community events are hosted by AVCOE?",
    "What is the role of AVCOE in promoting cultural activities?",
    "Tell me about the conferences and seminars held at AVCOE.",
    "How can I contribute to AVCOE’s cultural events?",
    "What international conferences are hosted by AVCOE?",
    "Are there any debates or quiz competitions at AVCOE?",
    "What role do students play in organizing AVCOE events?",
    "How do AVCOE events help in student development?",
    "What is the significance of Medha for AVCOE students?",
    "What new events are planned for AVCOE’s upcoming cultural fest?",
    "How can I be a part of AVCOE’s organizing team for events?",
    "Does AVCOE offer any career workshops during events?",
    "What is the event registration process at AVCOE?",
    "Are there any leadership training workshops in AVCOE?",
    "Is there an innovation contest during Medha at AVCOE?",
    "What can students learn by attending AVCOE’s events?",
    "What role does the alumni play in AVCOE’s events?",
    "Are there any conferences on technology hosted by AVCOE?",
    "What is the process for participating in AVCOE’s sports competitions?",
    "How are cultural activities supported at AVCOE?",
    "Are there any robotics competitions at AVCOE?",
    "How can I organize an event at AVCOE?",
    "What is the TechnoVision fest at AVCOE about?",
    "Tell me about the hackathons at AVCOE.",
    "Are there any music competitions during Medha at AVCOE?",
    "What is the role of faculty in AVCOE’s cultural and technical events?",
    "How does AVCOE support the arts through events?",
    "Can I present my research in AVCOE’s events?",
    "What networking events are organized by AVCOE?"
  ],
  "responses": [
    "AVCOE hosts a variety of events including cultural fests like Medha, technical fests like TechnoVision, sports events, academic workshops, hackathons, leadership seminars, and innovation contests. These events happen throughout the academic year.",
    "AVCOE organizes several events including Medha, the cultural fest, TechnoVision for technical innovation, sports competitions, career guidance workshops, and inter-college events to help students showcase their skills and talents.",
    "Medha is the annual cultural fest of AVCOE. It includes activities like singing, dancing, drama, fashion shows, and other cultural performances. It's an excellent platform for students to showcase their creativity.",
    "The sports events at AVCOE include athletic competitions, indoor games, outdoor sports like cricket, football, and volleyball. These events promote physical fitness and team spirit among students.",
    "AVCOE hosts academic events such as seminars, conferences, research exhibitions, and workshops. These events focus on innovation, new technologies, and developments in various fields of engineering.",
    "AVCOE organizes technical fests like TechnoVision, which feature programming competitions, workshops on new technologies, coding challenges, and networking events for students to enhance their technical skills.",
    "Yes, AVCOE hosts workshops on various technical topics, ranging from coding and programming to emerging technologies like Artificial Intelligence, IoT, and blockchain.",
    "AVCOE organizes various fests like Medha for cultural activities, TechnoVision for technical events, and sports competitions. These events allow students to explore diverse fields and showcase their talents.",
    "Yes, students can participate in various events at AVCOE. There are multiple categories of events, including cultural, technical, sports, and academic events, where students can sign up to showcase their skills.",
    "To register for events at AVCOE, students need to follow the registration procedure provided on the official website or event-specific pages, where they can choose the events they want to participate in.",
    "Medha is the grand annual cultural festival at AVCOE. The event features cultural activities like music, dance, drama, and various competitions like singing and acting, giving students a platform to express their creativity.",
    "Yes, sports events at AVCOE are organized annually, including both indoor and outdoor games. The events promote physical fitness and sportsmanship among students.",
    "TechnoVision at AVCOE is a technical festival that brings together engineering students to showcase their technical innovations, take part in competitions, and attend workshops that focus on technology and innovation.",
    "Yes, Medha is an annual event, and it typically includes several rounds of competitions in cultural activities like group dances, drama, singing, and other creative performances.",
    "AVCOE hosts academic workshops throughout the year. These include technical workshops, soft skills training, personality development seminars, and specialized sessions on topics like machine learning and AI.",
    "Yes, students can perform in Medha at AVCOE. The event includes various competitions, and students can showcase their talents in music, dance, drama, and many other forms of art.",
    "Medha includes events like group dances, solo performances, art exhibitions, and even competitions in poetry and literature. It is a great opportunity for students to express their creativity.",
    "Students can register for Medha through the cultural committee of AVCOE. The registration details are usually available on the official website or through the student council announcements.",
    "The TechnoVision fest at AVCOE includes events such as coding competitions, tech talks, workshops on emerging technologies, robotics competitions, and networking opportunities with professionals from the industry.",
    "Students can participate in a variety of events at Medha, ranging from singing and dancing to acting and painting. The cultural committee organizes the registration process for each event.",
    "Medha includes not only cultural performances but also technical competitions and workshops, making it a diverse and inclusive fest at AVCOE.",
    "Yes, students can attend workshops at AVCOE as outsiders if they register in advance and follow the guidelines provided by the event organizers.",
    "AVCOE’s sports fest includes athletic competitions, cricket, football, volleyball, and other games. It's held every year and encourages teamwork and sportsmanship among students.",
    "AVCOE organizes leadership seminars, which are aimed at helping students develop leadership qualities and enhance their professional skills.",
    "Yes, the student council plays a key role in organizing events, including Medha, TechnoVision, and sports events. They coordinate with various departments and oversee the execution of the events."
  ],
  
  
  "intent": "admission_process_avcoe",
  "examples": [
    "How can I apply for admission at AVCOE?",
    "What are the admission requirements for B.Tech at AVCOE?",
    "What is the admission process for undergraduate programs at AVCOE?",
    "Are there any entrance exams for admission to AVCOE?",
    "How can I get a seat in B.Tech at AVCOE?",
    "Can I apply for direct admission to AVCOE?",
    "What are the eligibility criteria for postgraduate programs at AVCOE?",
    "How much is the admission fee for B.Tech at AVCOE?",
    "What documents are required for admission to AVCOE?",
    "Can I apply for admission to AVCOE if I have completed my 12th grade?",
    "What is the minimum percentage required to get into AVCOE?",
    "Is there any reservation for SC/ST candidates in AVCOE?",
    "What is the procedure to get admission to AVCOE?",
    "Do I need to clear JEE to get into AVCOE?",
    "Can I apply for a lateral entry admission at AVCOE?",
    "How can I check the status of my application at AVCOE?",
    "What is the last date to apply for B.Tech at AVCOE?",
    "Is there any scholarship program for students at AVCOE?",
    "What is the counseling process for admission to AVCOE?",
    "What is the cut-off for admission to AVCOE?",
    "Can I apply for both the B.Tech and M.Tech programs at AVCOE simultaneously?",
    "How do I pay the admission fees for AVCOE?",
    "Is there a common entrance exam for AVCOE and other colleges?",
    "What is the selection process for admission to AVCOE?",
    "How can I check the merit list for AVCOE admission?",
    "Can international students apply for admission to AVCOE?",
    "Do I need to appear for an interview to get admission to AVCOE?",
    "What is the procedure for admission to postgraduate programs at AVCOE?",
    "What is the eligibility for admission to the M.Tech program at AVCOE?",
    "Can I get a seat in AVCOE through JEE Main marks?",
    "What is the application fee for AVCOE admission?",
    "How long does the admission process take at AVCOE?",
    "Is there an online application process for admission at AVCOE?",
    "What is the minimum score required in JEE for admission to AVCOE?",
    "Does AVCOE offer management quota for admission?",
    "What is the fee structure for B.Tech at AVCOE?",
    "How is the selection done for M.Tech courses at AVCOE?",
    "Can I apply for a hostel along with my admission to AVCOE?",
    "What is the admission process for diploma courses at AVCOE?",
    "What is the cutoff for SC/ST candidates at AVCOE?",
    "How is the merit list prepared for AVCOE admissions?",
    "Can I apply for an NRI seat at AVCOE?",
    "What is the procedure for applying for a scholarship at AVCOE?",
    "Do I need to submit a hard copy of my application to AVCOE?",
    "How can I update my details after submitting the admission form?",
    "When does the admission process for AVCOE start?",
    "Are there any eligibility requirements for international students at AVCOE?",
    "What is the procedure for admission in the M.Tech program at AVCOE?",
    "Is there any management quota available for B.Tech admissions at AVCOE?",
    "How is the counseling process carried out for AVCOE admissions?",
    "Do I need to appear for any other entrance exams apart from JEE for AVCOE?",
    "What is the status of my AVCOE admission application?",
    "Can I change my branch after admission at AVCOE?",
    "What are the steps to complete the admission process at AVCOE?",
    "Is the admission process at AVCOE fully online?",
    "What is the procedure for a student to apply for a hostel at AVCOE?",
    "How can I find out about the merit list for AVCOE admissions?",
    "Is the AVCOE application process paper-based or digital?",
    "Can I apply for a seat in AVCOE’s management quota if I missed the entrance exam?",
    "What documents should I submit for admission to AVCOE?",
    "How is the counseling for postgraduate programs conducted at AVCOE?",
    "Can I apply for both B.Tech and M.Tech at the same time at AVCOE?",
    "Is there a separate application for hostel admission at AVCOE?",
    "What is the reservation policy for admissions at AVCOE?",
    "Is there any age limit for admission to AVCOE?",
    "Does AVCOE have an entrance exam for M.Tech admissions?",
    "Can I check my admission status online at AVCOE?",
    "What is the process of applying for lateral entry admission at AVCOE?",
    "What is the minimum eligibility criteria for lateral entry to AVCOE?",
    "How many rounds of counseling are there for AVCOE admissions?",
    "Do I need to pay any fees for counseling at AVCOE?",
    "Can I submit my application form offline for AVCOE?",
    "What is the cut-off percentage for AVCOE admissions?",
    "How do I register for the AVCOE entrance exam?",
    "When does the admission process for AVCOE end?"
  ],
  "responses": [
    "The admission process for AVCOE requires candidates to apply through the official website. You must submit the necessary documents and attend counseling based on your entrance exam results like JEE or any other applicable tests.",
    "For B.Tech at AVCOE, the eligibility criteria include completing 12th grade with a minimum percentage in subjects like Physics, Chemistry, and Mathematics. Additionally, you need to qualify for JEE or the respective entrance exam.",
    "The admission process for undergraduate programs like B.Tech at AVCOE is based on the marks obtained in JEE and your academic qualifications. You will also need to attend counseling for seat allocation.",
    "Yes, there is an entrance exam required for admission to AVCOE, and candidates typically need to qualify through JEE Main or other specified exams.",
    "To get a seat in B.Tech at AVCOE, you need to clear the JEE Main exam and meet the eligibility criteria specified by the college. After that, you can proceed with the counseling process.",
    "AVCOE does not offer direct admission. All admissions are subject to the eligibility criteria and entrance exam results.",
    "Postgraduate programs like M.Tech require candidates to have a B.Tech degree with relevant specialization and a valid score in GATE or other equivalent exams.",
    "The admission fee varies based on the course and category. It’s advisable to check the official AVCOE website for the latest fee structure.",
    "Documents required include your 12th-grade mark sheet, identity proof, entrance exam scorecard (JEE/GATE), and other academic certificates.",
    "Yes, you can apply for admission to AVCOE after completing your 12th grade, provided you meet the eligibility criteria.",
    "The minimum percentage required for admission depends on the course and entrance exam scores. For most B.Tech programs, it’s around 50% in 12th grade with the required entrance score.",
    "Yes, AVCOE provides reservation for SC/ST candidates according to the government’s reservation policy.",
    "The admission procedure for AVCOE involves filling out the online application form, attending the entrance exam, and then attending the counseling process for seat allocation.",
    "Yes, JEE Main scores are essential for admission to AVCOE for B.Tech programs.",
    "Yes, AVCOE offers lateral entry admissions to the second year of B.Tech for diploma holders.",
    "You can check your application status by visiting the AVCOE official website or through the admission portal.",
    "The last date to apply for B.Tech admissions is typically in June, but you should check the official website for specific deadlines.",
    "AVCOE offers several scholarships based on merit, financial needs, and other criteria. You can apply for scholarships as part of the admission process.",
    "The counseling process involves seat allocation based on your rank in the entrance exam and availability of seats in the desired course.",
    "The cut-off for admission to AVCOE depends on the entrance exam scores and the number of applicants. It’s usually announced on the official website.",
    "No, you can only apply for one program at a time. However, you can apply for both B.Tech and M.Tech in different sessions if you meet the eligibility criteria.",
    "Admission fees can be paid online through various payment methods like credit cards, debit cards, or bank transfer.",
    "AVCOE admission does not have a common entrance exam. However, candidates must clear the JEE or other entrance exams as specified by the college.",
    "The selection process involves applying online, qualifying the entrance exams, attending counseling, and submitting required documents for verification.",
    "You can check the merit list for AVCOE admissions by visiting the official website. It is usually published after the entrance exams and counseling.",
    "Yes, international students can apply for admission to AVCOE if they meet the necessary academic qualifications and visa requirements.",
    "An interview is not mandatory for B.Tech admissions, but some postgraduate programs may require an interview depending on the course."
	],
	
	"intent": "faculty_staff_avcoe",
  "examples": [
    "Who are the faculty members in the Computer Science department at AVCOE?",
    "How can I contact the faculty at AVCOE?",
    "What is the qualification of the faculty in the Electrical Engineering department?",
    "Can I meet the faculty at AVCOE for academic guidance?",
    "Who is the head of the Computer Science department at AVCOE?",
    "What is the faculty-to-student ratio at AVCOE?",
    "Are the faculty members at AVCOE experienced in their respective fields?",
    "How many faculty members are there in the Mechanical Engineering department at AVCOE?",
    "Can I get information about the faculty in the IT department at AVCOE?",
    "What qualifications do the professors at AVCOE hold?",
    "Is there any research staff at AVCOE?",
    "Can I find the details of faculty members on the AVCOE website?",
    "Who is the dean of academics at AVCOE?",
    "How do I get in touch with the faculty members of AVCOE?",
    "What are the academic qualifications of the faculty in the Civil Engineering department?",
    "Are there any guest faculty members at AVCOE?",
    "Does AVCOE have a faculty development program?",
    "How many years of experience do the faculty members have at AVCOE?",
    "Can I attend workshops conducted by the faculty at AVCOE?",
    "What research areas do the faculty at AVCOE focus on?",
    "Who are the visiting faculty members at AVCOE?",
    "Is there a faculty evaluation process at AVCOE?",
    "Can I approach faculty members for academic support at AVCOE?",
    "Does AVCOE offer faculty training and development programs?",
    "How is the faculty involvement in student activities at AVCOE?",
    "What are the qualifications of the staff in the administration department at AVCOE?",
    "How does the faculty contribute to the curriculum at AVCOE?",
    "Is there a dedicated faculty for career guidance at AVCOE?",
    "How does AVCOE support its faculty members in terms of research funding?",
    "Can I get a list of faculty members in all departments at AVCOE?",
    "Does AVCOE have any faculty members with international experience?",
    "Who is the HOD of the Civil Engineering department at AVCOE?",
    "Are faculty members at AVCOE actively involved in industry collaborations?",
    "What is the student feedback on faculty at AVCOE?",
    "Can faculty members at AVCOE supervise student projects?",
    "How do I reach out to a specific faculty member at AVCOE?",
    "What research facilities are available for faculty at AVCOE?",
    "Are there any online courses offered by faculty at AVCOE?",
    "Can I find the faculty members' profiles on the AVCOE website?",
    "Does AVCOE have any faculty members who are PhD holders?",
    "Can I get in touch with the faculty for mentorship at AVCOE?",
    "What kind of academic support do faculty members provide at AVCOE?",
    "Do the faculty at AVCOE organize seminars and conferences?",
    "How are faculty members evaluated at AVCOE?",
    "What is the student-faculty interaction like at AVCOE?",
    "How does AVCOE encourage faculty research and innovation?",
    "What are the main areas of expertise among the faculty at AVCOE?",
    "How do faculty members at AVCOE engage with students outside of class?",
    "Are faculty members at AVCOE involved in curriculum design?",
    "Can I contact a faculty member at AVCOE via email?",
    "How does AVCOE support faculty members in achieving professional development?",
    "Are there faculty members with expertise in emerging technologies at AVCOE?",
    "How does AVCOE support faculty research in AI and machine learning?",
    "Are there faculty members at AVCOE who work in the field of robotics?",
    "Does AVCOE have faculty members who work on sustainable engineering projects?",
    "Who can I approach for academic advice at AVCOE?",
    "How is faculty involvement in student internships at AVCOE?",
    "Does AVCOE have any full-time faculty members for each department?",
    "What is the teaching methodology used by faculty members at AVCOE?",
    "Do faculty members at AVCOE participate in professional development programs?",
    "What is the workload like for faculty members at AVCOE?",
    "How does AVCOE select faculty for each department?",
    "Are there any faculty members who are involved in social outreach programs at AVCOE?"
  ],
  "responses": [
    "AVCOE has a qualified team of faculty members in each department, including Computer Science, Electrical Engineering, Civil Engineering, and more. For specific details, you can visit the faculty section of the official website.",
    "You can contact faculty members by visiting their profiles on the AVCOE website, where their contact information and office hours are provided.",
    "The faculty in the Electrical Engineering department at AVCOE hold advanced degrees such as M.Tech and Ph.D. and are highly experienced in their respective fields.",
    "Yes, you can approach faculty members at AVCOE for academic guidance. They are available during office hours, and many are also involved in mentoring students.",
    "The head of the Computer Science department at AVCOE is Dr. [Name]. You can contact them through the department's contact information on the official website.",
    "AVCOE maintains an excellent faculty-to-student ratio to ensure that students get the best academic experience. The exact ratio can be found on the college website.",
    "Yes, the faculty members at AVCOE are highly experienced, with many having years of experience in teaching and research.",
    "The Mechanical Engineering department at AVCOE has over 20 faculty members who are experts in their respective fields of mechanics, thermodynamics, and material science.",
    "Yes, you can get detailed information about the faculty in the IT department, including their qualifications and areas of expertise, on the AVCOE website.",
    "Faculty members at AVCOE hold various academic qualifications, including B.Tech, M.Tech, and Ph.D., and many have experience in the industry as well.",
    "AVCOE has a research staff that supports faculty and students in research initiatives, especially in areas like artificial intelligence, robotics, and civil engineering.",
    "Yes, faculty members' details, including their qualifications, research areas, and contact information, are available on the official AVCOE website.",
    "The dean of academics at AVCOE is [Name]. You can contact them for any academic-related queries or concerns.",
    "To get in touch with faculty members at AVCOE, visit the college website, where you will find the faculty directory with their contact details.",
    "Faculty in the Civil Engineering department at AVCOE hold M.Tech and Ph.D. degrees and are experts in areas like structural engineering and construction management.",
    "Yes, AVCOE invites guest faculty from various industries and academia to provide students with additional knowledge and insights into emerging fields.",
    "Yes, AVCOE offers a faculty development program to help faculty members improve their teaching and research skills through workshops, training sessions, and seminars.",
    "AVCOE faculty members have an average of 10-20 years of experience in their respective fields, and many have worked in both academia and industry.",
    "Yes, you can attend workshops conducted by faculty at AVCOE. These workshops cover a wide range of topics like research methods, programming, and entrepreneurship.",
    "Faculty at AVCOE are involved in a wide range of research areas, including artificial intelligence, robotics, renewable energy, and more.",
    "AVCOE has several visiting faculty members who bring in specialized knowledge and real-world industry experience.",
    "Yes, AVCOE has a faculty evaluation process where students provide feedback on teaching methods, course content, and overall performance.",
    "Yes, faculty members at AVCOE are always open to providing academic support, whether it's through office hours, mentoring, or research guidance.",
    "Yes, AVCOE offers various faculty training programs to ensure that all faculty members are up-to-date with the latest teaching methodologies and research developments.",
    "Faculty members at AVCOE are highly involved in student activities, both academic and extracurricular. They mentor students for various competitions and projects.",
    "The staff in the administration department of AVCOE is well-qualified, with most members having educational backgrounds in management and administration.",
    "Faculty at AVCOE contribute significantly to the curriculum, often updating it to reflect the latest developments in their respective fields.",
    "Yes, AVCOE has a dedicated career guidance faculty who helps students with career counseling, internship placements, and job opportunities.",
    "AVCOE supports faculty research by providing funding, research facilities, and collaboration opportunities with industry leaders and other academic institutions.",
    "You can find a list of all faculty members across departments in the faculty section on the official AVCOE website.",
    "Yes, many faculty members at AVCOE have international experience, having worked or collaborated with academic institutions and industries worldwide.",
    "The HOD of the Civil Engineering department at AVCOE is [Name]. You can contact them for queries related to the department.",
    "Yes, faculty at AVCOE are actively involved in industry collaborations, working on real-world projects and consulting with various companies.",
    "Student feedback on faculty at AVCOE is collected regularly to ensure that the faculty maintains high teaching standards and addresses student needs.",
    "Yes, faculty members at AVCOE supervise student projects and guide them through academic research, design, and development processes.",
    "You can reach out to a specific faculty member at AVCOE via their official email ID, which is listed on their profile on the college website.",
    "AVCOE provides well-equipped research facilities for faculty, especially for projects related to AI, IoT, and renewable energy.",
    "Yes, some faculty members at AVCOE offer online courses and tutorials for students to enhance their knowledge outside regular classes.",
    "Faculty profiles, including their qualifications, research interests, and contact details, are available on the official AVCOE website.",
    "Yes, many faculty members at AVCOE hold Ph.D. degrees in their specialized fields, contributing to the research and academic excellence of the college.",
    "You can get in touch with faculty for mentorship by scheduling meetings through the college's academic support system or contacting them directly.",
    "Faculty at AVCOE provide extensive academic support, including one-on-one guidance, tutoring, and mentoring to ensure students succeed in their studies.",
    "Yes, faculty at AVCOE frequently organize seminars and conferences to promote knowledge sharing and academic growth within and outside the institution.",
    "Faculty members at AVCOE are evaluated through student feedback, peer reviews, and administrative assessments to maintain teaching quality."
	],
	
	 "intent": "hostel_facilities_avcoe",
  "examples": [
    "What are the hostel facilities available at AVCOE?",
    "Is there a hostel for girls at AVCOE?",
    "How can I apply for a hostel at AVCOE?",
    "What is the hostel fee structure at AVCOE?",
    "Can I get a single room in the AVCOE hostel?",
    "What are the amenities provided in the AVCOE hostel?",
    "Are the hostels at AVCOE well-maintained?",
    "Is there a hostel for boys at AVCOE?",
    "How far are the hostels from the AVCOE campus?",
    "What is the food quality like in AVCOE hostels?",
    "Can I choose my roommate in the AVCOE hostel?",
    "Are there any restrictions in the AVCOE hostels?",
    "Can I stay in the hostel during vacations at AVCOE?",
    "Is there a separate hostel for first-year students at AVCOE?",
    "Do the AVCOE hostels provide Wi-Fi?",
    "Are the hostel rooms at AVCOE furnished?",
    "How do I book a hostel room at AVCOE?",
    "What is the check-in/check-out process for AVCOE hostels?",
    "Are there common areas in the AVCOE hostel?",
    "Do AVCOE hostels have 24/7 security?",
    "What is the room allocation procedure for hostels at AVCOE?",
    "Are there laundry services available in AVCOE hostels?",
    "Are the hostels at AVCOE gender-segregated?",
    "How do I cancel my hostel booking at AVCOE?",
    "Is there a medical facility in the AVCOE hostel?",
    "What is the policy on guest visits in the AVCOE hostels?",
    "Do AVCOE hostels offer transportation facilities to campus?",
    "Can I cook my own food in the AVCOE hostel?",
    "How many hostels are there at AVCOE?",
    "What is the hostel’s fee payment policy at AVCOE?",
    "Are there any recreational facilities in the AVCOE hostels?",
    "Is there a curfew in the AVCOE hostel?",
    "Do AVCOE hostels have air conditioning?",
    "Can I extend my stay in the AVCOE hostel beyond the academic year?",
    "What is the process for hostel room allotment at AVCOE?",
    "Do AVCOE hostels have study rooms or quiet zones?",
    "Are the hostels at AVCOE equipped with CCTV surveillance?",
    "How is the hostel management at AVCOE?",
    "Is there a hostel for international students at AVCOE?",
    "What is the capacity of each hostel at AVCOE?",
    "How do I request a room change in the AVCOE hostel?",
    "Are there facilities for differently-abled students in AVCOE hostels?",
    "Is there a provision for online hostel room booking at AVCOE?",
    "What is the dress code in AVCOE hostels?",
    "Can I have a pet in the AVCOE hostel?",
    "How is the hostel atmosphere at AVCOE?",
    "Do AVCOE hostels provide bed sheets and pillows?",
    "Is there a mess in AVCOE hostels?",
    "Can I avail of a refund if I cancel my hostel booking at AVCOE?",
    "What documents are required to apply for a hostel at AVCOE?",
    "Can I book a hostel room for a short stay at AVCOE?",
    "What are the visiting hours for the AVCOE hostel?",
    "Do AVCOE hostels have elevators?",
    "Is there a student body for hostel management at AVCOE?",
    "What safety measures are in place in AVCOE hostels?",
    "Are there any additional charges for using facilities in AVCOE hostels?",
    "Can I bring my own furniture to the AVCOE hostel?",
    "Do AVCOE hostels have facilities for sports and fitness?",
    "What types of rooms are available in AVCOE hostels?",
    "Are there any restrictions on visitors at AVCOE hostels?",
    "How do I know if a hostel room is available at AVCOE?"
  ],
  "responses": [
    "AVCOE provides well-maintained hostel facilities for both boys and girls, with all necessary amenities such as Wi-Fi, furnished rooms, and a mess. You can find more details on the official website.",
    "Yes, AVCOE has a separate hostel for girls, ensuring their safety and comfort with all essential facilities.",
    "To apply for a hostel at AVCOE, you need to submit a hostel application form available on the AVCOE website. The application process is usually conducted at the start of each academic year.",
    "The fee structure for hostels at AVCOE varies depending on the type of room and the amenities offered. You can get detailed information from the hostel office or the AVCOE website.",
    "Hostel room availability and allocation depend on the number of students applying. However, single rooms may be available based on specific criteria and availability.",
    "AVCOE hostels provide essential amenities such as Wi-Fi, laundry facilities, a mess, and recreation rooms. The rooms are also furnished with basic furniture.",
    "Yes, the hostels at AVCOE are well-maintained and regularly cleaned to ensure a comfortable stay for all students.",
    "Yes, AVCOE has a hostel for boys as well, with all the necessary facilities to ensure their well-being during their stay.",
    "The hostels are located near the campus, making it easy for students to commute to and from the college.",
    "The food quality in AVCOE hostels is generally good, with a variety of meals provided. The mess follows hygiene standards to ensure a healthy diet for students.",
    "Roommate preferences are generally considered during the room allocation process, but it is subject to availability and policy.",
    "Yes, there are certain rules and restrictions in the hostels, such as visiting hours, curfew times, and guidelines for behavior.",
    "Yes, students can stay in the hostel during vacations, but prior approval from the hostel management is required.",
    "There isn't a separate hostel for first-year students, but room allocation is done based on availability and need.",
    "Yes, AVCOE hostels provide Wi-Fi services to help students stay connected and access study materials online.",
    "Yes, the rooms in AVCOE hostels are fully furnished with essentials like a bed, table, chair, and cupboard.",
    "You can book a hostel room by completing the hostel booking process through the AVCOE website or by contacting the hostel office directly.",
    "The check-in/check-out process for hostels at AVCOE involves submitting a hostel application, receiving room allocation, and confirming the room details before moving in.",
    "Yes, there are common areas in the AVCOE hostels where students can socialize, study, and relax.",
    "Yes, AVCOE hostels have 24/7 security to ensure the safety and well-being of the students staying there.",
    "The room allocation procedure is based on availability, and priority is given based on the date of application and specific requirements.",
    "Yes, laundry services are available in the hostels to make it easier for students to maintain their clothing and personal items.",
    "Yes, the hostels at AVCOE are gender-segregated, with separate facilities for boys and girls.",
    "To cancel your hostel booking at AVCOE, you need to inform the hostel office in advance and follow the cancellation process.",
    "There is a medical facility available at AVCOE hostel for emergencies, and students can visit the medical center during regular hours.",
    "Guests are allowed in the hostels only during specific visiting hours. Detailed rules regarding guest visits can be found in the hostel guidelines.",
    "Yes, AVCOE hostels provide transportation facilities to help students commute to the campus, especially during peak hours.",
    "Students are not allowed to cook in the hostels, but the mess provides daily meals that cater to a variety of preferences.",
    "There are multiple hostels at AVCOE, with separate accommodations for boys and girls, each equipped with the necessary amenities.",
    "The hostel fee payment policy at AVCOE requires students to pay fees in advance, with options for online payments and installments.",
    "Yes, there are recreational facilities such as a common room with TV, sports facilities, and a space for student activities in the hostels.",
    "Yes, there is a curfew in the AVCOE hostels, which is usually in place to ensure student safety and discipline.",
    "No, AVCOE hostels do not have air conditioning. However, fans and proper ventilation are provided to ensure a comfortable stay.",
    "Yes, you can extend your stay in the AVCOE hostel by requesting an extension before the end of the academic year.",
    "Room allotment is based on availability, and you can apply for a room during the hostel registration process, which is held at the beginning of each semester.",
    "Yes, there are study rooms and quiet zones in AVCOE hostels to help students focus on their studies.",
    "Yes, AVCOE hostels are equipped with CCTV surveillance to ensure the safety of students and their belongings.",
    "The hostel management at AVCOE is efficient, with dedicated staff ensuring the smooth functioning of hostel operations and addressing student concerns.",
    "Yes, there is a separate hostel available for international students at AVCOE, ensuring their specific needs and preferences are met.",
    "The capacity of each hostel at AVCOE varies. However, each hostel is designed to accommodate a significant number of students comfortably.",
    "To request a room change in the AVCOE hostel, you need to approach the hostel warden or management and provide a valid reason for the change.",
    "Yes, there are facilities for differently-abled students in AVCOE hostels, ensuring they have an accessible and comfortable living space.",
    "Yes, you can book a hostel room online through the AVCOE portal. The process is simple and requires basic details.",
    "The dress code in the AVCOE hostels is casual but should adhere to basic standards of modesty and appropriateness.",
    "No, pets are not allowed in the AVCOE hostels due to health and safety regulations.",
    "The hostel atmosphere at AVCOE is friendly and cooperative, with a focus on student well-being and academic success.",
    "Yes, AVCOE hostels provide bed sheets, pillows, and other basic bedding essentials to make your stay more comfortable.",
    "Yes, there is a mess in the AVCOE hostels that provides regular meals for students.",
    "If you cancel your hostel booking, you may be eligible for a refund depending on the terms and conditions outlined in the hostel policy.",
    "The documents required for applying for a hostel at AVCOE typically include your admission letter, ID proof, and a filled-out hostel application form.",
    "AVCOE hostels primarily cater to students for long-term stays. Short stays may be available under special circumstances, but you need to inquire with the hostel office.",
    "Visiting hours for AVCOE hostels are usually set in the hostel rules. Specific hours may vary based on the department or hostel policy.",
    "Yes, AVCOE hostels are equipped with elevators for easy access to upper floors, especially for students with mobility challenges.",
    "Yes, AVCOE hostels have a student body that manages various aspects of hostel life, including organizing events and resolving issues.",
    "AVCOE hostels implement strict safety measures, including round-the-clock security, CCTV surveillance, and emergency protocols.",
    "Most facilities in AVCOE hostels are included in the fee, but additional charges may apply for services like laundry and extra food items.",
    "No, students are not allowed to bring their own furniture into the AVCOE hostel. The rooms are furnished with standard furniture provided by the hostel.",
    "Yes, AVCOE hostels offer basic fitness facilities such as a gym or outdoor sports areas to promote physical well-being.",
    "AVCOE hostels offer various types of rooms, including single, double, and shared accommodations, based on student preferences and availability.",
    "There are restrictions on visitors at AVCOE hostels, including designated visiting hours and rules for bringing guests into the hostels.",
    "To check if a hostel room is available, you can contact the hostel management or check the AVCOE portal for real-time updates on room availability."
  ],
  
  
  "intent": "placements_and_career_opportunities",
  "examples": [
    "What are the placement opportunities at AVCOE?",
    "How is the placement record at AVCOE?",
    "Which companies visit AVCOE for campus recruitment?",
    "What is the highest salary offered during AVCOE placements?",
    "What is the average salary offered in placements at AVCOE?",
    "How can I apply for internships through AVCOE's placement cell?",
    "What kind of career support does AVCOE provide?",
    "Are there placement training programs available at AVCOE?",
    "How does AVCOE help students prepare for interviews?",
    "Is there an alumni network for career guidance at AVCOE?",
    "What is the placement percentage at AVCOE for engineering students?",
    "Does AVCOE have tie-ups with any major tech companies for recruitment?",
    "Can students from non-technical branches get placed through AVCOE's placement cell?",
    "Does AVCOE provide assistance with resume building?",
    "Are there any workshops or training sessions for placement preparation at AVCOE?",
    "How do I register for campus placements at AVCOE?",
    "Does AVCOE have an on-campus recruitment drive?",
    "What is the placement procedure at AVCOE?",
    "Are there international placement opportunities through AVCOE?",
    "How can I improve my chances of getting placed through AVCOE?",
    "Does AVCOE have a career counseling service?",
    "What industries hire AVCOE graduates?",
    "Is there a pre-placement offer (PPO) system at AVCOE?",
    "Does AVCOE provide guidance for startup opportunities?",
    "Are there any industry-specific placement drives at AVCOE?",
    "What is the process for getting a job through AVCOE placements?",
    "How does AVCOE collaborate with top companies for placements?",
    "What percentage of AVCOE students get placed in core engineering roles?",
    "Does AVCOE organize job fairs for its students?",
    "What are the job roles offered during AVCOE placements?",
    "How can I prepare for the placement test at AVCOE?",
    "Does AVCOE provide training for coding interviews?",
    "How competitive is the placement process at AVCOE?",
    "What is the role of the Training and Placement Cell at AVCOE?",
    "Can I get a job in software development through AVCOE placements?",
    "How do I know if I'm eligible for placement at AVCOE?",
    "Are there any industry collaborations for research and development at AVCOE?",
    "Is there a placement fee at AVCOE?",
    "Can I be placed in a company abroad through AVCOE's placement services?",
    "What is the process for internship placements at AVCOE?",
    "Does AVCOE have partnerships with companies in the IT sector?",
    "What is the placement success rate at AVCOE for computer science students?",
    "Can I get a job at a multinational company through AVCOE placements?",
    "Are there any opportunities for entrepreneurship through AVCOE's placement cell?",
    "How early should I start preparing for placements at AVCOE?",
    "Are there any placements in the finance sector through AVCOE?",
    "What support does AVCOE provide for entrepreneurship and startups?",
    "Does AVCOE provide soft skills training for placement preparation?",
    "How can I increase my chances of getting placed through AVCOE?"
  ],
  "responses": [
    "AVCOE has a robust placement record, with numerous top companies visiting the campus each year for recruitment. The Training and Placement Cell works hard to connect students with the best career opportunities.",
    "The placement cell at AVCOE ensures that a significant percentage of students get placed, with many securing positions in reputed companies across different industries like IT, Engineering, and Finance.",
    "Top companies like TCS, Wipro, Infosys, Cognizant, and many others visit AVCOE for campus recruitment. Additionally, startups and other mid-size firms also offer placement opportunities.",
    "The highest salary offered during placements at AVCOE can vary each year but typically ranges from 6 to 10 lakhs per annum for high-demand roles.",
    "The average salary offered to AVCOE graduates during placements is generally around 3.5 to 4.5 lakhs per annum, depending on the course and role.",
    "AVCOE's placement cell offers various internship opportunities with industry partners and helps students apply for summer internships, industrial visits, and other practical experiences.",
    "AVCOE provides career support through counseling sessions, training programs, and exposure to industry practices. They also offer workshops and guidance on job applications, interviews, and career planning.",
    "Yes, AVCOE offers placement training sessions covering topics like resume writing, interview preparation, coding tests, group discussions, and soft skills development.",
    "The alumni network of AVCOE is highly active in providing career advice, networking opportunities, and mentorship to current students.",
    "AVCOE has achieved a high placement percentage, with over 90% of eligible students getting placed each year, especially in the engineering and technology sectors.",
    "Yes, AVCOE has tie-ups with some of the leading tech companies for recruitment, such as TCS, Infosys, and Accenture, which recruit AVCOE students regularly.",
    "AVCOE provides placement assistance not only to technical students but also to students from management, arts, and other fields. The placement cell works to connect them with relevant job opportunities.",
    "The placement cell at AVCOE assists students in building strong resumes, preparing for interviews, and gaining exposure to real-world challenges through mock interviews and skill assessments.",
    "Yes, there are multiple workshops held at AVCOE to help students prepare for placements. These workshops focus on coding, personality development, and interview techniques.",
    "Students can register for campus placements through the placement portal provided by AVCOE. The portal offers a convenient way to apply for job openings and internships.",
    "Yes, AVCOE organizes an on-campus recruitment drive where top companies visit the college to hire students for various positions.",
    "The placement process at AVCOE involves registration, pre-placement talks, written tests, technical interviews, HR interviews, and final selection for employment.",
    "AVCOE offers some international placement opportunities, particularly for high-performing students in partnership with global tech and consulting companies.",
    "Students can improve their chances of placement by focusing on their technical skills, enhancing their communication abilities, participating in mock interviews, and maintaining good academic performance.",
    "Yes, AVCOE provides career counseling sessions, where students can receive guidance on various career paths, job search strategies, and potential internships.",
    "AVCOE graduates are hired by industries in a variety of fields, including IT, manufacturing, finance, marketing, and more. Some students also pursue higher studies.",
    "Yes, there is a pre-placement offer (PPO) system at AVCOE. Students who perform exceptionally well during internships often receive job offers before their final year.",
    "AVCOE offers guidance to students interested in starting their own ventures or working in the startup ecosystem, through workshops, mentoring, and industry exposure.",
    "The placement cell at AVCOE works with several industries to organize placement drives targeting specific sectors such as software development, management, and engineering roles.",
    "The process for getting a job through AVCOE placements involves preparing for written tests, appearing in interviews, and clearing the selection process followed by the hiring companies.",
    "AVCOE collaborates with top companies like TCS, Cognizant, Infosys, and many others to ensure students have access to high-quality placements across diverse industries.",
    "AVCOE provides excellent placement opportunities in core engineering roles, with students from departments like Mechanical, Civil, and Electrical securing positions in leading companies.",
    "Yes, AVCOE organizes job fairs and campus placement drives regularly, connecting students with a large number of potential employers.",
    "During placements at AVCOE, students are offered job roles in various industries, including software development, data science, civil engineering, electrical systems, and more.",
    "AVCOE helps students prepare for placement tests by offering coaching sessions, practice tests, and guidance on key concepts required for various recruitment exams.",
    "AVCOE provides training and mock sessions for coding interviews, including preparation for technical rounds involving problem-solving and algorithm-based questions.",
    "The placement process at AVCOE is competitive, but the college offers comprehensive support and training to help students succeed and secure placements in their desired roles.",
    "The Training and Placement Cell at AVCOE is responsible for organizing placement drives, offering placement-related training, and liaising with top companies to ensure recruitment opportunities.",
    "Yes, students can be placed in software development roles during placements at AVCOE, with companies like TCS, Infosys, and Cognizant frequently hiring in this field.",
    "Students must fulfill specific eligibility criteria, including academic qualifications and skills, to participate in AVCOE's placement process.",
    "AVCOE collaborates with various industries and R&D sectors for placement opportunities, and some students are placed in R&D roles in tech companies.",
    "There are no specific placement fees at AVCOE; however, some companies may charge a fee for accessing their recruitment services during placement drives.",
    "Yes, AVCOE has tie-ups with some global companies that provide opportunities for students to be placed abroad, particularly in the IT and engineering sectors.",
    "The process for internship placements at AVCOE is similar to full-time placements, where companies visit the campus, conduct interviews, and select students based on their skills and qualifications.",
    "AVCOE has several partnerships with tech companies like Wipro, Infosys, and TCS, which regularly recruit AVCOE graduates for various IT roles.",
    "The placement success rate for computer science students at AVCOE is high, with many securing jobs in top-tier tech companies and startups.",
    "Yes, multinational companies like Google, Amazon, and Microsoft sometimes hire AVCOE students for software development, data analysis, and related roles.",
    "AVCOE encourages entrepreneurship by providing mentorship, incubation support, and funding opportunities for students interested in startups.",
    "To get ready for placements at AVCOE, students should start preparing as early as their second year by focusing on building technical and communication skills.",
    "AVCOE students have been successfully placed in the finance sector with companies like Barclays, Goldman Sachs, and Deloitte recruiting from the college.",
    "AVCOE provides support to students interested in entrepreneurship by helping them network with startup mentors and offering workshops on business and startup culture.",
    "AVCOE offers soft skills training in areas like communication, teamwork, leadership, and interview preparation as part of the overall placement training program.",
    "To increase your chances of getting placed through AVCOE, focus on your academic performance, participate in extra-curricular activities, and continuously improve your skills."
  ],
  
  "intent": "college_infrastructure_and_facilities",
  "examples": [
    "What are the facilities available at AVCOE?",
    "Can you tell me about the infrastructure of AVCOE?",
    "What are the amenities provided at AVCOE?",
    "Does AVCOE have a library?",
    "What sports facilities are available at AVCOE?",
    "Does AVCOE have hostels for students?",
    "Is there a gym at AVCOE?",
    "Are there any research labs at AVCOE?",
    "What is the seating capacity of the auditorium at AVCOE?",
    "Does AVCOE have Wi-Fi facilities?",
    "Are there computer labs available for students at AVCOE?",
    "Does AVCOE have any cafeterias or food courts?",
    "What kind of classrooms are there at AVCOE?",
    "How many hostels are there at AVCOE?",
    "What is the campus area of AVCOE?",
    "Does AVCOE have a transport facility for students?",
    "Are there medical facilities on campus?",
    "Does AVCOE have an innovation or startup incubation center?",
    "Can I park my vehicle at AVCOE?",
    "Does AVCOE have a swimming pool?",
    "Is the campus of AVCOE accessible for disabled students?",
    "What are the lab facilities available for students at AVCOE?",
    "Does AVCOE offer an on-campus printing service?",
    "Are there recreation rooms at AVCOE?",
    "What are the hostel facilities at AVCOE?",
    "Is there a bank or ATM on the AVCOE campus?",
    "Does AVCOE have any environmental sustainability initiatives?",
    "What is the quality of internet facilities at AVCOE?",
    "How many buildings are there on the AVCOE campus?",
    "Are there any green spaces or gardens on campus?",
    "Does AVCOE have any dedicated spaces for group work or collaboration?",
    "Does AVCOE have a dedicated auditorium for events?",
    "What is the quality of food in the AVCOE hostel?",
    "Is there a bus service to and from AVCOE?",
    "What are the faculty and student ratios at AVCOE?",
    "How many libraries does AVCOE have?",
    "Are there any recreational activities available at AVCOE?",
    "Does AVCOE offer outdoor sports facilities?",
    "Does AVCOE have a theater or performance hall?",
    "Is there a counseling or wellness center at AVCOE?",
    "Does AVCOE have a parking area for visitors?",
    "Is there a separate facility for postgraduate students at AVCOE?",
    "How many floors are there in each building at AVCOE?",
    "Does AVCOE provide free drinking water facilities?",
    "What is the campus like at AVCOE?",
    "Does AVCOE have smart classrooms?",
    "Are there any cultural or community spaces at AVCOE?",
    "Does AVCOE have a printing and copying center?",
    "What is the security arrangement on the AVCOE campus?",
    "Does AVCOE have a research and development center?",
    "Does AVCOE provide power backup facilities?",
    "What kind of transportation services are available at AVCOE?",
    "Does AVCOE have any partnerships with international institutions for research?",
    "Does AVCOE provide on-campus accommodation for students?",
    "What is the layout of the AVCOE campus?",
    "Is there a career counseling center at AVCOE?",
    "Does AVCOE have any outdoor spaces for students to relax?"
  ],
  "responses": [
    "AVCOE offers state-of-the-art infrastructure including a modern library, computer labs, research facilities, hostels, and recreational areas for students.",
    "The infrastructure at AVCOE is designed to support academic and extracurricular activities with spacious classrooms, well-equipped laboratories, and various student amenities.",
    "Yes, AVCOE has an extensive range of facilities, including a large library, sports facilities, hostels, Wi-Fi, and dedicated spaces for student activities.",
    "AVCOE has a well-stocked library with a wide collection of books, journals, and online resources to aid student research and learning.",
    "AVCOE has a variety of sports facilities including grounds for cricket, football, volleyball, and indoor sports like badminton and table tennis.",
    "Yes, there are separate hostels for male and female students at AVCOE, equipped with all the necessary amenities to ensure a comfortable stay.",
    "AVCOE has a well-equipped gymnasium for students and staff to maintain their physical fitness.",
    "Yes, AVCOE has dedicated research labs across various departments to foster innovation and provide students with hands-on experience.",
    "The auditorium at AVCOE has a large seating capacity and is used for various events, conferences, and cultural activities.",
    "Yes, AVCOE provides Wi-Fi facilities across the campus to ensure students have access to the internet for research and studies.",
    "AVCOE has multiple computer labs with modern systems and high-speed internet to support student learning and research.",
    "Yes, there are multiple cafeterias and food courts at AVCOE offering a variety of food items for students and staff.",
    "AVCOE's classrooms are spacious, air-conditioned, and equipped with modern teaching tools like projectors and smartboards.",
    "AVCOE has multiple hostels with comfortable rooms, 24/7 security, and other amenities to ensure a safe and comfortable living environment for students.",
    "The AVCOE campus covers a significant area, providing ample space for all academic buildings, hostels, sports facilities, and recreational areas.",
    "AVCOE provides a transport facility to help students commute from nearby areas to the campus, making it easier for them to attend classes.",
    "There is a medical center on campus that provides basic healthcare services to students and staff, along with a tie-up for emergencies.",
    "Yes, AVCOE has an incubation center to support startups and innovations by providing resources, mentoring, and networking opportunities.",
    "There are designated parking spaces for both students and staff within the AVCOE campus, as well as visitor parking areas.",
    "No, AVCOE does not have a swimming pool on campus, but it does provide other sports and recreational facilities for students.",
    "Yes, AVCOE's campus is accessible to students with disabilities, with ramps and other facilities for easy movement around the campus.",
    "AVCOE offers a variety of labs for different disciplines, including engineering, computer science, and management, to enhance practical learning experiences.",
    "Yes, AVCOE provides an on-campus printing service where students can print assignments, projects, and other documents.",
    "AVCOE has several recreation rooms, including indoor game areas and lounges where students can relax between classes.",
    "The hostel facilities at AVCOE include well-furnished rooms, common areas, 24/7 security, and access to Wi-Fi and recreational activities.",
    "Yes, there is a bank with an ATM on the AVCOE campus, making it convenient for students to access banking services.",
    "AVCOE has implemented several sustainability initiatives, such as waste management, energy-saving measures, and water conservation, to maintain an eco-friendly campus.",
    "AVCOE provides high-speed internet facilities across the campus, ensuring students have uninterrupted access to online resources for their academic work.",
    "AVCOE has multiple buildings spread across the campus, each dedicated to specific academic departments and student services.",
    "Yes, AVCOE has well-maintained gardens and green spaces within the campus to provide a relaxing atmosphere for students and staff.",
    "AVCOE offers multiple spaces for group work and collaboration, including dedicated project rooms and discussion areas.",
    "Yes, there is a large auditorium at AVCOE, which is used for cultural events, seminars, and other important activities.",
    "The food in the hostel is nutritious and offers a variety of meal options to cater to the needs and preferences of students.",
    "Yes, AVCOE provides a bus service for students, with scheduled routes to pick up and drop off students from nearby areas.",
    "The faculty-to-student ratio at AVCOE is optimized to provide personalized attention to each student and ensure quality education.",
    "AVCOE has multiple libraries across the campus, including a main library and department-specific libraries, to serve the needs of students and faculty.",
    "Yes, AVCOE has a variety of recreational activities, including indoor and outdoor games, cultural events, and student clubs for all-round development.",
    "AVCOE provides outdoor sports facilities including cricket, football, basketball, and volleyball courts, along with a gymnasium.",
    "Yes, AVCOE has a dedicated theater and performance hall for cultural and artistic events.",
    "AVCOE has a counseling and wellness center where students can seek guidance for personal, academic, and mental health concerns.",
    "Yes, there are visitor parking areas on the AVCOE campus for guests attending events or meetings.",
    "AVCOE provides separate facilities for postgraduate students, including dedicated study areas, hostel accommodations, and specialized labs.",
    "AVCOE's buildings have multiple floors, each designated for specific academic departments and student services.",
    "Yes, free drinking water facilities are available at various points across the AVCOE campus to ensure students stay hydrated.",
    "The AVCOE campus is spacious, clean, and well-organized, with modern infrastructure to support students in their academic and extracurricular pursuits.",
    "Yes, AVCOE has smart classrooms with interactive digital boards, projectors, and other technology tools to enhance learning.",
    "Yes, AVCOE has community spaces like auditoriums and cultural halls where students can engage in extracurricular activities, events, and cultural festivals.",
    "AVCOE has a printing and copying center where students can print or photocopy study materials, assignments, and other documents.",
    "The security arrangements at AVCOE include 24/7 surveillance, security guards, and restricted access to ensure the safety of all students and staff.",
    "Yes, AVCOE has a dedicated research and development center that promotes innovation and helps students work on projects and research initiatives.",
    "Yes, AVCOE provides power backup facilities to ensure that there are no interruptions in classes, labs, or other essential services during power outages.",
    "AVCOE offers transportation services including buses and shuttle services for students and staff to make commuting easier and more convenient.",
    "Yes, AVCOE collaborates with various international institutions and research organizations for academic and research purposes, providing students with global exposure.",
    "Yes, AVCOE provides on-campus accommodation for both undergraduate and postgraduate students, offering a range of options depending on the student's requirements.",
    "The campus of AVCOE is well-planned, with academic buildings, hostels, recreational areas, and other facilities spread across the campus to serve the students' needs.",
    "AVCOE has a career counseling center that provides guidance on career opportunities, resume building, interview preparation, and job search strategies.",
    "Yes, AVCOE has several outdoor spaces like gardens, lawns, and open areas where students can relax, study, or participate in outdoor activities."
  ],
  
  
  "intent": "admissions_and_eligibility_criteria",
  "examples": [
    "What is the admission process for AVCOE?",
    "Can you tell me the eligibility criteria for admissions at AVCOE?",
    "What are the requirements for admission to AVCOE?",
    "How can I apply for admission to AVCOE?",
    "What is the admission procedure for undergraduate courses at AVCOE?",
    "What are the entrance exams required for AVCOE admissions?",
    "Do I need to appear for any entrance exam to get admission to AVCOE?",
    "What are the eligibility conditions for engineering courses at AVCOE?",
    "How do I apply for a postgraduate course at AVCOE?",
    "What is the minimum percentage required for admission to AVCOE?",
    "Is there a reservation system for admissions at AVCOE?",
    "Can I get direct admission to AVCOE?",
    "What is the age limit for admission to AVCOE?",
    "Does AVCOE accept JEE scores for admission?",
    "What is the last date for admission to AVCOE?",
    "Is there an online admission process for AVCOE?",
    "Do I need to have a specific background to apply for courses at AVCOE?",
    "Are there any documents required for admission to AVCOE?",
    "Can I get a scholarship for admission to AVCOE?",
    "Is there a hostel facility for students admitted to AVCOE?",
    "What is the admission fee for AVCOE?",
    "Is there an entrance exam for MBA admissions at AVCOE?",
    "How can I check the admission status for AVCOE?",
    "Are the admission results published on the AVCOE website?",
    "How can I apply for a diploma course at AVCOE?",
    "What is the cut-off for admission to AVCOE?",
    "How is the counseling process for admissions at AVCOE?",
    "What are the documents required for admission to AVCOE?",
    "How can I contact the admissions office of AVCOE?",
    "Is there an NRI quota for admissions at AVCOE?",
    "What are the eligibility requirements for a master's degree at AVCOE?",
    "Can I apply for admission to AVCOE after completing my diploma?",
    "What is the eligibility for lateral entry into AVCOE?",
    "Can I get admission to AVCOE through management quota?",
    "Does AVCOE provide direct admission to postgraduate courses?",
    "How can I track the progress of my admission application to AVCOE?",
    "What is the admission process for foreign students at AVCOE?",
    "How much time does the AVCOE admission process take?",
    "What is the procedure for fee payment after admission to AVCOE?",
    "Can I apply for a second chance if I missed the admission deadline at AVCOE?",
    "Do I need to attend an interview for admission to AVCOE?",
    "What are the academic qualifications required for admission to AVCOE?",
    "Can I apply for multiple courses at AVCOE?",
    "What is the eligibility for AVCOE's B.Tech program?",
    "What is the procedure for postgraduate admissions at AVCOE?",
    "What is the fee structure for AVCOE's courses?",
    "What are the specializations available for MBA at AVCOE?",
    "Can I apply for AVCOE's engineering program with a gap in education?",
    "Is there an application fee for AVCOE admissions?",
    "What are the documents needed for postgraduate admissions to AVCOE?",
    "How can I pay my admission fee at AVCOE?",
    "Is there any age relaxation for admission to AVCOE?",
    "What is the admission fee for B.Tech courses at AVCOE?",
    "Is there a minimum rank required in JEE for admission to AVCOE?",
    "What are the benefits of applying for a scholarship at AVCOE?",
    "What are the seat reservations for various categories in AVCOE?"
  ],
  "responses": [
    "The admission process for AVCOE involves filling out an online application, submitting required documents, and fulfilling eligibility criteria. The final selection is based on entrance exam scores or merit.",
    "To be eligible for admission to AVCOE, candidates must meet the academic qualifications, including a minimum percentage in the relevant qualifying exams. For engineering courses, JEE or MHT-CET scores are required.",
    "For undergraduate engineering courses, candidates must have passed 10+2 with Physics, Chemistry, and Mathematics as subjects. Additionally, they must have a valid score in JEE or MHT-CET.",
    "You can apply for admission to AVCOE through their official website by filling out the online application form and submitting the required documents.",
    "For undergraduate courses, AVCOE follows a centralized admission process through MHT-CET or JEE scores. Counseling is conducted based on the merit list.",
    "AVCOE accepts JEE scores for admission to its B.Tech program. Candidates need to have a valid JEE Main score to be considered for admission.",
    "There is no age limit for admission to undergraduate courses at AVCOE. However, candidates must meet the academic qualifications specified for the course.",
    "AVCOE does not have an entrance exam for undergraduate courses. Admission is based on JEE or MHT-CET scores.",
    "For postgraduate courses, candidates must have a relevant undergraduate degree with the minimum required percentage. Additional requirements may apply based on the course.",
    "AVCOE offers a direct admission process through management quota. However, candidates must meet the eligibility criteria for the course they are applying for.",
    "Yes, AVCOE provides hostel facilities for both male and female students. Separate hostels with necessary amenities are available.",
    "The admission fee for AVCOE varies by course. It typically includes tuition fees, library fees, and other administrative charges.",
    "Yes, AVCOE accepts both online and offline applications. You can apply through the official website for the most convenient option.",
    "You will need documents such as your mark sheets, entrance exam scores, passport-size photographs, and identity proof to apply for admission.",
    "AVCOE provides scholarships for deserving students. You can apply for a scholarship through the official scholarship portal during the admission process.",
    "The cutoff for admission to AVCOE depends on the entrance exam score and category. You can check the official website for the latest cutoff information.",
    "Counseling for admissions at AVCOE is based on merit and entrance exam scores. Eligible candidates are called for counseling sessions where seat allocation takes place.",
    "You will need to submit documents like mark sheets, entrance exam scorecard, identity proof, caste certificate (if applicable), and passport-size photographs.",
    "You can contact the admissions office of AVCOE by visiting their official website for contact details or calling the listed phone number.",
    "AVCOE does not have a specific NRI quota for admissions. However, international students can apply through a separate process.",
    "The eligibility for postgraduate courses at AVCOE requires a relevant undergraduate degree with a minimum percentage as specified by the respective course.",
    "Yes, you can apply for lateral entry into AVCOE's engineering programs if you have completed a diploma in engineering from a recognized institution.",
    "Management quota admissions are available for students who meet the eligibility criteria but do not get a seat through the regular counseling process.",
    "Yes, postgraduate admissions at AVCOE are conducted through an entrance exam followed by counseling for seat allocation.",
    "You can track your admission application status through the AVCOE admission portal or by contacting the admissions office directly.",
    "AVCOE provides a separate admission process for foreign students. You can visit the admissions page for detailed guidelines for international candidates.",
    "The admission process at AVCOE typically takes around a month after the application deadline. However, this may vary depending on the course and the number of applicants.",
    "After you have been admitted to AVCOE, you will receive instructions on how to pay your admission fee online through the official portal or via other payment methods.",
    "If you missed the admission deadline, you may be able to apply for a second chance under certain circumstances. Contact the admissions office for more information.",
    "Interviews may be required for certain postgraduate courses, but they are generally not required for undergraduate admissions at AVCOE.",
    "The academic qualifications required for admission to AVCOE vary by course. For B.Tech, candidates must have completed 12th grade with Physics, Chemistry, and Mathematics.",
    "Yes, you can apply for multiple courses at AVCOE, but you must meet the eligibility criteria for each course and complete the separate application process for each.",
    "The eligibility for B.Tech programs at AVCOE includes passing 12th grade with a minimum percentage in Physics, Chemistry, and Mathematics, along with a valid JEE or MHT-CET score.",
    "The postgraduate admission process at AVCOE includes an entrance exam followed by counseling for seat allotment. Specific criteria depend on the course.",
    "The fee structure for AVCOE's courses varies. Detailed information about the fee structure can be obtained from the official AVCOE website or the admissions office.",
    "AVCOE offers various specializations for the MBA program, including Marketing, Finance, Human Resources, and Operations Management.",
    "Yes, you can apply for AVCOE's engineering program even with a gap in education, provided you meet the eligibility criteria.",
    "Yes, there is an application fee for AVCOE admissions. The amount varies depending on the course you are applying for.",
    "For postgraduate admissions, you will need to submit your graduation mark sheet, entrance exam scorecard, identity proof, and other related documents.",
    "The admission fee can be paid online through the AVCOE admission portal, or it can be paid through bank transfer or demand draft, depending on the procedure.",
    "AVCOE does not offer any specific age relaxation for admissions. The eligibility criteria for each course are based on academic qualifications and entrance exam scores.",
    "The B.Tech admission fee for AVCOE includes tuition fees, hostel fees (if applicable), and other charges. Detailed fee information can be found on the AVCOE website.",
    "A minimum rank in JEE or MHT-CET is required for admission to AVCOE's engineering programs. The specific rank cutoff depends on the course and category.",
    "Applying for a scholarship at AVCOE can help reduce tuition fees. Scholarships are offered based on merit, financial need, and other criteria.",
    "AVCOE follows a reservation system for admissions as per the government norms. This includes reservations for categories like SC, ST, OBC, and physically disabled students."
  ],
  
 "intent": "sports_and_events",
  "examples": [
    "What sports are available at Amrutvahini College of Engineering?",
    "Can I participate in extracurricular activities at AVCOE?",
    "What sports events are organized by AVCOE?",
    "Does AVCOE have a Gymkhana for sports activities?",
    "What clubs are available at AVCOE for students?",
    "What types of events are organized by AVCOE's cultural club?",
    "Is there a yoga club at AVCOE?",
    "What is the Robotics Club at AVCOE?",
    "Can students participate in adventure activities at AVCOE?",
    "Are there any upcoming sports events at AVCOE?"
  ],
  "responses": [
    "At AVCOE, students can participate in a variety of sports through the Gymkhana facility, which includes activities like football, cricket, basketball, volleyball, and more.",
    "Yes, AVCOE offers a range of extracurricular activities through various clubs and events, including cultural events, robotics competitions, and sports tournaments.",
    "AVCOE organizes several sports events throughout the year, including inter-college tournaments, annual sports meets, and friendly matches in various disciplines.",
    "Yes, AVCOE has a Gymkhana facility where students can engage in various sports activities. It provides opportunities for both competitive and recreational sports.",
    "AVCOE has several student clubs, including the Cultural Club, Robotics Club, Mudra Club, Yoga Club, Adventure Club, and Hobby Club. These clubs are involved in organizing various events and workshops.",
    "The Cultural Club at AVCOE organizes a variety of events, including performances, competitions, and workshops that celebrate arts, music, dance, and drama.",
    "Yes, AVCOE has a Yoga Club where students can practice yoga and mindfulness to improve physical and mental well-being.",
    "The Robotics Club at AVCOE provides opportunities for students to work on robotics projects, participate in robotics competitions, and attend workshops on the latest robotics technologies.",
    "Yes, AVCOE has an Adventure Club that organizes outdoor activities like trekking, camping, and other adventure-based events.",
    "For the latest information on upcoming sports and extracurricular events at AVCOE, it is best to check the official website or contact the college administration."
  ],
  
   "intent": "hostel_facilities",
  "examples": [
    "What are the hostel facilities available at AVCOE?",
    "Does AVCOE provide hostel accommodation for students?",
    "Are there separate hostels for boys and girls at AVCOE?",
    "How do I apply for a hostel at AVCOE?",
    "What is the hostel fee at AVCOE?",
    "Can students avail of mess facilities at AVCOE hostels?",
    "Are the AVCOE hostels equipped with Wi-Fi?",
    "What are the rules and regulations for staying in AVCOE hostels?",
    "Is there any hostel for first-year students at AVCOE?",
    "Are the hostels at AVCOE close to the campus?"
  ],
  "responses": [
    "AVCOE provides well-furnished hostel accommodations for both boys and girls. The hostels are equipped with essential amenities such as beds, study tables, and wardrobes.",
    "Yes, AVCOE offers hostel facilities for students. Separate hostels are available for male and female students with round-the-clock security and facilities.",
    "AVCOE has separate hostels for boys and girls. The hostels are designed to ensure comfort and safety for students during their stay.",
    "To apply for a hostel at AVCOE, students can fill out the hostel application form available on the college website or approach the hostel management for more details.",
    "The hostel fees at AVCOE vary based on the type of room and the facilities offered. For detailed fee structures, you can visit the official website or contact the hostel office.",
    "Yes, mess facilities are available at the AVCOE hostels. The mess provides nutritious and hygienic food for students on a regular basis.",
    "Yes, AVCOE hostels are equipped with Wi-Fi to help students with their academic work and other internet-related activities.",
    "AVCOE hostels have specific rules and regulations that all residents are required to follow. These include guidelines on behavior, curfew timings, and cleanliness. A hostel manual is provided to all students.",
    "Yes, first-year students can apply for hostel accommodation at AVCOE. However, availability may depend on the hostel capacity and demand.",
    "The hostels at AVCOE are located within the campus, ensuring easy access to academic buildings and other facilities."
  ],
  
  "intent": "library_facilities",
  "examples": [
    "What are the facilities available in the AVCOE library?",
    "Does AVCOE have a digital library?",
    "What is the procedure to borrow books from the AVCOE library?",
    "Are there any online resources available in the AVCOE library?",
    "What is the timing of the AVCOE library?",
    "Can students access the AVCOE library on weekends?",
    "Does AVCOE library provide access to research journals?",
    "Are there any reference books available in the AVCOE library?",
    "Is the AVCOE library open to the public?",
    "How do I get a library membership at AVCOE?",
    "What kind of study materials does the AVCOE library have?",
    "Can I access books related to engineering subjects at AVCOE library?",
    "What is the borrowing period for books in AVCOE library?",
    "Are e-books available in AVCOE library?",
    "What facilities are available for reading in AVCOE library?",
    "Does AVCOE library offer photocopying services?",
    "Can I reserve a book in AVCOE library?",
    "Are group study rooms available in AVCOE library?",
    "Does the AVCOE library offer any multimedia resources?",
    "How many books can I borrow from the AVCOE library at once?",
    "Is there a late fee for overdue books at AVCOE library?",
    "Can I access AVCOE library’s resources off-campus?",
    "Are the library resources free to use for students?",
    "Does the AVCOE library have a collection of old books?",
    "Can I read journals in the AVCOE library?",
    "Is there an online catalog to check library books?",
    "How do I find a book in AVCOE library?",
    "Can I use AVCOE library for my research work?",
    "Does AVCOE library offer online journal subscriptions?",
    "Can I access the library's thesis and dissertation collection?",
    "Are there any databases available for research in the AVCOE library?",
    "What is the procedure to access online journals at AVCOE library?",
    "Is there any facility for alumni to access the AVCOE library?",
    "How do I return books to the AVCOE library?",
    "Can I extend my borrowing period at AVCOE library?",
    "Are there computers available in the AVCOE library for research?",
    "What is the procedure to get a library card at AVCOE?",
    "Is the AVCOE library part of any library network?",
    "How many people can use a study room in AVCOE library?",
    "Does AVCOE library have a collection of rare books?",
    "Can I get help from a librarian at AVCOE library?",
    "Does the AVCOE library offer books in regional languages?",
    "What is the maximum number of books I can borrow from the library?",
    "Can I borrow textbooks from AVCOE library?",
    "Does AVCOE library have an interlibrary loan facility?",
    "Is there a computer lab in AVCOE library?",
    "What kind of periodicals does AVCOE library offer?",
    "Does AVCOE library have access to e-theses?",
    "How do I apply for a library card?",
    "Does the AVCOE library have a mobile app?",
    "Can I download books from the AVCOE library?",
    "What are the different sections in the AVCOE library?",
    "Can I use AVCOE library for preparing for competitive exams?",
    "Does AVCOE library have a collection of reference books?",
    "How is AVCOE library's atmosphere for studying?",
    "Does AVCOE library have a collection of project reports?",
    "How do I access AVCOE library's digital archives?",
    "Are there any specialized books available for computer science in AVCOE library?",
    "What are the available hours for AVCOE library during holidays?",
    "Can I access AVCOE library’s facilities on holidays?",
    "Does AVCOE library have a membership fee?",
    "Is there an online facility to check out books?",
    "Can I use AVCOE library for group studies?",
    "How do I contact AVCOE library for queries?",
    "Does AVCOE library have books related to management studies?",
    "Are there any events organized by AVCOE library?",
    "Does the AVCOE library offer access to international journals?",
    "Are there any AVCOE library workshops for students?",
    "Can I get a librarian’s help for research-related work?",
    "Does the AVCOE library have books for entrance exams?",
    "Does AVCOE library offer free internet access?",
    "What resources are available in AVCOE library for faculty?",
    "Can I borrow books from AVCOE library for my project work?",
    "Is there any mobile app for accessing AVCOE library resources?",
    "Can I donate books to AVCOE library?",
    "Does AVCOE library provide any career resources?",
    "Does AVCOE library have a magazine subscription?",
    "How many computers are available in AVCOE library?",
    "Can I study for exams in AVCOE library?",
    "Is there a student help desk in AVCOE library?",
    "Does AVCOE library provide group study spaces?",
    "Can I use AVCOE library for research on a specific topic?",
    "Does AVCOE library have a collection of medical books?",
    "Can I access AVCOE library’s resources after college hours?",
    "Is there a digital kiosk available in AVCOE library?"
  ],
  "responses": [
    "AVCOE has a well-equipped library with a vast collection of books, journals, and research papers. The library also provides access to various digital resources to aid students in their studies.",
    "Yes, AVCOE has a digital library that offers access to e-books, online journals, and other digital resources to support academic learning.",
    "To borrow books from the AVCOE library, students need to register for a library card. Books can be issued for a specific time period, and fines may apply for overdue books.",
    "The AVCOE library provides access to online resources such as research papers, e-journals, and databases like IEEE, Springer, and Elsevier. These resources can be accessed from the library or remotely using a student account.",
    "The AVCOE library is open from 9:00 AM to 6:00 PM on weekdays. The timing may vary during holidays or special occasions, so it's advisable to check with the library staff for any changes.",
    "Yes, the AVCOE library is open on weekends, usually from 10:00 AM to 2:00 PM. However, this may vary, so it's recommended to confirm with the library.",
    "Yes, the AVCOE library provides access to research journals across various disciplines. Students and faculty can access these resources to support their academic and research work.",
    "The library has a large collection of reference books across multiple disciplines. These books are available for in-library use and cannot be borrowed.",
    "No, the AVCOE library is restricted to students and staff of the college. However, external members may be allowed access under certain conditions with prior permission.",
    "To get a library membership at AVCOE, students need to visit the library with their student ID and fill out a membership form. They will then be issued a library card that allows them to borrow books and access library resources.",
    "The AVCOE library offers a wide variety of books across all engineering disciplines, including Civil, Mechanical, Computer Science, Electrical, and more. There are also books available for competitive exams.",
    "Yes, e-books are available in AVCOE library for students to read and download. They can be accessed online through the digital library portal.",
    "The library has quiet reading spaces, and there are also group study rooms available. Students can study individually or in groups.",
    "Yes, AVCOE library provides photocopying services for students at a nominal fee.",
    "Yes, you can reserve a book in the AVCOE library. Reservation is done on a first-come, first-served basis.",
    "Yes, AVCOE library has group study rooms for students to collaborate and study together. These rooms can be booked in advance.",
    "The AVCOE library offers multimedia resources such as projectors and audio-visual materials to support learning.",
    "Students are allowed to borrow up to 5 books at a time from the AVCOE library. The number may vary based on the type of book and availability.",
    "Yes, overdue books are subject to a fine. The fine structure is available at the library counter.",
    "Students can access AVCOE library resources remotely by logging in to the library’s portal with their student ID and password.",
    "Yes, all library resources are free for students to use. However, some premium resources may require access permissions from the library staff.",
    "AVCOE library has a collection of rare books and historical reference materials for academic use. These books are available for in-library use only.",
    "Yes, you can read journals at the AVCOE library. There is a dedicated section for periodicals and research journals.",
    "Yes, AVCOE library has an online catalog that allows students to search for books and other resources available in the library.",
    "To find a book in AVCOE library, you can use the online catalog available on the library’s website or ask the librarian for assistance.",
    "Yes, AVCOE library supports students in their research work by providing access to online journals, books, and other academic resources.",
    "Yes, AVCOE library subscribes to multiple international journals, providing students with access to global research.",
    "To access online journals, students need to visit the library website, log in with their credentials, and browse available resources.",
    "Alumni members can access the AVCOE library's physical resources but may not have access to digital resources unless they are granted special permission.",
    "Books should be returned to the AVCOE library before the due date. Late fees are charged for overdue books.",
    "Yes, you can extend the borrowing period for books at AVCOE library. Please inform the library staff before the due date for extension.",
    "There are multiple computers available for research and academic purposes in the AVCOE library.",
    "Students can apply for a library card by filling out a form with their student details and submitting it to the library.",
    "AVCOE library is part of the Maharashtra State Library Network, which connects libraries in the region for resource sharing.",
    "The study rooms in AVCOE library can accommodate up to 6 students at a time. For larger groups, students can request booking larger rooms.",
    "Yes, AVCOE library has a collection of rare books that students can use for research purposes.",
    "Librarians are available to help students find resources, recommend books, and assist with research work at AVCOE library.",
    "AVCOE library has a selection of books in regional languages, mostly in Marathi, for students from different linguistic backgrounds."],
	
	
	"intent": "branchwise_departments",
  "examples": [
    "What are the departments available at AVCOE?",
    "Can you provide information about the Computer Science department at AVCOE?",
    "Tell me about the Mechanical Engineering department at AVCOE.",
    "What courses are offered by the Electrical department at AVCOE?",
    "How is the Civil Engineering department at AVCOE?",
    "What are the specializations available in the Electronics and Telecommunication department at AVCOE?",
    "Can you share details about the Information Technology department at AVCOE?",
    "What programs are offered by the Instrumentation department at AVCOE?",
    "How many departments are there at AVCOE?",
    "Is there a department for Artificial Intelligence and Machine Learning at AVCOE?",
    "Does AVCOE have a department for Robotics Engineering?",
    "Tell me about the Chemical Engineering department at AVCOE.",
    "Is there a Biotechnology department at AVCOE?",
    "Does AVCOE offer undergraduate programs in Electrical and Electronics Engineering?",
    "Is the Computer Engineering department available at AVCOE?",
    "What is the scope of the Civil Engineering department at AVCOE?",
    "Can you provide information on the Mechanical Engineering department's lab facilities?",
    "What kind of projects are done by the students in the Electronics department at AVCOE?",
    "Is there a department for Artificial Intelligence in AVCOE?",
    "What is the department-wise faculty strength at AVCOE?"
  ],
  "responses": [
    "AVCOE offers a wide range of departments, including Computer Science, Mechanical Engineering, Civil Engineering, Electronics and Telecommunication Engineering, Electrical Engineering, and Information Technology. Each department has its own faculty and specialized laboratories.",
    "The Computer Science department at AVCOE provides a comprehensive curriculum covering programming, data structures, algorithms, and computer networks. The department also offers research opportunities in fields such as Artificial Intelligence and Machine Learning.",
    "The Mechanical Engineering department at AVCOE focuses on subjects like thermodynamics, fluid mechanics, and material science. The department has state-of-the-art laboratories for practical learning and hands-on experience.",
    "The Electrical Engineering department at AVCOE offers courses in power systems, circuits, and electrical machines. The department also has dedicated labs for electronics and control systems.",
    "The Civil Engineering department at AVCOE focuses on structural analysis, construction materials, and environmental engineering. It provides students with ample opportunities to work on real-time construction projects and internships.",
    "The Electronics and Telecommunication department at AVCOE covers a wide array of topics including communication systems, signal processing, and embedded systems. The department is equipped with specialized labs for hands-on learning.",
    "The Information Technology department at AVCOE offers courses in software development, web technologies, and network security. Students are trained with the latest technologies in IT and participate in industry projects.",
    "The Instrumentation department at AVCOE focuses on areas like process control, automation, and measurement systems. The department offers both theoretical and practical training for instrumentation engineers.",
    "AVCOE has a total of 8 departments offering undergraduate and postgraduate programs in Engineering, each catering to different domains of technology and innovation.",
    "Currently, AVCOE does not have a specific department for Artificial Intelligence and Machine Learning, but the Computer Science department offers elective courses and research opportunities in AI and ML.",
    "AVCOE does not have a dedicated Robotics Engineering department but offers courses in robotics under the Mechanical Engineering and Electronics and Telecommunication departments.",
    "The Chemical Engineering department at AVCOE focuses on chemical process engineering, biochemistry, and thermodynamics. The department emphasizes research and industry collaboration.",
    "Yes, AVCOE has a Biotechnology department that offers courses in molecular biology, bioinformatics, and bioprocess engineering. The department has collaboration with various biotech industries.",
    "Yes, AVCOE offers undergraduate programs in Electrical and Electronics Engineering under its Electrical Engineering department. The curriculum covers both electrical and electronic circuits, systems, and power engineering.",
    "AVCOE offers Computer Engineering as a part of its Computer Science and Engineering department. The department offers a comprehensive program that includes software and hardware aspects of computing.",
    "The Civil Engineering department offers courses on infrastructure design, construction technology, and environmental management. The department also organizes workshops, field visits, and live projects.",
    "The Mechanical Engineering department provides labs for thermodynamics, fluid mechanics, and material testing. Students work on projects related to manufacturing, automation, and energy conversion.",
    "The Electronics department at AVCOE engages in student projects related to communication systems, embedded systems, and IoT. Students actively participate in both academic and industrial projects during their course.",
    "AVCOE offers elective courses in Artificial Intelligence and Machine Learning under its Computer Science and Information Technology departments. The departments are equipped with the necessary infrastructure to support research in these fields.",
    "The faculty strength at AVCOE is distributed across all the departments, with highly qualified professors and industry-experienced instructors. Each department has a dedicated team of faculty members with expertise in their respective fields."
  ],
  
  "intent": "computer_science_department",
  "examples": [
    "What courses are offered in the Computer Science department at AVCOE?",
    "Can you tell me about the Computer Science department at AVCOE?",
    "What specializations are available in the Computer Science department at AVCOE?",
    "What facilities does the Computer Science department provide at AVCOE?",
    "How is the Computer Science department structured at AVCOE?",
    "What research opportunities are available in the Computer Science department at AVCOE?",
    "Does the Computer Science department offer any certification courses at AVCOE?",
    "Can I pursue a B.Tech in Computer Science at AVCOE?",
    "What programming languages are taught in the Computer Science department at AVCOE?",
    "What labs are available in the Computer Science department at AVCOE?",
    "Is Artificial Intelligence offered in the Computer Science department at AVCOE?",
    "What are the career opportunities after completing Computer Science from AVCOE?",
    "Does the Computer Science department at AVCOE offer internships?",
    "How can I apply for the Computer Science department at AVCOE?",
    "What is the syllabus for the Computer Science program at AVCOE?",
    "Does AVCOE's Computer Science department have collaborations with the industry?",
    "How is the faculty in the Computer Science department at AVCOE?",
    "What is the student to faculty ratio in the Computer Science department at AVCOE?",
    "What projects can students do in the Computer Science department at AVCOE?",
    "Does the Computer Science department have tie-ups with tech companies?",
    "What are the eligibility criteria for Computer Science at AVCOE?",
    "Is there a Computer Science club at AVCOE?",
    "Are there any hackathons organized by the Computer Science department at AVCOE?",
    "How can I get involved in research in the Computer Science department at AVCOE?",
    "Is there a Computer Science lab at AVCOE for practical sessions?",
    "What is the infrastructure like in the Computer Science department at AVCOE?",
    "How often are seminars and workshops held in the Computer Science department at AVCOE?",
    "Are there any student exchange programs for Computer Science students at AVCOE?",
    "What is the admission process for the Computer Science department at AVCOE?",
    "What extracurricular activities are available for Computer Science students at AVCOE?",
    "Can I pursue a master's in Computer Science at AVCOE?",
    "What coding languages do students learn in the Computer Science department at AVCOE?",
    "How does the Computer Science department at AVCOE help students with placements?",
    "What kind of support is available for final year Computer Science projects at AVCOE?",
    "Does the Computer Science department offer guidance for competitive exams?",
    "What events are organized by the Computer Science department at AVCOE?",
    "How does the Computer Science department at AVCOE keep up with technological advancements?",
    "Is there any startup support provided for Computer Science students at AVCOE?",
    "Are there any guest lectures from industry professionals in the Computer Science department at AVCOE?",
    "Does the Computer Science department at AVCOE focus on coding skills?",
    "Can I get a scholarship if I am applying for the Computer Science program at AVCOE?",
    "What is the duration of the Computer Science B.Tech program at AVCOE?",
    "Are there any international programs available for Computer Science students at AVCOE?",
    "How are the lab sessions in the Computer Science department at AVCOE?",
    "Is the Computer Science program at AVCOE accredited?",
    "How does the Computer Science department at AVCOE integrate AI and machine learning into the curriculum?",
    "What are the major subjects covered in the Computer Science program at AVCOE?",
    "Are there any international partnerships for research in the Computer Science department at AVCOE?",
    "Can I pursue internships abroad through the Computer Science department at AVCOE?",
    "What is the fee structure for the Computer Science program at AVCOE?",
    "How does the Computer Science department support innovation and entrepreneurship?",
    "What placement statistics are available for Computer Science graduates from AVCOE?",
    "What are the best career paths after completing Computer Science at AVCOE?",
    "What kind of technical support is available for Computer Science students at AVCOE?",
    "Are there any online resources available for students in the Computer Science department at AVCOE?",
    "Does the Computer Science department at AVCOE offer any short-term courses?",
    "What are the chances of getting a high-paying job after completing a Computer Science degree from AVCOE?",
    "How does the Computer Science department at AVCOE encourage innovation?",
    "What skills do I need to succeed in the Computer Science program at AVCOE?",
    "Is there a Computer Science mentorship program at AVCOE?",
    "Does AVCOE offer any industry certification programs through the Computer Science department?",
    "How can I improve my coding skills in the Computer Science department at AVCOE?",
    "Is there a coding bootcamp available through the Computer Science department at AVCOE?",
    "How can I join the Computer Science research groups at AVCOE?",
    "What are the achievements of the Computer Science department at AVCOE?",
    "What is the faculty background in the Computer Science department at AVCOE?",
    "How does the Computer Science department at AVCOE keep students updated with the latest industry trends?",
    "What kinds of coding competitions are organized by the Computer Science department at AVCOE?",
    "Is there any peer-to-peer learning available in the Computer Science department at AVCOE?",
    "Are there any professional development opportunities in the Computer Science department at AVCOE?",
    "How can I access the resources in the Computer Science department at AVCOE?",
    "Is there a library for Computer Science students at AVCOE?",
    "What is the feedback from alumni of the Computer Science department at AVCOE?",
    "How do I apply for scholarships in the Computer Science department at AVCOE?",
    "Does AVCOE offer any research funding for Computer Science projects?",
    "Can I join the Computer Science department at AVCOE if I have a diploma?",
    "Does AVCOE offer any industry partnerships for Computer Science students?",
    "What are the core values of the Computer Science department at AVCOE?",
    "What is the approach of the Computer Science department at AVCOE towards practical learning?",
    "How many seats are available in the Computer Science program at AVCOE?"
  ],
  "responses": [
    "The Computer Science department at AVCOE offers a comprehensive B.Tech program in Computer Science Engineering. The curriculum covers a wide range of topics including programming, algorithms, computer networks, databases, and software engineering.",
    "The Computer Science department at AVCOE offers a variety of undergraduate and postgraduate programs. These include courses in programming languages, computer networks, data structures, and machine learning.",
    "In the Computer Science department at AVCOE, students can specialize in fields such as Artificial Intelligence, Data Science, Cybersecurity, and Software Engineering. The department offers elective courses in these areas.",
    "The Computer Science department at AVCOE provides state-of-the-art facilities including computer labs, high-speed internet access, and dedicated classrooms for practical and theoretical learning.",
    "The Computer Science department at AVCOE is structured with both theoretical coursework and hands-on learning. Students participate in various projects, internships, and industry collaborations to enhance their skills.",
    "The Computer Science department at AVCOE offers research opportunities in fields such as Artificial Intelligence, Big Data, Cybersecurity, and Software Development. Students are encouraged to participate in research projects with faculty guidance.",
    "Yes, the Computer Science department at AVCOE offers certification courses in technologies such as Python, Java, and web development. These certifications are intended to provide students with industry-relevant skills.",
    "Yes, you can pursue a B.Tech in Computer Science at AVCOE. The program covers key aspects of computer science, such as software engineering, algorithms, databases, and operating systems.",
    "The Computer Science department at AVCOE teaches various programming languages such as C, C++, Java, Python, and JavaScript. Students are also introduced to web development technologies and mobile app development.",
    "The Computer Science department at AVCOE has several labs equipped with high-end computers, software for programming and development, and hardware for embedded systems projects. There are also dedicated labs for Artificial Intelligence and Data Science.",
    "Yes, the Computer Science department offers specialization in Artificial Intelligence, which includes courses on machine learning, neural networks, and natural language processing.",
    "Graduates of the Computer Science program at AVCOE have ample career opportunities in fields like software development, data science, AI research, and IT consulting. Many students are recruited by top tech companies.",
    "Yes, the Computer Science department at AVCOE offers internship opportunities to students, helping them gain hands-on experience in real-world projects.",
    "To apply for the Computer Science department at AVCOE, you need to meet the eligibility criteria and submit your application through the official admission portal.",
    "The syllabus for the Computer Science program at AVCOE covers topics like programming, algorithms, databases, software engineering, machine learning, and web development.",
    "The Computer Science department at AVCOE has collaborations with leading tech companies for internships, industrial visits, and placement drives.",
    "The Computer Science department at AVCOE has a team of highly qualified faculty members who are experts in their respective fields.",
    "The student-to-faculty ratio in the Computer Science department is maintained at an optimal level to ensure individual attention and guidance for every student.",
    "Students in the Computer Science department at AVCOE are encouraged to work on projects like software development, data science models, and AI-based applications.",
    "Yes, the Computer Science department has tie-ups with tech giants like Google, Microsoft, and Infosys for internship and placement opportunities.",
    "The eligibility criteria for the Computer Science department at AVCOE include completing 12th grade with Physics, Mathematics, and an additional subject such as Chemistry or Computer Science.",
    "Yes, there is a Computer Science club at AVCOE, where students can participate in coding contests, hackathons, and workshops.",
    "The Computer Science department organizes hackathons, coding competitions, and technical fests to encourage students to showcase their skills.",
    "You can get involved in research in the Computer Science department by joining research groups, assisting faculty with projects, or pursuing independent research under faculty supervision.",
    "Yes, the Computer Science department has a dedicated lab for practical sessions in programming, software development, and AI research."],
	
	"intent": "subjectwise_info",
  "examples": [
    "What are the subjects in the first year of engineering at AVCOE?",
    "Can you tell me the syllabus for Computer Science subjects at AVCOE?",
    "What are the subjects for Mechanical Engineering students at AVCOE?",
    "Tell me the subjects in Electrical Engineering at AVCOE.",
    "What are the core subjects for Civil Engineering students at AVCOE?",
    "What electives are available for Electronics and Telecommunication Engineering students at AVCOE?",
    "Can you provide a list of subjects for Information Technology students at AVCOE?",
    "What are the subjects for Instrumentation Engineering students at AVCOE?",
    "What is the syllabus for Chemical Engineering at AVCOE?",
    "Can you share the subjects for Biotechnology students at AVCOE?",
    "What are the core and elective subjects in the Computer Engineering department at AVCOE?",
    "Which subjects are included in the second year of Civil Engineering at AVCOE?",
    "Tell me about the subjects offered in the third year of Mechanical Engineering at AVCOE.",
    "What are the subjects in the final year of Electrical Engineering at AVCOE?",
    "Are there any AI/ML-related subjects in the Computer Science curriculum at AVCOE?",
    "Which subjects do students of the Electronics department study at AVCOE?",
    "Can you provide details on the core and elective subjects in the Civil Engineering program at AVCOE?",
    "How many subjects are there in the first year of the engineering program at AVCOE?"
  ],
  "responses": [
    "In the first year of engineering at AVCOE, students study foundational subjects such as Mathematics, Physics, Chemistry, Engineering Mechanics, and Computer Programming. These subjects are designed to provide a solid base for the core engineering disciplines.",
    "The Computer Science department at AVCOE covers subjects like Data Structures, Algorithms, Operating Systems, Computer Networks, and Software Engineering in the first and second years. Electives such as Artificial Intelligence, Machine Learning, and Data Science are also offered in later years.",
    "In the Mechanical Engineering department at AVCOE, core subjects include Thermodynamics, Fluid Mechanics, Strength of Materials, Engineering Mechanics, and Manufacturing Processes. Advanced electives like Robotics, CAD/CAM, and Vibration Analysis are available in the later years.",
    "The Electrical Engineering department at AVCOE offers subjects such as Circuit Theory, Electrical Machines, Power Systems, Control Systems, and Electromagnetic Fields in the initial years. Later years focus on advanced topics like Power Electronics, Renewable Energy Systems, and Electrical Drives.",
    "The Civil Engineering syllabus at AVCOE includes core subjects such as Structural Analysis, Building Materials, Fluid Mechanics, Geotechnical Engineering, and Transportation Engineering. Elective subjects like Environmental Engineering and Construction Management are available in the later years.",
    "The Electronics and Telecommunication Engineering department at AVCOE offers subjects including Digital Electronics, Analog Electronics, Signals and Systems, Communication Systems, and Microprocessors. Electives such as Embedded Systems and IoT are available in later semesters.",
    "The Information Technology department at AVCOE includes subjects like Database Management, Web Technologies, Network Security, Software Engineering, and Operating Systems. Electives in Cloud Computing, Cybersecurity, and Data Science are offered in advanced years.",
    "The Instrumentation Engineering syllabus includes subjects like Process Control, Measurement Systems, Industrial Instrumentation, Automation, and Control Systems. Electives like Robotics and Data Acquisition Systems are offered in the later years.",
    "The Chemical Engineering department at AVCOE covers subjects such as Material Science, Fluid Mechanics, Process Control, Thermodynamics, and Biochemical Engineering. In later semesters, electives include topics like Environmental Engineering and Process Optimization.",
    "Yes, the Biotechnology department at AVCOE includes subjects such as Biochemistry, Molecular Biology, Genetic Engineering, Bioprocess Engineering, and Bioinformatics. Elective subjects such as Nanotechnology and Biopharmaceuticals are also offered.",
    "In the Computer Engineering department at AVCOE, students study subjects such as Discrete Mathematics, Data Structures, Computer Networks, Digital Electronics, and Software Engineering. Electives in Artificial Intelligence, Machine Learning, and Cloud Computing are offered in higher years.",
    "In the second year of Civil Engineering at AVCOE, subjects like Fluid Mechanics, Structural Analysis, Material Science, and Geotechnical Engineering are covered. Elective subjects like Environmental Engineering are also introduced.",
    "In the third year of Mechanical Engineering at AVCOE, subjects include Strength of Materials, Machine Design, Heat Transfer, Manufacturing Technology, and Fluid Dynamics. Electives such as Robotics, Automation, and Vibrations are also offered.",
    "The final year of Electrical Engineering at AVCOE includes subjects like Power System Protection, Electrical Drives, Power Electronics, and Renewable Energy. Students also engage in a major project in their final year to apply the knowledge gained.",
    "Yes, the Computer Science department at AVCOE offers electives related to Artificial Intelligence and Machine Learning in the later years of the program. These electives are designed to provide in-depth knowledge of AI, ML, and their practical applications.",
    "The Electronics department at AVCOE offers subjects like Digital Electronics, Control Systems, Communication Systems, Embedded Systems, and Microprocessors. Students also work on projects related to IoT, Robotics, and Signal Processing.",
    "The Civil Engineering program at AVCOE offers core subjects such as Structural Analysis, Building Materials, Fluid Mechanics, and Geotechnical Engineering in earlier years. Later years include electives like Environmental Engineering, Construction Management, and Infrastructure Design.",
    "In the first year of the engineering program at AVCOE, students study subjects like Mathematics, Physics, Chemistry, Engineering Mechanics, and Introduction to Computing. These subjects are essential for developing a foundation in engineering principles."
  ],
  
  
   "intent": "subjectwise_info",
  "examples": [
    "What are the subjects in the first year of engineering at AVCOE?",
    "Can you tell me the syllabus for Computer Science subjects at AVCOE?",
    "What are the subjects for Mechanical Engineering students at AVCOE?",
    "Tell me the subjects in Electrical Engineering at AVCOE.",
    "What are the core subjects for Civil Engineering students at AVCOE?",
    "What electives are available for Electronics and Telecommunication Engineering students at AVCOE?",
    "Can you provide a list of subjects for Information Technology students at AVCOE?",
    "What are the subjects for Instrumentation Engineering students at AVCOE?",
    "What is the syllabus for Chemical Engineering at AVCOE?",
    "Can you share the subjects for Biotechnology students at AVCOE?",
    "What are the core and elective subjects in the Computer Engineering department at AVCOE?",
    "Which subjects are included in the second year of Civil Engineering at AVCOE?",
    "Tell me about the subjects offered in the third year of Mechanical Engineering at AVCOE.",
    "What are the subjects in the final year of Electrical Engineering at AVCOE?",
    "Are there any AI/ML-related subjects in the Computer Science curriculum at AVCOE?",
    "Which subjects do students of the Electronics department study at AVCOE?",
    "Can you provide details on the core and elective subjects in the Civil Engineering program at AVCOE?",
    "How many subjects are there in the first year of the engineering program at AVCOE?",
    "Tell me the subjects covered in the third year of Civil Engineering at AVCOE.",
    "What are the electives available in the second year of Computer Science at AVCOE?",
    "Are there any specific robotics subjects at AVCOE?",
    "What subjects do students in the Biotechnology department at AVCOE study?",
    "What are the key subjects covered in the Computer Engineering program at AVCOE?",
    "Can you tell me about the Mathematics subjects in engineering at AVCOE?",
    "How are the electronics subjects structured at AVCOE?",
    "What subjects are available for the final year of Information Technology students at AVCOE?",
    "What are the subjects in the second year of Instrumentation Engineering at AVCOE?",
    "Are there any elective subjects in the final year of Electrical Engineering at AVCOE?",
    "What are the core subjects for the first year of engineering at AVCOE?",
    "Can you list the subjects offered in the second year of Mechanical Engineering at AVCOE?",
    "What are the most important subjects in Chemical Engineering at AVCOE?",
    "What subjects in Civil Engineering deal with environmental concerns at AVCOE?",
    "What are the core and elective subjects in the Mechanical Engineering program at AVCOE?",
    "What are the subjects related to automation and process control at AVCOE?",
    "Can you explain the subjects in Electrical Engineering related to power systems?",
    "What electives are available for final-year students in the Civil Engineering department at AVCOE?",
    "Tell me about the lab-based subjects for Computer Science students at AVCOE.",
    "What subjects do students of the Electronics department at AVCOE study in the third year?",
    "What kind of subjects do students in the Biotechnology department study in their final year?",
    "What core subjects are taught to students of Instrumentation Engineering in their second year?",
    "How is the subject structure for the Information Technology department at AVCOE?",
    "What subjects are taught in the final year of Computer Science at AVCOE?",
    "Can you list all the subjects offered in the first year of engineering at AVCOE?",
    "What are the most important subjects in the third year of Electrical Engineering at AVCOE?",
    "How are electives structured in the second year of Civil Engineering at AVCOE?",
    "Can you provide the subjects offered for students in the final year of Mechanical Engineering at AVCOE?",
    "What are the advanced subjects in Chemical Engineering at AVCOE?",
    "Tell me about the core subjects in Electrical Engineering at AVCOE.",
    "What are the core subjects for Computer Engineering students at AVCOE?",
    "Can you tell me about the subjects that focus on machine learning and artificial intelligence at AVCOE?",
    "What subjects related to construction and materials are offered in Civil Engineering at AVCOE?",
    "What are the most important subjects related to robotics in Mechanical Engineering at AVCOE?",
    "How is the subject progression in Electronics and Telecommunication Engineering at AVCOE?",
    "Can you list subjects in the second year of Chemical Engineering at AVCOE?",
    "What are the subjects related to data science in the Computer Science department at AVCOE?",
    "How are electrical circuits taught in the Electrical Engineering department at AVCOE?",
    "What electives are available for Biotechnology students at AVCOE?",
    "Can you explain the subjects related to embedded systems at AVCOE?",
    "What are the core subjects related to programming in Computer Science at AVCOE?",
    "Can you share the subjects related to network security in Information Technology at AVCOE?",
    "What subjects in Mechanical Engineering are focused on materials and manufacturing?",
    "How many subjects are taught in the final year of Civil Engineering at AVCOE?",
    "What subjects related to thermodynamics are offered in Mechanical Engineering at AVCOE?",
    "Can you explain the subjects related to geotechnical engineering at AVCOE?",
    "What are the subjects in Electrical Engineering related to control systems?",
    "What electives are available for students in the final year of Information Technology at AVCOE?",
    "Can you provide a detailed list of subjects for first-year Civil Engineering students at AVCOE?",
    "How many subjects related to data structures are covered in Computer Science at AVCOE?",
    "Tell me about the practical subjects in Instrumentation Engineering at AVCOE.",
    "What are the core subjects in Biotechnology at AVCOE?",
    "How are communication systems taught in Electronics and Telecommunication at AVCOE?",
    "What are the subjects offered in the third year of Instrumentation Engineering at AVCOE?",
    "What electives in Machine Learning are available in the final year of Computer Science at AVCOE?",
    "What are the core subjects related to fluid mechanics in Mechanical Engineering at AVCOE?",
    "How is the subject structure in the first year of Instrumentation Engineering at AVCOE?",
    "What subjects are related to software engineering in Computer Science at AVCOE?",
    "Can you explain the subject structure in Electrical Engineering in the second year at AVCOE?",
    "What are the core subjects in the Chemical Engineering program at AVCOE?",
    "Can you list all the subjects in the second year of Biotechnology at AVCOE?",
    "Tell me about the practical subjects in the Civil Engineering department at AVCOE?",
    "What are the subjects offered in the first year of Electronics Engineering at AVCOE?",
    "What are the key subjects in the Electrical Engineering program at AVCOE?",
    "What electives are available in the second year of Electronics and Telecommunication Engineering at AVCOE?",
    "Can you share the syllabus for Mechanical Engineering at AVCOE?",
    "What are the subjects offered in the third year of Electronics at AVCOE?"
  ],
  "responses": [
    "In the first year of engineering at AVCOE, students study foundational subjects such as Mathematics, Physics, Chemistry, Engineering Mechanics, and Computer Programming. These subjects are designed to provide a solid base for the core engineering disciplines.",
    "The Computer Science department at AVCOE covers subjects like Data Structures, Algorithms, Operating Systems, Computer Networks, and Software Engineering in the first and second years. Electives such as Artificial Intelligence, Machine Learning, and Data Science are also offered in later years.",
    "In the Mechanical Engineering department at AVCOE, core subjects include Thermodynamics, Fluid Mechanics, Strength of Materials, Engineering Mechanics, and Manufacturing Processes. Advanced electives like Robotics, CAD/CAM, and Vibration Analysis are available in the later years.",
    "The Electrical Engineering department at AVCOE offers subjects such as Circuit Theory, Electrical Machines, Power Systems, Control Systems, and Electromagnetic Fields in the initial years. Later years focus on advanced topics like Power Electronics, Renewable Energy Systems, and Electrical Drives.",
    "The Civil Engineering syllabus at AVCOE includes core subjects such as Structural Analysis, Building Materials, Fluid Mechanics, Geotechnical Engineering, and Transportation Engineering. Elective subjects like Environmental Engineering and Construction Management are available in the later years.",
    "The Electronics and Telecommunication Engineering department at AVCOE offers subjects including Digital Electronics, Analog Electronics, Signals and Systems, Communication Systems, and Microprocessors. Electives such as Embedded Systems and IoT are available in later semesters.",
    "The Information Technology department at AVCOE includes subjects like Database Management, Web Technologies, Network Security, Software Engineering, and Operating Systems. Electives in Cloud Computing, Cybersecurity, and Data Science are offered in advanced years.",
    "The Instrumentation Engineering syllabus includes subjects like Process Control, Measurement Systems, Industrial Instrumentation, Automation, and Control Systems. Electives like Robotics and Data Acquisition Systems are offered in the later years.",
    "The Chemical Engineering department at AVCOE covers subjects such as Material Science, Fluid Mechanics, Process Control, Thermodynamics, and Biochemical Engineering. In later semesters, electives include topics like Environmental Engineering and Process Optimization.",
    "Yes, the Biotechnology department at AVCOE includes subjects such as Biochemistry, Molecular Biology, Genetic Engineering, Bioprocess Engineering, and Bioinformatics. Elective subjects such as Nanotechnology and Biopharmaceuticals are also offered.",
    "In the Computer Engineering department at AVCOE, students study subjects such as Discrete Mathematics, Data Structures, Computer Networks, Digital Electronics, and Software Engineering. Electives in Artificial Intelligence, Machine Learning, and Cloud Computing are offered in higher years.",
    "In the second year of Civil Engineering at AVCOE, subjects like Fluid Mechanics, Structural Analysis, Material Science, and Geotechnical Engineering are covered. Elective subjects like Environmental Engineering are also introduced.",
    "In the third year of Mechanical Engineering at AVCOE, subjects include Strength of Materials, Machine Design, Heat Transfer, Manufacturing Technology, and Fluid Dynamics. Electives such as Robotics, Automation, and Vibrations are also offered.",
    "The final year of Electrical Engineering at AVCOE includes subjects like Power System Protection, Electrical Drives, Power Electronics, and Renewable Energy. Students also engage in a major project in their final year to apply the knowledge gained.",
    "Yes, the Computer Science department at AVCOE offers electives related to Artificial Intelligence and Machine Learning in the later years of the program. These electives are designed to provide in-depth knowledge of AI, ML, and their practical applications.",
    "The Electronics department at AVCOE offers subjects like Digital Electronics, Control Systems, Communication Systems, Embedded Systems, and Microprocessors. Students also work on projects related to IoT, Robotics, and Signal Processing.",
    "The Civil Engineering program at AVCOE offers core subjects such as Structural Analysis, Building Materials, Fluid Mechanics, and Geotechnical Engineering in earlier years. Later years include electives like Environmental Engineering, Construction Management, and Infrastructure Design.",
    "In the first year of the engineering program at AVCOE, students study subjects like Mathematics, Physics, Chemistry, Engineering Mechanics, and Introduction to Computing. These subjects are essential for developing a foundation in engineering principles.",
    "The second year of Civil Engineering includes subjects on Structural Mechanics, Concrete Technology, Water Resources, and Soil Mechanics. Students also take practical-based courses to complement their theoretical learning.",
    "In the second year of Computer Science, students study subjects such as Discrete Mathematics, Data Structures, Software Engineering, and Operating Systems. Some elective subjects in this year include Database Management and Web Technologies.",
    "The Robotics-related subjects are offered under Mechanical Engineering, Electronics and Telecommunication, and Computer Science departments. These subjects include Robotics and Automation and are offered as electives in the later years.",
    "The Biotechnology department at AVCOE offers core subjects such as Molecular Biology, Biochemistry, Bioprocess Engineering, and Genetic Engineering. Electives like Bioinformatics and Nanotechnology are also available in advanced years.",
    "The Computer Engineering program at AVCOE offers subjects like Digital Electronics, Computer Networks, Data Structures, and Software Engineering. Students can specialize in fields such as AI, ML, and Robotics through electives.",
    "In the first year of engineering at AVCOE, Mathematics, Physics, and Chemistry are foundational subjects along with Engineering Mechanics and introductory courses in Computer Science and Programming.",
    "The Electronics department offers subjects such as Analog Electronics, Communication Systems, and Digital Logic in the first year. Later, electives like Embedded Systems and Signal Processing are offered.",
    "The final year subjects for Information Technology students at AVCOE include Software Engineering, Cloud Computing, Advanced Database Management, and IT Project Management.",
    "The second-year Instrumentation Engineering subjects at AVCOE include Measurement Systems, Process Control, Industrial Instrumentation, and Electrical Systems Design.",
    "Electrical Engineering students at AVCOE have electives like Power Electronics, Renewable Energy Systems, and Electrical Drives available in their final year to enhance their expertise.",
    "The first-year core subjects at AVCOE include Mathematics, Physics, Chemistry, Engineering Mechanics, and Programming for all engineering disciplines.",
    "Mechanical Engineering students in their second year study subjects such as Thermodynamics, Manufacturing Processes, Fluid Mechanics, and Engineering Mechanics."]
	
	
	
	
  
    }
  ]
}
